--------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/DataCleaning/VENI_P2_1_Clean06.log
  log type:  text
 opened on:   2 Feb 2021, 12:08:31

. 
. /*
> File:                   VENI_P2_1_Clean06.do
> Author(s):              a.knigge@uu.nl 
> Date:                   2018-10-19
> Purpose:                Clean dataset and create variables.
> Source data:    NTR_P2_0_01.dta
> Contains:               Source data as received from the Netherlands Twin Register 
> Remarks:                Comments starting and ending with !! point out that action may be required if you change anything to this do-file
> */
. 
. //      STEP 0 ==========================================================================================================
. //      Program Setup
. 
. version 13.1

. clear all

. set linesize 140

. macro drop _all

. set more off

. 
. 
. *       We make locals for the path(s) of the folder(s) in which the data that we use and save can be found. 
. *       The purpose? If there is a change in the directory structure, the paths only need to be updated once, namely here.
. local path1 = "P2/WorkInProgress/Analyses/"

. 
. /*      
>         The dataset(s) that is/are used may change. Then, they get a different version number. 
>         !!Change numbers below to use the newest version of a dataset!! 
> */
. local VersionUF1 = "01"         // UF1 = UsedFile1 

. 
. /*
>         We save in this do-file: .dta  
>         If anything changes in the do-file: 
>         !!Update below the version number of the data that are saved!!
> */
. local VersionSF1 = "06"         // SF1 = SavedFile1

. 
. use "`path1'NTR_P2_0_`VersionUF1'", clear

. 
. 
. //      STEP 1 ==========================================================================================================
. //      Create Outcome Variables
. 
. 
. //      STEP 1.1 --------------------------------------------------------------------------------------------------------
. //      Educational attainment age 12 filled in by the mother
.  
. **      Explore which categories there are over the years
. 
. *       Which survey is taken when?
. tab invjrm12 if hschm12_v2<.

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1999 |        395       99.50       99.50
                   2000 |          2        0.50      100.00
------------------------+-----------------------------------
                  Total |        397      100.00

. tab invjrm12 if hschm12_v3<.

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1999 |        467       16.64       16.64
                   2000 |        539       19.20       35.84
                   2001 |        665       23.69       59.53
                   2002 |        925       32.95       92.48
                   2003 |        207        7.37       99.86
                   2004 |          4        0.14      100.00
------------------------+-----------------------------------
                  Total |      2,807      100.00

. tab invjrm12 if hschm12   <.

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2003 |        441        3.76        3.76
                   2004 |      1,382       11.79       15.55
                   2005 |      1,127        9.61       25.16
                   2006 |        835        7.12       32.28
                   2007 |        822        7.01       39.29
                   2008 |      1,131        9.65       48.93
                   2009 |      1,023        8.72       57.66
                   2010 |      1,176       10.03       67.69
                   2011 |      1,084        9.24       76.93
                   2012 |      1,048        8.94       85.87
                   2013 |        783        6.68       92.55
                   2014 |        771        6.58       99.12
                   2015 |        103        0.88      100.00
------------------------+-----------------------------------
                  Total |     11,726      100.00

. tab invjrm12 if hschm12_1n<.

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2008 |      1,102       15.56       15.56
                   2009 |      1,013       14.31       29.87
                   2010 |      1,176       16.61       46.48
                   2011 |      1,084       15.31       61.79
                   2012 |      1,048       14.80       76.60
                   2013 |        783       11.06       87.66
                   2014 |        771       10.89       98.55
                   2015 |        103        1.45      100.00
------------------------+-----------------------------------
                  Total |      7,080      100.00

. tab invjrm12 if hschm12_2n<.

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2009 |          2        0.24        0.24
                   2011 |          2        0.24        0.49
                   2012 |         10        1.22        1.71
                   2013 |        771       94.37       96.08
                   2014 |         32        3.92      100.00
------------------------+-----------------------------------
                  Total |        817      100.00

. tab invjrm12 if hschm12_3n<.

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2009 |          2        0.24        0.24
                   2011 |          2        0.24        0.49
                   2012 |         10        1.22        1.71
                   2013 |        771       94.37       96.08
                   2014 |         32        3.92      100.00
------------------------+-----------------------------------
                  Total |        817      100.00

. tab invjrm12 if vervolgm12<.    // Same results when twzyg<. is added

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2006 |        829        9.45        9.45
                   2007 |        822        9.37       18.83
                   2008 |      1,131       12.90       31.72
                   2009 |      1,023       11.66       43.39
                   2010 |      1,176       13.41       56.80
                   2011 |      1,084       12.36       69.16
                   2012 |      1,048       11.95       81.11
                   2013 |        783        8.93       90.03
                   2014 |        771        8.79       98.83
                   2015 |        103        1.17      100.00
------------------------+-----------------------------------
                  Total |      8,770      100.00

. 
. *       What years of birth do each survey cover?
. tab yob if hschm12_v2<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |        100       25.19       25.19
       1987 |        297       74.81      100.00
------------+-----------------------------------
      Total |        397      100.00

. tab yob if hschm12_v3<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |        104        3.71        3.71
       1987 |        414       14.75       18.45
       1988 |        564       20.09       38.55
       1989 |        659       23.48       62.02
       1990 |        947       33.74       95.76
       1991 |        119        4.24      100.00
------------+-----------------------------------
      Total |      2,807      100.00

. tab yob if hschm12   <.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |        998        8.51        8.51
       1992 |      1,163        9.92       18.43
       1993 |      1,029        8.78       27.20
       1994 |        793        6.76       33.97
       1995 |        932        7.95       41.92
       1996 |      1,119        9.54       51.46
       1997 |      1,086        9.26       60.72
       1998 |      1,133        9.66       70.38
       1999 |      1,208       10.30       80.68
       2000 |        850        7.25       87.93
       2001 |        771        6.58       94.51
       2002 |        644        5.49      100.00
------------+-----------------------------------
      Total |     11,726      100.00

. tab yob if hschm12_1n<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |        298        4.21        4.21
       1996 |      1,090       15.40       19.60
       1997 |      1,086       15.34       34.94
       1998 |      1,133       16.00       50.95
       1999 |      1,208       17.06       68.01
       2000 |        850       12.01       80.01
       2001 |        771       10.89       90.90
       2002 |        644        9.10      100.00
------------+-----------------------------------
      Total |      7,080      100.00

. tab yob if hschm12_2n<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          2        0.24        0.24
       1999 |          4        0.49        0.73
       2000 |        238       29.13       29.87
       2001 |        573       70.13      100.00
------------+-----------------------------------
      Total |        817      100.00

. tab yob if hschm12_3n<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          2        0.24        0.24
       1999 |          4        0.49        0.73
       2000 |        238       29.13       29.87
       2001 |        573       70.13      100.00
------------+-----------------------------------
      Total |        817      100.00

. tab yob if vervolgm12<.                 // Same results when twzyg<. is added

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1993 |        234        2.67        2.67
       1994 |        793        9.04       11.71
       1995 |        932       10.63       22.34
       1996 |      1,119       12.76       35.10
       1997 |      1,086       12.38       47.48
       1998 |      1,133       12.92       60.40
       1999 |      1,208       13.77       74.17
       2000 |        850        9.69       83.87
       2001 |        771        8.79       92.66
       2002 |        644        7.34      100.00
------------+-----------------------------------
      Total |      8,770      100.00

. 
. *   Which categories are there in each survey?
. tab hschm12_v2

       Onderwijs - Naar welke vorm van |
    vervolgonderwijs gaat de tweeling? |
                         (versie groen |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
               nog niet van toepassing |         31        7.81        7.81
             speciaal vervolgonderwijs |          3        0.76        8.56
                lager beroepsonderwijs |         28        7.05       15.62
           middelbaar beroepsonderwijs |         11        2.77       18.39
brugklas (anders dan beroepsonderwijs) |         91       22.92       41.31
                                  MAVO |         65       16.37       57.68
                                  HAVO |         82       20.65       78.34
                         VWO-gymnasium |         86       21.66      100.00
---------------------------------------+-----------------------------------
                                 Total |        397      100.00

. tab hschm12_v3

      Onderwijs - Gaat het kind op dit |
  moment al naar het vervolgonderwijs? |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                               missing |        451       16.07       16.07
               nog niet van toepassing |        612       21.80       37.87
             speciaal vervolgonderwijs |         11        0.39       38.26
                lager beroepsonderwijs |         21        0.75       39.01
           middelbaar beroepsonderwijs |         13        0.46       39.47
                                  VMBO |        376       13.40       52.87
brugklas (anders dan beroepsonderwijs) |         18        0.64       53.51
                    brugklas MAVO/HAVO |        375       13.36       66.87
                     brugklas HAVO/VWO |        557       19.84       86.71
                                  MAVO |         54        1.92       88.64
                                  HAVO |         72        2.57       91.20
                         VWO-gymnasium |        247        8.80      100.00
---------------------------------------+-----------------------------------
                                 Total |      2,807      100.00

. tab hschm12

        Onderwijs - Naar welke vorm van |
     vervolgonderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                           inconsistent |          6        0.05        0.05
                unclear - double marked |        754        6.43        6.48
                                missing |      3,423       29.19       35.67
                nog niet van toepassing |      1,904       16.24       51.91
    SVO (speciaal voortgezet onderwijs) |         78        0.67       52.58
                PRO (praktijkonderijws) |         57        0.49       53.06
                      VMBO theoretische |        979        8.35       61.41
                  VMBO gemengde leerweg |        229        1.95       63.36
       VMBO kaderberoepsgericht leerweg |        392        3.34       66.71
      VMBO basisberoepsgerichte leerweg |        257        2.19       68.90
                                   HAVO |      1,342       11.44       80.34
                                    VWO |      1,329       11.33       91.68
                              gymnasium |        366        3.12       94.80
             dubbel antwoord: vmbo/havo |        151        1.29       96.09
dubbel antwoord: vmbo verschillende lee |         26        0.22       96.31
    dubbel antwoord: vmbo beroep + havo |         20        0.17       96.48
               dubbel antwoord: vwo/gym |          1        0.01       96.49
         dubbel antwoord: vmbo/havo/vwo |          2        0.02       96.50
              dubbel antwoord: havo/vwo |        410        3.50      100.00
----------------------------------------+-----------------------------------
                                  Total |     11,726      100.00

. tab hschm12_1n

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           1e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                         inconsistent |          6        0.08        0.08
              unclear - double marked |        754       10.65       10.73
                              missing |      3,297       46.57       57.30
 1 SVO (speciaal voorgezet onderwijs) |         47        0.66       57.97
            2 PRO (praktijkonderwijs) |         25        0.35       58.32
          3 VMBO theoretische leerweg |        571        8.06       66.38
              4 VMBO gemengde leerweg |        105        1.48       67.87
  5 VMBO kaderberoepsgerichte leerweg |        232        3.28       71.14
  6 VMBO basisberoepsgerichte leerweg |        157        2.22       73.36
                               7 HAVO |        812       11.47       84.83
                                8 VWO |        708       10.00       94.83
                          9 gymnasium |        366        5.17      100.00
--------------------------------------+-----------------------------------
                                Total |      7,080      100.00

. tab hschm12_2n

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           2e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                              missing |        700       85.68       85.68
              4 VMBO gemengde leerweg |          3        0.37       86.05
  5 VMBO kaderberoepsgerichte leerweg |          4        0.49       86.54
  6 VMBO basisberoepsgerichte leerweg |          6        0.73       87.27
                               7 HAVO |         28        3.43       90.70
                                8 VWO |         75        9.18       99.88
                          9 gymnasium |          1        0.12      100.00
--------------------------------------+-----------------------------------
                                Total |        817      100.00

. tab hschm12_3n

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           3e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                              missing |        810       99.14       99.14
  5 VMBO kaderberoepsgerichte leerweg |          1        0.12       99.27
  6 VMBO basisberoepsgerichte leerweg |          2        0.24       99.51
                                8 VWO |          2        0.24       99.76
                          9 gymnasium |          2        0.24      100.00
--------------------------------------+-----------------------------------
                                Total |        817      100.00

. tab vervolgm12

   Onderwijs - Gaat het |
  kind op dit moment al |
               naar het |
   vervolgonderwijs? ja |
                namelij |      Freq.     Percent        Cum.
------------------------+-----------------------------------
unclear - double marked |          2        0.02        0.02
                missing |        199        2.27        2.29
                    nee |      4,422       50.42       52.71
                     ja |      4,131       47.10       99.82
 het volgend schooljaar |         16        0.18      100.00
------------------------+-----------------------------------
                  Total |      8,770      100.00

. 
. /*
> Variabele       Invuljaar       Geboortejaar
> 
> hschm12_v2      1999-2000       1986-1987               1999            Lijst12_versie2_ouders_groenBoekje_1999                 SVO/LBO/MB
> O/     BRUGKLAS  /MAVO/HAVO/VWO-GYM
> hschm12_v3      1999-2004       1986-1991               2000            Lijst12_versie3_ouders_paarsBoekje_2000                 SVO/LBO/MB
> O/VMBO/BRUGKLASx3/MAVO/HAVO/VWO-GYM
> hschm12         2003-2015       1991-2002               2003            Lijst12_versie4a_ouders_geelBoekje_2003                 SVO/PRO/VM
> BOx4/HAVO/VWO (meerdere) 
> hschm12_1n      2009-2015       1995-2002               2006            Lijst12_versie5_ouders_geel-grijsBoekje_2006    SVO/PRO/VMBOx4/HAV
> O/VWO 
> hschm12_2n      2009-2014       1997-2001               /2009           /Lijst12_versie6_ouders1Lijst_druk2_2009                        " 
> "
> hschm12_3n      2009-2014       1997-2001
> 
> vervolgm12      2006-2015       1993-2002               2006/2009
> */
. 
. 
. **      Check whether there are strange things going on
. 
. *       There is no child that has information entered on two occassions by the mother in case of v2 / v3
. list PID if hschm12_v2<. & ((hschm12_v3>-1 & hschm12_v3<.) | hschm12<. | hschm12_1n<.)

. list PID if (hschm12_v3>-1 & hschm12_v3<.) &                            (hschm12<. | hschm12_1n<.)

. tab hschm12 hschm12_1n 

     Onderwijs - Naar |
       welke vorm van |
vervolgonderwijs gaat |          Onderwijs - Gaat het kind op dit moment al naar het vervolgonderwijs? 1e antwoor
         de tweeling? | inconsist  unclear -    missing   1 SVO (s   2 PRO (p  3 VMBO th  4 VMBO ge  5 VMBO ka  6 VMBO ba |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
         inconsistent |         6          0          0          0          0          0          0          0          0 |         6 
unclear - double mark |         0        754          0          0          0          0          0          0          0 |       754 
              missing |         0          0      3,297          0          0          0          0          0          0 |     3,297 
SVO (speciaal voortge |         0          0          0         46          0          0          0          0          0 |        46 
PRO (praktijkonderijw |         0          0          0          0         25          0          0          0          0 |        25 
    VMBO theoretische |         0          0          0          0          0        550          0          0          0 |       550 
VMBO gemengde leerweg |         0          0          0          0          0          0        103          0          0 |       103 
VMBO kaderberoepsgeri |         0          0          0          0          0          0          0        226          0 |       226 
VMBO basisberoepsgeri |         0          0          0          1          0          0          0          0        146 |       147 
                 HAVO |         0          0          0          0          0          0          0          0          0 |       737 
                  VWO |         0          0          0          0          0          0          0          0          0 |       707 
            gymnasium |         0          0          0          0          0          0          0          0          0 |       366 
dubbel antwoord: vmbo |         0          0          0          0          0         16          0          0          0 |        16 
dubbel antwoord: vmbo |         0          0          0          0          0          5          2          6          0 |        13 
dubbel antwoord: vmbo |         0          0          0          0          0          0          0          0         11 |        11 
dubbel antwoord: vwo/ |         0          0          0          0          0          0          0          0          0 |         1 
dubbel antwoord: havo |         0          0          0          0          0          0          0          0          0 |        75 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |         6        754      3,297         47         25        571        105        232        157 |     7,080 


     Onderwijs - Naar | Onderwijs - Gaat het kind op dit
       welke vorm van |        moment al naar het
vervolgonderwijs gaat |   vervolgonderwijs? 1e antwoor
         de tweeling? |    7 HAVO      8 VWO  9 gymnasi |     Total
----------------------+---------------------------------+----------
         inconsistent |         0          0          0 |         6 
unclear - double mark |         0          0          0 |       754 
              missing |         0          0          0 |     3,297 
SVO (speciaal voortge |         0          0          0 |        46 
PRO (praktijkonderijw |         0          0          0 |        25 
    VMBO theoretische |         0          0          0 |       550 
VMBO gemengde leerweg |         0          0          0 |       103 
VMBO kaderberoepsgeri |         0          0          0 |       226 
VMBO basisberoepsgeri |         0          0          0 |       147 
                 HAVO |       737          0          0 |       737 
                  VWO |         0        707          0 |       707 
            gymnasium |         0          0        366 |       366 
dubbel antwoord: vmbo |         0          0          0 |        16 
dubbel antwoord: vmbo |         0          0          0 |        13 
dubbel antwoord: vmbo |         0          0          0 |        11 
dubbel antwoord: vwo/ |         0          1          0 |         1 
dubbel antwoord: havo |        75          0          0 |        75 
----------------------+---------------------------------+----------
                Total |       812        708        366 |     7,080 


. /*
>         However, all values of hschm12_1n have been transferred to hschm12
>         I have checked, and they have the same levels for both variables in each instance except for one case.
>         So it does not matter which variable is used. (except that hschm12 reads "dubbel antwoord"
>         when someone also reported something for hschm12_2n).
>         Part of hschm12 has also been transferred to hschm12_1n.
>         For 1991 until 1994: all cases with value for hschm12 have no value for hschm12_1n; for 1995: 634 cases; for 1996: 29.
>         For 1995, 298 cases are the same for hschm12 and hschm12_1n; for 1996: 1,090; for 1997 until 2002: all cases. 
> 
> */
. *list PID hschm12 hschm12_1n if hschm12<. & hschm12_1n<.
. tab yob if hschm12<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |        998        8.51        8.51
       1992 |      1,163        9.92       18.43
       1993 |      1,029        8.78       27.20
       1994 |        793        6.76       33.97
       1995 |        932        7.95       41.92
       1996 |      1,119        9.54       51.46
       1997 |      1,086        9.26       60.72
       1998 |      1,133        9.66       70.38
       1999 |      1,208       10.30       80.68
       2000 |        850        7.25       87.93
       2001 |        771        6.58       94.51
       2002 |        644        5.49      100.00
------------+-----------------------------------
      Total |     11,726      100.00

. tab yob if hschm12<. & hschm12_1n==.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |        998       21.48       21.48
       1992 |      1,163       25.03       46.51
       1993 |      1,029       22.15       68.66
       1994 |        793       17.07       85.73
       1995 |        634       13.65       99.38
       1996 |         29        0.62      100.00
------------+-----------------------------------
      Total |      4,646      100.00

. tab yob if hschm12<. & hschm12_1n<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |        298        4.21        4.21
       1996 |      1,090       15.40       19.60
       1997 |      1,086       15.34       34.94
       1998 |      1,133       16.00       50.95
       1999 |      1,208       17.06       68.01
       2000 |        850       12.01       80.01
       2001 |        771       10.89       90.90
       2002 |        644        9.10      100.00
------------+-----------------------------------
      Total |      7,080      100.00

. *       (people who have info on hschm_v2 have -1 on hschm12_v3)
. *list PID if hschm12_v2<. & ( hschm12_v3<. | hschm12<. | hschm12_1n<.)
. 
. /*      
>         Children that do not indicate to go to school, do not indicate
>         a level either. Except for PID==22130 & 22131. I leave their level as is.
>         Moreover, they indicate a level if they indicate to go to school next year: I don't
>         think this is problematic.
> */
. tab hschm12     if vervolgm12==1

        Onderwijs - Naar welke vorm van |
     vervolgonderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                           inconsistent |          6        0.14        0.14
                unclear - double marked |          4        0.09        0.23
                                missing |      3,168       71.64       71.87
                nog niet van toepassing |      1,242       28.09       99.95
                      VMBO theoretische |          2        0.05      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,422      100.00

. tab hschm12_1n  if vervolgm12==1

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           1e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                         inconsistent |          6        0.19        0.19
              unclear - double marked |          4        0.13        0.31
                              missing |      3,168       99.62       99.94
          3 VMBO theoretische leerweg |          2        0.06      100.00
--------------------------------------+-----------------------------------
                                Total |      3,180      100.00

. tab hschm12     if vervolgm12==-1

        Onderwijs - Naar welke vorm van |
     vervolgonderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                unclear - double marked |         10        5.03        5.03
                                missing |        148       74.37       79.40
    SVO (speciaal voortgezet onderwijs) |          1        0.50       79.90
                      VMBO theoretische |          1        0.50       80.40
                  VMBO gemengde leerweg |          2        1.01       81.41
       VMBO kaderberoepsgericht leerweg |          2        1.01       82.41
      VMBO basisberoepsgerichte leerweg |          2        1.01       83.42
                                   HAVO |         13        6.53       89.95
                                    VWO |         14        7.04       96.98
                              gymnasium |          3        1.51       98.49
              dubbel antwoord: havo/vwo |          3        1.51      100.00
----------------------------------------+-----------------------------------
                                  Total |        199      100.00

. tab hschm12_1n  if vervolgm12==-1

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           1e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
              unclear - double marked |         10        9.71        9.71
                              missing |         78       75.73       85.44
          3 VMBO theoretische leerweg |          1        0.97       86.41
              4 VMBO gemengde leerweg |          1        0.97       87.38
  5 VMBO kaderberoepsgerichte leerweg |          2        1.94       89.32
                               7 HAVO |          4        3.88       93.20
                                8 VWO |          4        3.88       97.09
                          9 gymnasium |          3        2.91      100.00
--------------------------------------+-----------------------------------
                                Total |        103      100.00

. tab hschm12     if vervolgm12==3

        Onderwijs - Naar welke vorm van |
     vervolgonderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                unclear - double marked |          1        6.25        6.25
                      VMBO theoretische |          6       37.50       43.75
      VMBO basisberoepsgerichte leerweg |          2       12.50       56.25
                                   HAVO |          1        6.25       62.50
                                    VWO |          6       37.50      100.00
----------------------------------------+-----------------------------------
                                  Total |         16      100.00

. 
. *       If missing on hschm12_1n, then also missing on hschm12_2n
. *       If missing on hschm12_1n or hschm12_2n, then also missing on hschm12_3n
. tab hschm12_2n if hschm12_1n<1 | hschm12_1n>9

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           2e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                              missing |        301      100.00      100.00
--------------------------------------+-----------------------------------
                                Total |        301      100.00

. tab hschm12_3n if hschm12_1n<1 | hschm12_1n>9 | hschm12_2n<1 | hschm12_2n>9 

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           3e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                              missing |        700      100.00      100.00
--------------------------------------+-----------------------------------
                                Total |        700      100.00

. 
. 
. **      Check which combination of levels occur when two options are indicated
. tab hschm12_1n hschm12_2n if hschm12_3n<1

 Onderwijs - Gaat het |
kind op dit moment al |
             naar het |   Onderwijs - Gaat het kind op dit moment al naar het vervolgonderwijs? 2e
 vervolgonderwijs? 1e |                                   antwoor
              antwoor |   missing  4 VMBO ge  5 VMBO ka  6 VMBO ba     7 HAVO      8 VWO  9 gymnasi |     Total
----------------------+-----------------------------------------------------------------------------+----------
              missing |       301          0          0          0          0          0          0 |       301 
 1 SVO (speciaal voor |         4          0          0          0          1          0          0 |         5 
 2 PRO (praktijkonder |         2          0          0          0          0          0          0 |         2 
3 VMBO theoretische l |        83          2          2          0         16          0          0 |       103 
4 VMBO gemengde leerw |        14          0          0          0          0          0          0 |        14 
5 VMBO kaderberoepsge |        30          0          0          6          0          0          0 |        36 
6 VMBO basisberoepsge |        22          0          0          0          9          0          0 |        31 
               7 HAVO |       112          0          0          0          0         73          0 |       185 
                8 VWO |        79          0          0          0          0          0          1 |        80 
          9 gymnasium |        53          0          0          0          0          0          0 |        53 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       700          2          2          6         26         73          1 |       810 


. /*
> -1: -1
>  1:     -1                              7
>  2: -1
>  3:     -1      4       5               7
>  4:     -1              
>  5:     -1                      6
>  6:     -1                              7
>  7:     -1                                      8
>  8:     -1                                              9
>  9:     -1
> */
. 
. **      Check which combination of levels occur when three options are indicated
. tab hschm12_3n

     Onderwijs - Gaat het kind op dit |
 moment al naar het vervolgonderwijs? |
                           3e antwoor |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
                              missing |        810       99.14       99.14
  5 VMBO kaderberoepsgerichte leerweg |          1        0.12       99.27
  6 VMBO basisberoepsgerichte leerweg |          2        0.24       99.51
                                8 VWO |          2        0.24       99.76
                          9 gymnasium |          2        0.24      100.00
--------------------------------------+-----------------------------------
                                Total |        817      100.00

. tab hschm12_1n hschm12_2n if hschm12_3n==5

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor | 4 VMBO ge |     Total
----------------------+-----------+----------
3 VMBO theoretische l |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 


. tab hschm12_1n hschm12_2n if hschm12_3n==5 & twzyg<.

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor | 4 VMBO ge |     Total
----------------------+-----------+----------
3 VMBO theoretische l |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 


. tab hschm12_1n hschm12_2n if hschm12_3n==6

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor | 5 VMBO ka |     Total
----------------------+-----------+----------
4 VMBO gemengde leerw |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. tab hschm12_1n hschm12_2n if hschm12_3n==6 & twzyg<.

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor | 5 VMBO ka |     Total
----------------------+-----------+----------
4 VMBO gemengde leerw |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. tab hschm12_1n hschm12_2n if hschm12_3n==8

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor |    7 HAVO |     Total
----------------------+-----------+----------
6 VMBO basisberoepsge |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. tab hschm12_1n hschm12_2n if hschm12_3n==8 & twzyg<.

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor |    7 HAVO |     Total
----------------------+-----------+----------
6 VMBO basisberoepsge |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. tab hschm12_1n hschm12_2n if hschm12_3n==9

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor |     8 VWO |     Total
----------------------+-----------+----------
               7 HAVO |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. tab hschm12_1n hschm12_2n if hschm12_3n==9 & twzyg<.

                      | Onderwijs
                      | - Gaat het
                      |  kind op
                      | dit moment
                      |  al naar
 Onderwijs - Gaat het |    het
kind op dit moment al | vervolgond
             naar het | erwijs? 2e
 vervolgonderwijs? 1e |  antwoor
              antwoor |     8 VWO |     Total
----------------------+-----------+----------
               7 HAVO |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. 
. /*
> 3: 4+[5]
> 4:               5+[6]
> 6:                              7+[8]
> 7:                                              8+[9]
> */
. 
. **      Create the actual variable 
. 
. *       Mentioned one particular level
. gen edu12_m =.
(18858 missing values generated)

. replace edu12_m = .c  if hschm12_v2 ==1 | hschm12_v3 ==1  | hschm12 ==1                                         // Nog niet van toepassing
(2547 real changes made, 2547 to missing)

. replace edu12_m = .c  if vervolgm12==1 & hschm12    <=1                                                                         // Nog nie
> t van toepassing
(3178 real changes made, 3178 to missing)

. replace edu12_m = .c  if vervolgm12==1 & hschm12_1n < 1                                                                         // Nog nie
> t van toepassing
(0 real changes made)

. replace edu12_m = .b  if hschm12_v2 ==2 | hschm12_v3 ==2  | hschm12 ==2  | hschm12_1n==1        // SVO
(93 real changes made, 93 to missing)

. replace edu12_m = 0   if hschm12_v2 ==3 | hschm12_v3 ==3                                                                        // LBO
(49 real changes made)

. replace edu12_m = 0   if                                                                        hschm12 ==3  | hschm12_1n==2    // PRO
(57 real changes made)

. replace edu12_m = 1.5 if                                  hschm12_v3 ==5                                                                  
>       // VMBO
(376 real changes made)

. replace edu12_m = 0   if                                                                        hschm12 ==7  | hschm12_1n==6    // VMBO ba
> sisberoepsgerichte
(268 real changes made)

. replace edu12_m = 1   if                                                                        hschm12 ==6  | hschm12_1n==5    // VMBO ka
> derberoepsgerichte
(398 real changes made)

. replace edu12_m = 2   if                                                                        hschm12 ==5  | hschm12_1n==4    // VMBO ge
> mengde
(231 real changes made)

. replace edu12_m = 2   if                                                                        hschm12 ==4  | hschm12_1n==3    // VMBO th
> eoretische
(1000 real changes made)

. replace edu12_m = 2   if hschm12_v2 ==6 | hschm12_v3 ==9                                                                        // MAVO
(119 real changes made)

. replace edu12_m = 3   if hschm12_v2 ==7 | hschm12_v3 ==10 | hschm12 ==8  | hschm12_1n==7        // HAVO
(1571 real changes made)

. replace edu12_m = 4   if                                                                        hschm12 ==9  | hschm12_1n==8    // VWO
(1330 real changes made)

. replace edu12_m = 4   if hschm12_v2 ==8 | hschm12_v3 ==11                                                                       // VWO-Gym
> nasium
(333 real changes made)

. replace edu12_m = 4   if                                                                        hschm12 ==10 | hschm12_1n==9    // Gymnasi
> um
(366 real changes made)

. replace edu12_m = 1.5 if hschm12_v2 ==4 | hschm12_v3 ==4                                                                        // MBO
(24 real changes made)

. 
. *       Explicitly mentioned two levels
. replace edu12_m =  .a if hschm12_v2 ==5 | hschm12_v3 ==6                                                                        // brugkla
> s (anders dan beroepsonderwijs)
(109 real changes made, 109 to missing)

. replace edu12_m = 1.5 if                                                                        hschm12 ==12                              
>       // VMBO verschillende
(26 real changes made)

. replace edu12_m = 2.5 if                                  hschm12_v3 ==7                                                                  
>       // MAVO/HAVO
(375 real changes made)

. replace edu12_m = 2.5 if                                                                        hschm12 ==13                              
>       // VMBO b+HAVO
(20 real changes made)

. replace edu12_m = 2.5 if                                                                        hschm12 ==11                              
>       // VMBO/HAVO
(151 real changes made)

. replace edu12_m = 3   if                                                                        hschm12 ==15                              
>       // VMBO/HAVO/VWO
(2 real changes made)

. replace edu12_m = 3.5 if                                  hschm12_v3 ==8  | hschm12 ==16                                        // HAVO/VW
> O
(967 real changes made)

. replace edu12_m = 4   if                                                                        hschm12 ==14                              
>       // VWO / Gymnasium
(0 real changes made)

. replace edu12_m = 0.5 if hschm12_1n ==5 & hschm12_2n ==6                                                                        // VMBO b+
> k
(6 real changes made)

. replace edu12_m = 1.5 if hschm12_1n ==4 & hschm12_2n ==5                                                                        // VMBO g+
> k
(0 real changes made)

. replace edu12_m = 1.5 if hschm12_1n ==3 & hschm12_2n ==5                                                                        // VMBO t+
> k
(0 real changes made)

. replace edu12_m = 2   if hschm12_1n ==3 & hschm12_2n ==4                                                                        // VMBO t+
> g
(3 real changes made)

. replace edu12_m = 2.5 if hschm12_1n ==6 & hschm12_2n ==7                                                                        // VMBO/HA
> VO
(0 real changes made)

. replace edu12_m = .b  if hschm12_1n ==1 & hschm12_2n ==7                                                                        // SVO / H
> AVO***
(1 real change made, 1 to missing)

. replace edu12_m = 2.5 if hschm12_1n ==3 & hschm12_2n ==7                                                                        // VMBO t 
> / HAVO
(0 real changes made)

. replace edu12_m = 3.5 if hschm12_1n ==7 & hschm12_2n ==8                                                                        // HAVO/VW
> O
(0 real changes made)

. replace edu12_m = 4   if hschm12_1n ==8 & hschm12_2n ==9                                                                        // VWO / G
> ymnasium
(0 real changes made)

. *** This is the one case that differed between hschm12 and hschm12_1n (fixed this way).
. 
. *       Explicitly mentioned three levels
. replace edu12_m = 1   if hschm12_1n ==4 & hschm12_2n ==5 & hschm12_3n ==6                                       // VMBO b+k+g
(2 real changes made)

. replace edu12_m = 1.5 if hschm12_1n ==3 & hschm12_2n ==4 & hschm12_3n ==5                                       // VMBO k+g+t
(1 real change made)

. replace edu12_m = 3   if hschm12_1n ==6 & hschm12_2n ==7 & hschm12_3n ==8                                       // VMBO b / HAVO / VWO
(2 real changes made)

. replace edu12_m = 3.5 if hschm12_1n ==7 & hschm12_2n ==8 & hschm12_3n ==9                                       // HAVO / VWO / GYM    
(0 real changes made)

. 
.                 
. //      STEP 1.2 --------------------------------------------------------------------------------------------------------
. //      Educational attainment age 12 filled in by the father                                                                             
>               
.                                                                                                 
. **      Explore which categories there are over the years
. 
. *       Which survey is taken when?
. tab invjrv12 if hschv12_v2<.

Adm gegevens - Jaar van |
               invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1999 |        343       99.42       99.42
                   2000 |          2        0.58      100.00
------------------------+-----------------------------------
                  Total |        345      100.00

. tab invjrv12 if hschv12_v3<.

Adm gegevens - Jaar van |
               invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1999 |         35        1.84        1.84
                   2000 |        468       24.55       26.39
                   2001 |        516       27.07       53.46
                   2002 |        721       37.83       91.29
                   2003 |        164        8.60       99.90
                   2004 |          2        0.10      100.00
------------------------+-----------------------------------
                  Total |      1,906      100.00

. tab invjrv12 if hschv12   <.

Adm gegevens - Jaar van |
               invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2003 |        356       11.03       11.03
                   2004 |        987       30.57       41.59
                   2005 |        765       23.69       65.28
                   2006 |        571       17.68       82.97
                   2007 |        537       16.63       99.60
                   2008 |         11        0.34       99.94
                   2009 |          2        0.06      100.00
------------------------+-----------------------------------
                  Total |      3,229      100.00

. tab invjrv12 if hschv12_1n<.

Adm gegevens - Jaar van |
               invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2014 |        441       84.81       84.81
                   2015 |         77       14.81       99.62
                   2017 |          2        0.38      100.00
------------------------+-----------------------------------
                  Total |        520      100.00

. tab invjrv12 if vervolgv12<.

Adm gegevens - Jaar van |
               invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   2006 |        606       35.19       35.19
                   2007 |        582       33.80       68.99
                   2008 |         12        0.70       69.69
                   2009 |          2        0.12       69.80
                   2014 |        441       25.61       95.41
                   2015 |         77        4.47       99.88
                   2017 |          2        0.12      100.00
------------------------+-----------------------------------
                  Total |      1,722      100.00

. 
. *       What years of birth do each survey cover?
. tab yob if hschv12_v2<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |         76       22.03       22.03
       1987 |        269       77.97      100.00
------------+-----------------------------------
      Total |        345      100.00

. tab yob if hschv12_v3<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |          2        0.10        0.10
       1987 |         91        4.77        4.88
       1988 |        436       22.88       27.75
       1989 |        529       27.75       55.51
       1990 |        759       39.82       95.33
       1991 |         89        4.67      100.00
------------+-----------------------------------
      Total |      1,906      100.00

. tab yob if hschv12   <.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |        738       22.86       22.86
       1992 |        815       25.24       48.10
       1993 |        715       22.14       70.24
       1994 |        545       16.88       87.12
       1995 |        415       12.85       99.97
       1996 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,229      100.00

. tab yob if hschv12_1n<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       2001 |        134       25.77       25.77
       2002 |        386       74.23      100.00
------------+-----------------------------------
      Total |        520      100.00

. tab yob if vervolgv12<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1993 |        167        9.70        9.70
       1994 |        585       33.97       43.67
       1995 |        448       26.02       69.69
       1996 |          2        0.12       69.80
       2001 |        134        7.78       77.58
       2002 |        386       22.42      100.00
------------+-----------------------------------
      Total |      1,722      100.00

. 
. *   Which categories are there in each survey?
. tab hschv12_v2

       Onderwijs - Naar welke vorm van |
    vervolgonderwijs gaat de tweeling? |
                         (groen naar p |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
               unclear - double marked |          4        1.16        1.16
                               missing |          2        0.58        1.74
               nog niet van toepassing |         22        6.38        8.12
             speciaal vervolgonderwijs |          2        0.58        8.70
                lager beroepsonderwijs |         19        5.51       14.20
           middelbaar beroepsonderwijs |          8        2.32       16.52
brugklas (anders dan beroepsonderwijs) |         78       22.61       39.13
                                  MAVO |         64       18.55       57.68
                                  HAVO |         68       19.71       77.39
                         VWO-gymnasium |         78       22.61      100.00
---------------------------------------+-----------------------------------
                                 Total |        345      100.00

. tab hschv12_v3

      Onderwijs - Gaat het kind op dit |
  moment al naar het vervolgonderwijs? |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
                               missing |         43        2.26        2.26
               nog niet van toepassing |        497       26.08       28.33
             speciaal vervolgonderwijs |          7        0.37       28.70
                lager beroepsonderwijs |         11        0.58       29.28
           middelbaar beroepsonderwijs |          3        0.16       29.43
                                  VMBO |        299       15.69       45.12
brugklas (anders dan beroepsonderwijs) |         16        0.84       45.96
                    brugklas MAVO/HAVO |        300       15.74       61.70
                     brugklas HAVO/VWO |        440       23.08       84.78
                                  MAVO |         41        2.15       86.94
                                  HAVO |         43        2.26       89.19
                         VWO-gymnasium |        206       10.81      100.00
---------------------------------------+-----------------------------------
                                 Total |      1,906      100.00

. tab hschv12

        Onderwijs - Naar welke vorm van |
            onderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                unclear - double marked |         37        1.15        1.15
                                missing |         45        1.39        2.54
                                      1 |      1,311       40.60       43.14
                                      2 |         18        0.56       43.70
                                      3 |         16        0.50       44.19
                                      4 |        324       10.03       54.23
                                      5 |         74        2.29       56.52
                                      6 |        104        3.22       59.74
                                      7 |         58        1.80       61.54
                                      8 |        461       14.28       75.81
                                      9 |        494       15.30       91.11
             dubbel antwoord: vmbo/havo |         51        1.58       92.69
dubbel antwoord: vmbo verschillende lee |         24        0.74       93.43
    dubbel antwoord: vmbo beroep + havo |          4        0.12       93.56
              dubbel antwoord: havo/vwo |        208        6.44      100.00
----------------------------------------+-----------------------------------
                                  Total |      3,229      100.00

. tab hschv12_1n

            Onderwijs - Ja, soort |
                 vervolgonderwijs |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
          unclear - double marked |         89       17.12       17.12
                          missing |         71       13.65       30.77
                              SVO |          5        0.96       31.73
                              PRO |          4        0.77       32.50
         VMBO theretische leerweg |         41        7.88       40.38
            VMBO gemengde leerweg |          7        1.35       41.73
VMBO kaderberoepsgerichte leerweg |         18        3.46       45.19
VMBO basisberoepsgerichte leerweg |         20        3.85       49.04
                             HAVO |         95       18.27       67.31
                              VWO |        116       22.31       89.62
                        Gymnasium |         54       10.38      100.00
----------------------------------+-----------------------------------
                            Total |        520      100.00

. tab vervolgv12

   Onderwijs - Gaat het |
  kind op dit moment al |
               naar het |
   vervolgonderwijs? ja |
                namelij |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                missing |        104        6.04        6.04
                    nee |        942       54.70       60.74
                     ja |        676       39.26      100.00
------------------------+-----------------------------------
                  Total |      1,722      100.00

. 
. *       Add labels to hschv12
. label define hschv12 1 "Nog niet van toepassing" 2 "SVO" 3 "PRO" 4 "VMBO-t" 5 "VMBO-g" 6 "VMBO-k" 7 "VMBO-b" 8 "HAVO" 9 "VWO", add

. label values hschv12 hschv12

. tab hschv12

        Onderwijs - Naar welke vorm van |
            onderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                unclear - double marked |         37        1.15        1.15
                                missing |         45        1.39        2.54
                Nog niet van toepassing |      1,311       40.60       43.14
                                    SVO |         18        0.56       43.70
                                    PRO |         16        0.50       44.19
                                 VMBO-t |        324       10.03       54.23
                                 VMBO-g |         74        2.29       56.52
                                 VMBO-k |        104        3.22       59.74
                                 VMBO-b |         58        1.80       61.54
                                   HAVO |        461       14.28       75.81
                                    VWO |        494       15.30       91.11
             dubbel antwoord: vmbo/havo |         51        1.58       92.69
dubbel antwoord: vmbo verschillende lee |         24        0.74       93.43
    dubbel antwoord: vmbo beroep + havo |          4        0.12       93.56
              dubbel antwoord: havo/vwo |        208        6.44      100.00
----------------------------------------+-----------------------------------
                                  Total |      3,229      100.00

. 
. /*
> Variabele       Invuljaar       Geboortejaar
> 
> hschv12_v2      1999-2000       1986-1987               1999            Lijst12_versie2_ouders_groenBoekje_1999                 SVO/LBO/MB
> O/     BRUGKLAS  /MAVO/HAVO/VWO-GYM
> hschv12_v3      1999-2004       1986-1991               2000            Lijst12_versie3_ouders_paarsBoekje_2000                 SVO/LBO/MB
> O/VMBO/BRUGKLASx3/MAVO/HAVO/VWO-GYM
> hschv12         2003-2009       1991-1996               2003            Lijst12_versie4a_ouders_geelBoekje_2003                 SVO/PRO/VM
> BOx4/HAVO/VWO (meerdere)
>         "                       "                       "                       /2006           /Lijst12_versie5_ouders_geel-grijsBoekje_2
> 006   SVO/PRO/VMBOx4/HAVO/VWO
> hschv12_1n      2014-2017       2001-2002               /2009           /Lijst12_versie6_ouders1Lijst_druk2_2009                        " 
> "     
> hschv12_?n      ?
> vervolgm12      2006-2009       1993-1996               2006/2009
>                    +2014-2017
> */
. 
. 
. **      Check whether there are strange things going on
. 
. *       There is no child that has information entered on two occassions by the father 
. list PID if hschv12_v2<. & ((hschv12_v3>-1 & hschv12_v3<.) | hschv12<. | hschv12_1n<.)

. list PID if (hschv12_v3>-1 & hschv12_v3<.) &                            (hschv12<. | hschv12_1n<.)

. list PID if hschv12<. &                                                                                                  hschv12_1n<.

. *       (in contrast to mothers, here twins who have info on hschv_v2 do not have -1 on hschv12_v3)
. list PID if hschv12_v2<. & ( hschv12_v3<. | hschv12<. | hschv12_1n<.)

. 
. /*      
>         Children that do not indicate to go to sec. school, do not indicate
>         a level either. For one exception, where mother does indicate that child goes to sec. school. 
>         I leave this as is. 
> */
. tab hschv12 if vervolgv12== 1

        Onderwijs - Naar welke vorm van |
            onderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Nog niet van toepassing |        875      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |        875      100.00

. tab hschv12_1n if vervolgv12== 1

            Onderwijs - Ja, soort |
                 vervolgonderwijs |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                          missing |         65       98.48       98.48
                             HAVO |          1        1.52      100.00
----------------------------------+-----------------------------------
                            Total |         66      100.00

. tab hschv12 if vervolgv12==-1

        Onderwijs - Naar welke vorm van |
            onderwijs gaat de tweeling? |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                unclear - double marked |          2        5.00        5.00
                                missing |         15       37.50       42.50
                                 VMBO-t |          1        2.50       45.00
                                 VMBO-g |          1        2.50       47.50
                                 VMBO-k |          2        5.00       52.50
                                 VMBO-b |          1        2.50       55.00
                                   HAVO |          5       12.50       67.50
                                    VWO |         13       32.50      100.00
----------------------------------------+-----------------------------------
                                  Total |         40      100.00

. tab hschv12_1n if vervolgv12==-1

            Onderwijs - Ja, soort |
                 vervolgonderwijs |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
          unclear - double marked |          4       66.67       66.67
                          missing |          2       33.33      100.00
----------------------------------+-----------------------------------
                            Total |          6      100.00

. 
. 
. **      Check which combination of levels occur when more than one option is possible
. /*
> In this version of the data, there is not variable for the father with second option.
> Will have to ask about this!!
> tab hschv12_1n hschv12b
> 
> /*      
>         Of the 1,521 children that indicate in their first choice that they do not go to school yet:
>         - 1,019 are missing
>         - 491 score -1
>         - 1 scores 1
>         - 10 score a real level
>         on the second option (see also below). These may be children that already know which level 
>         they go to next year.
>         (There is only 1 child that scores 1 on the second option, scores also 1 on the first).
> */
> 
> **      Check which combination of levels occur when two options are indicated
> tab hschm12_1n hschm12_2n if hschm12_3n<1
>         
> -2:             -1
> -1:             -1              
>  1:             -1      1       4                               8       9       
>  2:             -1
>  3:             -1
>  4:      -2     -1                      5       6       7       8
>  5:             -1                              6
>  6:             -1                                      7
>  7:             -1                                              8
>  8:             -1                                                      9
>  9:             -1                                                      9
> */
. 
. 
. **      Create the actual variable 
. 
. *       Mentioned one particular level
. gen     edu12_v = .
(18858 missing values generated)

. replace edu12_v = .c  if hschv12_v2 ==1 | hschv12_v3 ==1  | hschv12 ==1                                         // Nog niet van toepassing
(1830 real changes made, 1830 to missing)

. replace edu12_v = .c  if vervolgv12==1 & hschv12_1n <1                                                                          // Nog nie
> t van toepassing
(65 real changes made, 65 to missing)

. replace edu12_v = .c  if vervolgv12==1 & hschv12 ==. & hschv12_1n ==.                                           // Nog niet van toepassing
(1 real change made, 1 to missing)

. 
. replace edu12_v = .b  if hschv12_v2 ==2 | hschv12_v3 ==2  | hschv12 ==2  | hschv12_1n ==1       // SVO
(32 real changes made, 32 to missing)

. replace edu12_v = 0   if hschv12_v2 ==3 | hschv12_v3 ==3                                                                        // LBO
(30 real changes made)

. replace edu12_v = 0   if                                                                    hschv12 ==3  | hschv12_1n ==2       // PRO
(20 real changes made)

. replace edu12_v = 0   if                                                                    hschv12 ==7  | hschv12_1n ==6       // VMBO ba
> sisberoepsgerichte
(78 real changes made)

. replace edu12_v = 1   if                                                                    hschv12 ==6  | hschv12_1n ==5       // VMBO ka
> derberoepsgerichte
(122 real changes made)

. replace edu12_v = 2   if                                                                    hschv12 ==5  | hschv12_1n ==4       // VMBO ge
> mengde
(81 real changes made)

. replace edu12_v = 2   if                                                                    hschv12 ==4  | hschv12_1n ==3       // VMBO th
> eoretische
(365 real changes made)

. replace edu12_v = 1.5 if                                  hschv12_v3 ==5                                                                  
>       // VMBO
(299 real changes made)

. replace edu12_v = 2   if hschv12_v2 ==6 | hschv12_v3 ==9                                                                        // MAVO
(105 real changes made)

. replace edu12_v = 3   if hschv12_v2 ==7 | hschv12_v3 ==10 | hschv12 ==8  | hschv12_1n ==7       // HAVO
(667 real changes made)

. replace edu12_v = 4   if                                                                        hschv12 ==9  | hschv12_1n ==8   // VWO
(610 real changes made)

. replace edu12_v = 4   if hschv12_v2 ==8 | hschv12_v3 ==11                                                                       // VWO-Gym
> nasium
(284 real changes made)

. replace edu12_v = 4   if                                                                        hschv12 ==10 | hschv12_1n ==9   // Gymnasi
> um
(54 real changes made)

. replace edu12_v = 1.5 if hschv12_v2 ==4 | hschv12_v3 ==4                                                                        // MBO
(11 real changes made)

. 
. *       Explicitly mentioned to be in a class with more than one level
. replace edu12_v =  .a if hschv12_v2 ==5 | hschv12_v3 ==6                                                                        // brugkla
> s (anders dan beroepsonderwijs)
(94 real changes made, 94 to missing)

. replace edu12_v = 1.5 if hschv12 ==12                                                                                                     
>       // VMBO verschillende leerwegen
(24 real changes made)

. replace edu12_v = 2.5 if hschv12 ==13                                                                                                     
>       // VMBO b+HAVO
(4 real changes made)

. replace edu12_v = 2.5 if hschv12 ==11                                                                                                     
>       // VMBO (t)+HAVO
(51 real changes made)

. replace edu12_v = 2.5 if                                  hschv12_v3 ==7                                                                  
>       // MAVO/HAVO
(300 real changes made)

. replace edu12_m = 3   if hschv12 ==15                                                                                                     
>       // VMBO/HAVO/VWO
(0 real changes made)

. replace edu12_v = 3.5 if                                  hschv12_v3 ==8                                                                  
>       // HAVO/VWO
(440 real changes made)

. replace edu12_v = 3.5 if hschv12 ==16                                                                                                     
>       //  " "
(208 real changes made)

. replace edu12_v = 4   if hschv12 ==14                                                                                                     
>       // VWO/GYM
(0 real changes made)

. 
. 
. //      STEP 1.3 --------------------------------------------------------------------------------------------------------
. //      Educational attainment age 12, combination of mother's and father's report      
. 
. *       The mean and distribution of mother and father's report are pretty similar
. codebook edu12_m edu12_v                

--------------------------------------------------------------------------------------------------------------------------------------------
edu12_m                                                                                                                          (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  5384/18858
       unique mv codes:  4                       missing .*:  5927/18858

            tabulation:  Freq.  Value
                           362  0
                             6  .5
                           394  1
                           416  1.5
                          1329  2
                           544  2.5
                          1500  3
                           967  3.5
                          2029  4
                          5384  .
                           109  .a
                            93  .b
                          5725  .c

--------------------------------------------------------------------------------------------------------------------------------------------
edu12_v                                                                                                                          (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  8                        missing .:  13083/18858
       unique mv codes:  4                       missing .*:  2022/18858

            tabulation:  Freq.  Value
                           128  0
                           122  1
                           334  1.5
                           551  2
                           355  2.5
                           667  3
                           648  3.5
                           948  4
                         13083  .
                            94  .a
                            32  .b
                          1896  .c

. tab edu12_m

    edu12_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        362        4.80        4.80
         .5 |          6        0.08        4.88
          1 |        394        5.22       10.10
        1.5 |        416        5.51       15.61
          2 |      1,329       17.61       33.22
        2.5 |        544        7.21       40.43
          3 |      1,500       19.88       60.30
        3.5 |        967       12.81       73.12
          4 |      2,029       26.88      100.00
------------+-----------------------------------
      Total |      7,547      100.00

. tab edu12_v 

    edu12_v |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        128        3.41        3.41
          1 |        122        3.25        6.66
        1.5 |        334        8.90       15.56
          2 |        551       14.68       30.24
        2.5 |        355        9.46       39.70
          3 |        667       17.77       57.47
        3.5 |        648       17.27       74.74
          4 |        948       25.26      100.00
------------+-----------------------------------
      Total |      3,753      100.00

. 
. *       Check how much parents differ in their reports on the individual level
. tab edu12_m edu12_v

           |                                         edu12_v
   edu12_m |         0          1        1.5          2        2.5          3        3.5          4 |     Total
-----------+----------------------------------------------------------------------------------------+----------
         0 |        96          7          0          9          0          5          0          0 |       117 
         1 |         5        100          3          9          0          0          0          0 |       117 
       1.5 |         2          0        260          8          2          0          1          0 |       273 
         2 |         4          3         21        430         13         15          0          0 |       486 
       2.5 |         0          0         17         20        289         18         13          1 |       358 
         3 |         0          0          0         21         14        510         40         11 |       596 
       3.5 |         0          0          0          2          9         32        510         55 |       608 
         4 |         0          0          0          1          0         11         37        801 |       850 
-----------+----------------------------------------------------------------------------------------+----------
     Total |       107        110        301        500        327        591        601        868 |     3,405 


. gen edu_dif_mv = edu12_m-edu12_v
(15453 missing values generated)

. tab edu_dif_mv

 edu_dif_mv |      Freq.     Percent        Cum.
------------+-----------------------------------
         -3 |          5        0.15        0.15
         -2 |         10        0.29        0.44
       -1.5 |          1        0.03        0.47
         -1 |         57        1.67        2.14
        -.5 |        137        4.02        6.17
          0 |      2,996       87.99       94.16
         .5 |        124        3.64       97.80
          1 |         66        1.94       99.74
        1.5 |          4        0.12       99.85
          2 |          5        0.15      100.00
------------+-----------------------------------
      Total |      3,405      100.00

. gen edu_adif_mv = abs(edu_dif_mv)
(15453 missing values generated)

. tab edu_adif_mv

edu_adif_mv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,996       87.99       87.99
         .5 |        261        7.67       95.65
          1 |        123        3.61       99.27
        1.5 |          5        0.15       99.41
          2 |         15        0.44       99.85
          3 |          5        0.15      100.00
------------+-----------------------------------
      Total |      3,405      100.00

. 
. /*      
>         If both parents report a level:
>         - 87.7% report the same level 
>         - 95.5% report a difference of 1 or less (+7.8)
>         - 98.9% report a difference of 2 or less (+3.4)
>         - 99.8% report a difference of 3 or less (+0.9)
>         Fathers and mothers report a higher level to the same extent (about 6.1% each). 
> */
. 
. /*
> *       Get a feeling for in what kind of cases parents report different edu levels
> list agem12 invjrm12 hschm12    agev12 invjrv12 hschv12 hschv12_1n      if edu_dif_mv==-5
> list agem12 invjrm12 hschm12_v3 agev12 invjrv12 hschv12_v3                      if edu_dif_mv==-4.5
> list agem12 invjrm12 hschm12_v2 agev12 invjrv12 hschv12_v2                      if edu_dif_mv==-3 & hschm12_v2<.
> list agem12 invjrm12 hschm12_v3 agev12 invjrv12 hschv12_v3                      if edu_dif_mv==-3 & hschm12_v3<. & hschm12_v3>-1
> list agem12 invjrm12 hschm12    agev12 invjrv12 hschv12 hschv12_1n  if edu_dif_mv==-3 & hschm12<.
> 
> list agem12 invjrm12 hschm12_v2 agev12 invjrv12 hschv12_v2 if edu12_m!=edu12_v & (edu12_m<. & edu12_v<.) & (hschm12_v2<. | hschv12_v2<.)
> list agem12 invjrm12 hschm12_v3 agev12 invjrv12 hschv12_v3 if edu12_m!=edu12_v & (edu12_m<. & edu12_v<.) & (hschm12_v3<. | hschv12_v3<.)
> */
. 
. *       Variable that simply takes average of what both parents say
. egen edu12 = rowmean(edu12_m edu12_v)
(10963 missing values generated)

. replace edu12 = .a if (edu12_m==.a & (edu12_v==.a | edu12_v==.b | edu12_v==.c | edu12_v==.)) | (edu12_v==.a & (edu12_m==.b | edu12_m==.c |
>  edu12_m==.))
(90 real changes made, 90 to missing)

. replace edu12 = .b if (edu12_m==.b & (edu12_v==.b | edu12_v==.c | edu12_v==.))               | (edu12_v==.b & (edu12_m==.c | edu12_m==.))
(95 real changes made, 95 to missing)

. replace edu12 = .c if (edu12_m==.c & (edu12_v==.c | edu12_v==.))                             | (edu12_v==.c & edu12_m==.)
(5639 real changes made, 5639 to missing)

. codebook edu12

--------------------------------------------------------------------------------------------------------------------------------------------
edu12                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .01
         unique values:  16                       missing .:  5139/18858
       unique mv codes:  4                       missing .*:  5824/18858

                  mean:   2.78588
              std. dev:   1.09989

           percentiles:        10%       25%       50%       75%       90%
                               1.5         2         3         4         4

. tab edu12

      edu12 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        362        4.59        4.59
         .5 |         18        0.23        4.81
        .75 |          2        0.03        4.84
          1 |        402        5.09        9.93
       1.25 |          3        0.04        9.97
        1.5 |        453        5.74       15.71
       1.75 |         29        0.37       16.07
          2 |      1,343       17.01       33.08
       2.25 |         33        0.42       33.50
        2.5 |        540        6.84       40.34
       2.75 |         34        0.43       40.77
          3 |      1,513       19.16       59.94
       3.25 |         73        0.92       60.86
        3.5 |        938       11.88       72.74
       3.75 |         92        1.17       73.91
          4 |      2,060       26.09      100.00
------------+-----------------------------------
      Total |      7,895      100.00

. 
. 
. //      STEP 1.4 --------------------------------------------------------------------------------------------------------
. //      Educational attainment age 14 filled in by student
.  
. **      Explore which categories there are over the years
. 
. *       Which survey is taken when?
. tab invjaars14 if onderwijss14  <.

   jaar van |
  invullen, |
     dhbq14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2005 |      1,002       32.46       32.46
       2006 |        896       29.02       61.48
       2007 |        929       30.09       91.58
       2008 |         42        1.36       92.94
       2009 |        216        7.00       99.94
       2010 |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,087      100.00

. tab invjaars14 if onderw1s14    <.

   jaar van |
  invullen, |
     dhbq14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2008 |        508       12.06       12.06
       2009 |      1,062       25.22       37.28
       2011 |      1,579       37.50       74.78
       2012 |      1,062       25.22      100.00
------------+-----------------------------------
      Total |      4,211      100.00

. tab invjaars14 if onderw2s14    <.

   jaar van |
  invullen, |
     dhbq14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2008 |        508       12.06       12.06
       2009 |      1,062       25.22       37.28
       2011 |      1,579       37.50       74.78
       2012 |      1,062       25.22      100.00
------------+-----------------------------------
      Total |      4,211      100.00

. tab invjaars14 if onderw3s14    <.

   jaar van |
  invullen, |
     dhbq14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2008 |        508       12.06       12.06
       2009 |      1,062       25.22       37.28
       2011 |      1,579       37.50       74.78
       2012 |      1,062       25.22      100.00
------------+-----------------------------------
      Total |      4,211      100.00

. tab invjaars14 if onderwijsNs14 <.

   jaar van |
  invullen, |
     dhbq14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2013 |        621      100.00      100.00
------------+-----------------------------------
      Total |        621      100.00

. 
. *       What years of birth do each survey cover?
. tab yob if onderwijss14  <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1989 |          2        0.07        0.07
       1990 |        770       28.09       28.16
       1991 |        871       31.78       59.94
       1992 |        848       30.94       90.88
       1993 |        143        5.22       96.10
       1994 |        107        3.90      100.00
------------+-----------------------------------
      Total |      2,741      100.00

. tab yob if onderw1s14    <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1993 |        656       17.51       17.51
       1994 |        663       17.69       35.20
       1995 |        555       14.81       50.01
       1996 |        715       19.08       69.10
       1997 |        633       16.89       85.99
       1998 |        525       14.01      100.00
------------+-----------------------------------
      Total |      3,747      100.00

. tab yob if onderwijsNs14 <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1994 |          1        0.16        0.16
       1998 |        161       25.97       26.13
       1999 |        458       73.87      100.00
------------+-----------------------------------
      Total |        620      100.00

. 
. tab yob if onderwijss14  <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1981 |          2        0.06        0.06
       1983 |          3        0.10        0.16
       1984 |          4        0.13        0.29
       1985 |          3        0.10        0.39
       1986 |         16        0.52        0.91
       1987 |         46        1.49        2.40
       1988 |         79        2.56        4.96
       1989 |         77        2.49        7.45
       1990 |        822       26.63       34.08
       1991 |        894       28.96       63.04
       1992 |        866       28.05       91.09
       1993 |        157        5.09       96.18
       1994 |        117        3.79       99.97
       1995 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,087      100.00

. tab yob if onderw1s14    <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1983 |          1        0.02        0.02
       1984 |          1        0.02        0.05
       1985 |          6        0.14        0.19
       1986 |         10        0.24        0.43
       1987 |          7        0.17        0.59
       1988 |         23        0.55        1.14
       1989 |         32        0.76        1.90
       1990 |         48        1.14        3.04
       1991 |         71        1.69        4.73
       1992 |         80        1.90        6.63
       1993 |        710       16.86       23.49
       1994 |        715       16.98       40.47
       1995 |        571       13.56       54.03
       1996 |        740       17.57       71.60
       1997 |        645       15.32       86.92
       1998 |        550       13.06       99.98
       1999 |          1        0.02      100.00
------------+-----------------------------------
      Total |      4,211      100.00

. tab yob if onderwijsNs14 <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1994 |          1        0.16        0.16
       1998 |        161       25.93       26.09
       1999 |        459       73.91      100.00
------------+-----------------------------------
      Total |        621      100.00

. 
. *   Which categories are there in each survey?
. tab onderwijss14        if twzyg<.

   School: op |
   welke vorm |
          van |
   voortgezet |
onderwijs zit |
 je of heb je |
gezeten ? (tm |
           ve |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -2 |         47        1.71        1.71
           -1 |         28        1.02        2.74
         vmbo |      1,101       40.17       42.90
         havo |        704       25.68       68.59
vwo/gymnasium |        861       31.41      100.00
--------------+-----------------------------------
        Total |      2,741      100.00

. tab onderw1s14          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |         19        0.51        0.51
                     vmbo |        637       17.00       17.51
vmbo theoretische leerweg |        795       21.22       38.72
                     havo |      1,005       26.82       65.55
                      vwo |        896       23.91       89.46
                gymnasium |        370        9.87       99.33
            2-4 jarig mbo |          2        0.05       99.39
                      hbo |          1        0.03       99.41
         anders, namelijk |         22        0.59      100.00
--------------------------+-----------------------------------
                    Total |      3,747      100.00

. tab onderw2s14          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      3,181       84.89       84.89
vmbo theoretische leerweg |         69        1.84       86.74
                     havo |        142        3.79       90.53
                      vwo |        158        4.22       94.74
                gymnasium |         42        1.12       95.86
            2-4 jarig mbo |         13        0.35       96.21
         anders, namelijk |        142        3.79      100.00
--------------------------+-----------------------------------
                    Total |      3,747      100.00

. tab onderw3s14          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      3,703       98.83       98.83
                     havo |          6        0.16       98.99
                      vwo |         17        0.45       99.44
                gymnasium |          4        0.11       99.55
         anders, namelijk |         17        0.45      100.00
--------------------------+-----------------------------------
                    Total |      3,747      100.00

. tab onderw4s14          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      3,745       99.95       99.95
                gymnasium |          1        0.03       99.97
         anders, namelijk |          1        0.03      100.00
--------------------------+-----------------------------------
                    Total |      3,747      100.00

. tab onderw5s14          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      3,746       99.97       99.97
         anders, namelijk |          1        0.03      100.00
--------------------------+-----------------------------------
                    Total |      3,747      100.00

. tab onderwijsNs14       if twzyg<.

     School: versie 7: op |
welke vorm van voortgezet |
  onderwijs zit je of heb |
                je laatst |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                     vmbo |         93       15.00       15.00
vmbo theoretische leerweg |        122       19.68       34.68
                     havo |        154       24.84       59.52
                      vwo |        172       27.74       87.26
                gymnasium |         79       12.74      100.00
--------------------------+-----------------------------------
                    Total |        620      100.00

. 
. tab onderwijss14

   School: op |
   welke vorm |
          van |
   voortgezet |
onderwijs zit |
 je of heb je |
gezeten ? (tm |
           ve |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -2 |         54        1.75        1.75
           -1 |         36        1.17        2.92
         vmbo |      1,202       38.94       41.85
         havo |        803       26.01       67.87
vwo/gymnasium |        992       32.13      100.00
--------------+-----------------------------------
        Total |      3,087      100.00

. tab onderw1s14

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |         21        0.50        0.50
                     vmbo |        668       15.86       16.36
vmbo theoretische leerweg |        882       20.95       37.31
                     havo |      1,114       26.45       63.76
                      vwo |      1,014       24.08       87.84
                gymnasium |        418        9.93       97.77
             1-jarige mbo |          1        0.02       97.79
            2-4 jarig mbo |         31        0.74       98.53
                      hbo |         20        0.47       99.00
             universiteit |         16        0.38       99.38
         anders, namelijk |         26        0.62      100.00
--------------------------+-----------------------------------
                    Total |      4,211      100.00

. tab onderw2s14

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      3,480       82.64       82.64
vmbo theoretische leerweg |         74        1.76       84.40
                     havo |        172        4.08       88.48
                      vwo |        180        4.27       92.76
                gymnasium |         50        1.19       93.94
             1-jarige mbo |          4        0.09       94.04
            2-4 jarig mbo |         49        1.16       95.20
                      hbo |         26        0.62       95.82
             universiteit |         26        0.62       96.44
         anders, namelijk |        150        3.56      100.00
--------------------------+-----------------------------------
                    Total |      4,211      100.00

. tab onderw3s14

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      4,131       98.10       98.10
                     havo |          6        0.14       98.24
                      vwo |         20        0.47       98.72
                gymnasium |          5        0.12       98.84
             1-jarige mbo |          2        0.05       98.88
            2-4 jarig mbo |         10        0.24       99.12
                      hbo |          9        0.21       99.34
             universiteit |          6        0.14       99.48
         anders, namelijk |         22        0.52      100.00
--------------------------+-----------------------------------
                    Total |      4,211      100.00

. tab onderw4s14

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      4,206       99.88       99.88
                gymnasium |          1        0.02       99.91
            2-4 jarig mbo |          2        0.05       99.95
                      hbo |          1        0.02       99.98
         anders, namelijk |          1        0.02      100.00
--------------------------+-----------------------------------
                    Total |      4,211      100.00

. tab onderw5s14

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      4,210       99.98       99.98
         anders, namelijk |          1        0.02      100.00
--------------------------+-----------------------------------
                    Total |      4,211      100.00

. tab onderwijsNs14

     School: versie 7: op |
welke vorm van voortgezet |
  onderwijs zit je of heb |
                je laatst |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                     vmbo |         93       14.98       14.98
vmbo theoretische leerweg |        122       19.65       34.62
                     havo |        154       24.80       59.42
                      vwo |        173       27.86       87.28
                gymnasium |         79       12.72      100.00
--------------------------+-----------------------------------
                    Total |        621      100.00

. 
. 
. /*
> Variabele               Invuljaar       Geboortejaar
> 
> onderwijss14    2005-2010       1989-1994 (1979-1998)   2004            DHBQ_14-16-18_versie1_rood-grijsBoekje                  VMBO (mavo
> , lbo)/HAVO/VWO-GYM
>                                                                                                         2005            DHBQ_14-16-18_vers
> ie2_blauwBoekje_druk1
> onderw1s14              2008-2012       1993-1998 (1983-1999)   2009            DHBQ14_versie3_ONLINE_2009                                
>               VMBO/VMBO-t/HAVO/VWO/Gymnasium 
> onderwXs14                      ""                                                              2011            DHBQ14_versie4_ONLINE_2011
>                                               +       MBO1/MBO2-4/HBO/UNI/Anders, nl
>                                                                                                         2012            DHBQ14_versie5_ONL
> INE_2012                                                      (meerdere)
> onderwijsNs14   2013            1998-1999 (1989-2001)   2013            DHBQ14_versie6_ONLINE_2013                                        
>       VMBO/VMBO-t/HAVO/VWO/Gymnasium 
> */
. 
. 
. **      Check whether there are strange things going on
. 
. *       There is no child that has information entered on two occassions  
. list PID if onderwijss14<. & (onderw1s14<. | onderwijsNs14<.)

. list PID if onderw1s14<. & onderwijsNs14<.              

. 
. /*      
>         Should ask NTR for variables that indicate whether someone is still in school,
>         and about which diplomas were attained.
> */
. 
. 
. **      Check which combination of levels occur when more than one option is possible
. 
. *       First those who give 2 answers, N=522/(651)
. tab onderw1s14 onderw2s14 if onderw2s14>-1 & onderw3s14==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |
    heb je het laatst |          School: op welke vorm van voortgezet onderwijs zit je of heb je het laatst gezet
                gezet | vmbo theo       havo        vwo  gymnasium   1-jarige  2-4 jarig        hbo  universit  anders, n |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                 vmbo |        62         15          2          0          1         14          0          0         39 |       133 
vmbo theoretische lee |         0        120          0          0          1         29          0          0         11 |       161 
                 havo |         0          0        160          1          0          4         16          1         15 |       197 
                  vwo |         0          0          0         42          0          0          7         15         69 |       133 
            gymnasium |         0          0          0          0          0          0          0         10         15 |        25 
        2-4 jarig mbo |         0          0          0          0          0          0          1          0          1 |         2 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |        62        135        162         43          2         47         24         26        150 |       651 


. tab onderw1s14 onderw2s14 if onderw2s14>-1 & onderw3s14==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |  School: op welke vorm van voortgezet onderwijs zit je of heb je
    heb je het laatst |                         het laatst gezet
                gezet | vmbo theo       havo        vwo  gymnasium  2-4 jarig  anders, n |     Total
----------------------+------------------------------------------------------------------+----------
                 vmbo |        61         15          2          0          6         39 |       123 
vmbo theoretische lee |         0        105          0          0          6         11 |       122 
                 havo |         0          0        146          1          1         14 |       162 
                  vwo |         0          0          0         37          0         64 |       101 
            gymnasium |         0          0          0          0          0         14 |        14 
----------------------+------------------------------------------------------------------+----------
                Total |        61        120        148         38         13        142 |       522 


. *       (I've checked: when people have -1 on onderw(X)s14, they have -1 on onderw(X+1)s14.
. 
. /*
>  1 :    2       3       4          (6)  7                       10
>  2 :            3                  (6)  7                       10
>  3 :                    4       5               7  (8) (9)      10
>  4 :                            5                  (8) (9)      10
>  5 :                                                       (9)  10
> (7):                                               (8)     (10) 
> 
> Between brackets if siblings are included
> */
. 
. *       Those who give 3 answers, N=42/(75)
. tab onderw2s14 onderw3s14 if onderw1s14==1  & onderw3s14>-1 & onderw4s14==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |  School: op welke vorm van voortgezet onderwijs zit je of heb je
    heb je het laatst |                         het laatst gezet
                gezet |      havo        vwo   1-jarige  2-4 jarig        hbo  anders, n |     Total
----------------------+------------------------------------------------------------------+----------
vmbo theoretische lee |         6          1          1          2          0          2 |        12 
                 havo |         0          4          0          1          1          1 |         7 
         1-jarige mbo |         0          0          0          1          0          0 |         1 
        2-4 jarig mbo |         0          0          0          0          1          0 |         1 
----------------------+------------------------------------------------------------------+----------
                Total |         6          5          1          4          2          3 |        21 


. tab onderw2s14 onderw3s14 if onderw1s14==1  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |    School: op welke vorm van
  onderwijs zit je of |  voortgezet onderwijs zit je of
    heb je het laatst |     heb je het laatst gezet
                gezet |      havo        vwo  anders, n |     Total
----------------------+---------------------------------+----------
vmbo theoretische lee |         6          1          1 |         8 
                 havo |         0          3          1 |         4 
----------------------+---------------------------------+----------
                Total |         6          4          2 |        12 


. tab onderw2s14 onderw3s14 if onderw1s14==2  & onderw3s14>-1 & onderw4s14==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |  School: op welke vorm van voortgezet onderwijs zit je of heb je
    heb je het laatst |                         het laatst gezet
                gezet |       vwo  gymnasium   1-jarige  2-4 jarig        hbo  anders, n |     Total
----------------------+------------------------------------------------------------------+----------
                 havo |        11          1          1          5          3          5 |        26 
        2-4 jarig mbo |         0          0          0          0          1          0 |         1 
----------------------+------------------------------------------------------------------+----------
                Total |        11          1          1          5          4          5 |        27 


. tab onderw2s14 onderw3s14 if onderw1s14==2  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |    School: op welke vorm van
  onderwijs zit je of |  voortgezet onderwijs zit je of
    heb je het laatst |     heb je het laatst gezet
                gezet |       vwo  gymnasium  anders, n |     Total
----------------------+---------------------------------+----------
                 havo |        11          1          4 |        16 
----------------------+---------------------------------+----------
                Total |        11          1          4 |        16 


. tab onderw2s14 onderw3s14 if onderw1s14==3  & onderw3s14>-1 & onderw4s14==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |    School: op welke vorm van voortgezet
    heb je het laatst | onderwijs zit je of heb je het laatst gezet
                gezet | gymnasium        hbo  universit  anders, n |     Total
----------------------+--------------------------------------------+----------
                  vwo |         4          3          1         10 |        18 
----------------------+--------------------------------------------+----------
                Total |         4          3          1         10 |        18 


. tab onderw2s14 onderw3s14 if onderw1s14==3  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.

                      | School: op welke vorm
School: op welke vorm |    van voortgezet
       van voortgezet |  onderwijs zit je of
  onderwijs zit je of |   heb je het laatst
    heb je het laatst |         gezet
                gezet | gymnasium  anders, n |     Total
----------------------+----------------------+----------
                  vwo |         3          7 |        10 
----------------------+----------------------+----------
                Total |         3          7 |        10 


. tab onderw2s14 onderw3s14 if onderw1s14==4  & onderw3s14>-1 & onderw4s14==-1

                      | School: op welke vorm
School: op welke vorm |    van voortgezet
       van voortgezet |  onderwijs zit je of
  onderwijs zit je of |   heb je het laatst
    heb je het laatst |         gezet
                gezet | universit  anders, n |     Total
----------------------+----------------------+----------
            gymnasium |         3          4 |         7 
                  hbo |         2          0 |         2 
----------------------+----------------------+----------
                Total |         5          4 |         9 


. tab onderw2s14 onderw3s14 if onderw1s14==4  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.

                      | School: op
                      | welke vorm
                      |    van
                      | voortgezet
                      | onderwijs
School: op welke vorm | zit je of
       van voortgezet | heb je het
  onderwijs zit je of |   laatst
    heb je het laatst |   gezet
                gezet | anders, n |     Total
----------------------+-----------+----------
            gymnasium |         4 |         4 
----------------------+-----------+----------
                Total |         4 |         4 


. tab onderw2s14 onderw3s14 if onderw1s14==5  & onderw3s14>-1 & onderw4s14==-1
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==5  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==6  & onderw3s14>-1 & onderw4s14==-1
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==6  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==7  & onderw3s14>-1 & onderw4s14==-1
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==7  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==8  & onderw3s14>-1 & onderw4s14==-1
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==8  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==9  & onderw3s14>-1 & onderw4s14==-1
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==9  & onderw3s14>-1 & onderw4s14==-1 & twzyg<.
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==10 & onderw3s14>-1 & onderw4s14==-1
no observations

. tab onderw2s14 onderw3s14 if onderw1s14==10 & onderw3s14>-1 & onderw4s14==-1 & twzyg<.
no observations

. 
. 
. /*
>  1 :    2+[3 4(6)(7)10]  3+[4     (7)(8)10]                                                                     6+[(7)]  7+[(8)]    
>  2 :                             3+[4 5(6)(7)(8)10]                                                                                      7
> +[(8)]
>  3 :                                                                              4+[5(8)(9)10]         
>  4 :                                                                                                             5+[(9) 10 ]    8+[(9)]
>  5 :                                                                                                             
>  6 :            
>  7 :            
>  8 :
>  9 :
>  10:
>  
> Between brackets if siblings are included
> */
. 
. *       Those who give 4 answers, N=1/(4)
. list onderw1s14 onderw2s14 onderw3s14 onderw4s14                        if onderw4s14>-1 & onderw5s14==-1 

       +----------------------------------------------------------+
       |   onderw1s14    onderw2s14     onderw3s14     onderw4s14 |
       |----------------------------------------------------------|
 6547. |         havo   1-jarige mb   2-4 jarig mb            hbo |
 9018. | vmbo theoret          havo            vwo   anders, name |
 9294. | vmbo theoret          havo            vwo   2-4 jarig mb |
10098. | vmbo theoret          havo            vwo   2-4 jarig mb |
       +----------------------------------------------------------+

. list onderw1s14 onderw2s14 onderw3s14 onderw4s14                        if onderw4s14>-1 & onderw5s14==-1 & twzyg<.

       +---------------------------------------------------+
       |   onderw1s14   ond~2s14   ond~3s14     onderw4s14 |
       |---------------------------------------------------|
 9018. | vmbo theoret       havo        vwo   anders, name |
       +---------------------------------------------------+

. /*
>  2+3+4+[(7) 10] 
> (3  +    6+7+8)
> */
. 
. list onderw1s14 onderw2s14 onderw3s14 onderw4s14 onderw5s14 if onderw5s14>-1 & onderw5s14<.

       +-----------------------------------------------------------+
       | ond~1s14   ond~2s14   ond~3s14   onderw4~4     onderw5s14 |
       |-----------------------------------------------------------|
 7857. |     vmbo       havo        vwo   gymnasium   anders, name |
       +-----------------------------------------------------------+

. list onderw1s14 onderw2s14 onderw3s14 onderw4s14 onderw5s14 if onderw5s14>-1 & onderw5s14<. & twzyg<.

       +-----------------------------------------------------------+
       | ond~1s14   ond~2s14   ond~3s14   onderw4~4     onderw5s14 |
       |-----------------------------------------------------------|
 7857. |     vmbo       havo        vwo   gymnasium   anders, name |
       +-----------------------------------------------------------+

. 
. *       Those who give 5 answers, N=1/(1)
. * 1+3+4+5+10
. 
. 
. **      Create the actual variable 
. 
. *       Mentioned one particular level
. gen edu14 =.
(18858 missing values generated)

. replace edu14 = 0.5 if                                   (onderw1s14== 1 & onderw2s14==-1) | onderwijsNs14==1   // VMBO
(635 real changes made)

. replace edu14 = 1.5 if onderwijss14==1                                                                                                    
>               // VMBO (mavo, lbo)
(1202 real changes made)

. replace edu14 = 2   if                                   (onderw1s14== 2 & onderw2s14==-1) | onderwijsNs14==2   // VMBO theoretische
(845 real changes made)

. replace edu14 = 3   if onderwijss14==2 | (onderw1s14== 3 & onderw2s14==-1) | onderwijsNs14==3   // HAVO
(1874 real changes made)

. replace edu14 = 4   if                                   (onderw1s14== 4 & onderw2s14==-1) | onderwijsNs14==4   // VWO
(951 real changes made)

. replace edu14 = 4   if onderwijss14==3                                                                                                    
>               // VWO-Gymnasium
(992 real changes made)

. replace edu14 = 4   if                                   (onderw1s14== 5 & onderw2s14==-1) | onderwijsNs14==5   // Gymnasium
(393 real changes made)

. replace edu14 = 0   if                                   (onderw1s14== 6 & onderw2s14==-1)                                              //
>  MBO1
(1 real change made)

. replace edu14 = 1.5 if                                   (onderw1s14== 7 & onderw2s14==-1)                                              //
>  MBO2-4
(29 real changes made)

. replace edu14 = 3   if                                   (onderw1s14== 8 & onderw2s14==-1)                                              //
>  HBO
(20 real changes made)

. replace edu14 = 4   if                                   (onderw1s14== 9 & onderw2s14==-1)                                              //
>  Universiteit
(16 real changes made)

. replace edu14 = .a  if                                   (onderw1s14==10 & onderw2s14==-1)                                              //
>  Anders
(26 real changes made, 26 to missing)

. 
. *       Mentioned two levels
. replace edu14 = 1.5 if onderw1s14==1 & onderw2s14== 2 & onderw3s14==-1                                                  // VMBO   + VMBO-t
(62 real changes made)

. replace edu14 = 2.5 if onderw1s14==1 & onderw2s14== 3 & onderw3s14==-1                                                  // VMBO   + HAVO
(15 real changes made)

. replace edu14 = 3   if onderw1s14==1 & onderw2s14== 4 & onderw3s14==-1                                                  // VMBO   + VWO
(2 real changes made)

. replace edu14 = 0   if onderw1s14==1 & onderw2s14== 6 & onderw3s14==-1                                                  // VMBO   + MBO1
(1 real change made)

. replace edu14 = 1   if onderw1s14==1 & onderw2s14== 7 & onderw3s14==-1                                                  // VMBO   + MBO2-4
(14 real changes made)

. replace edu14 = 0.5 if onderw1s14==1 & onderw2s14==10 & onderw3s14==-1                                                  // VMBO   + Anders
(39 real changes made)

. replace edu14 = 2.5 if onderw1s14==2 & onderw2s14== 3 & onderw3s14==-1                                                  // VMBO-t + HAVO
(120 real changes made)

. replace edu14 = 2   if onderw1s14==2 & onderw2s14== 6 & onderw3s14==-1                                                  // VMBO-t + MBO1
(1 real change made)

. replace edu14 = 2   if onderw1s14==2 & onderw2s14== 7 & onderw3s14==-1                                                  // VMBO-t + MBO2-4
(29 real changes made)

. replace edu14 = 2   if onderw1s14==2 & onderw2s14==10 & onderw3s14==-1                                                  // VMBO-t + Anders
(11 real changes made)

. replace edu14 = 3.5 if onderw1s14==3 & onderw2s14== 4 & onderw3s14==-1                                                  // HAVO   + VWO
(160 real changes made)

. replace edu14 = 3.5 if onderw1s14==3 & onderw2s14== 5 & onderw3s14==-1                                                  // HAVO   + Gymnas
> ium
(1 real change made)

. replace edu14 = 3   if onderw1s14==3 & onderw2s14== 7 & onderw3s14==-1                                                  // HAVO   + MBO2-4
(4 real changes made)

. replace edu14 = 3   if onderw1s14==3 & onderw2s14== 8 & onderw3s14==-1                                                  // HAVO   + HBO
(16 real changes made)

. replace edu14 = 3   if onderw1s14==3 & onderw2s14== 9 & onderw3s14==-1                                                  // HAVO   + Univer
> siteit
(1 real change made)

. replace edu14 = 3   if onderw1s14==3 & onderw2s14==10 & onderw3s14==-1                                                  // HAVO   + Anders
(15 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14== 5 & onderw3s14==-1                                                  // VWO    + Gymnas
> ium
(42 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14== 8 & onderw3s14==-1                                                  // VWO    + HBO
(7 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14== 9 & onderw3s14==-1                                                  // VWO    + Univer
> siteit
(15 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14==10 & onderw3s14==-1                                                  // VWO    + Anders
(69 real changes made)

. replace edu14 = 4   if onderw1s14==5 & onderw2s14== 9 & onderw3s14==-1                                                  // Gymna. + Univer
> siteit
(10 real changes made)

. replace edu14 = 4   if onderw1s14==5 & onderw2s14==10 & onderw3s14==-1                                                  // Gymna. + Anders
(15 real changes made)

. replace edu14 = 1.5 if onderw1s14==6 & onderw2s14== 7 & onderw3s14==-1                                                  // MBO1   + MBO2-4
(0 real changes made)

. replace edu14 = 2   if onderw1s14==7 & onderw2s14== 8 & onderw3s14==-1                                                  // MBO2-4 + HBO
(1 real change made)

. replace edu14 = 1.5 if onderw1s14==7 & onderw2s14==10 & onderw3s14==-1                                                  // MBO2-4 + Anders
(1 real change made)

. 
. *       Mentioned three levels
. replace edu14 = 2   if onderw1s14==1 & onderw2s14== 2 & onderw3s14== 3                                                  // VMBO   + VMBO-t
>       + HAVO
(6 real changes made)

. replace edu14 = 3   if onderw1s14==1 & onderw2s14== 2 & onderw3s14== 4                                                  // VMBO   + VMBO-t
>       + VWO
(1 real change made)

. replace edu14 = 1   if onderw1s14==1 & onderw2s14== 2 & onderw3s14== 6                                                  // VMBO   + VMBO-t
>       + MBO1
(1 real change made)

. replace edu14 = 1.5 if onderw1s14==1 & onderw2s14== 2 & onderw3s14== 7                                                  // VMBO   + VMBO-t
>       + MBO2-4
(2 real changes made)

. replace edu14 = 1.5 if onderw1s14==1 & onderw2s14== 2 & onderw3s14==10                                                  // VMBO   + VMBO-t
>       + Anders
(2 real changes made)

. replace edu14 = 3   if onderw1s14==1 & onderw2s14== 3 & onderw3s14== 4                                                  // VMBO   + HAVO  
>       + VWO
(5 real changes made)

. replace edu14 = 2.5 if onderw1s14==1 & onderw2s14== 3 & onderw3s14== 7                                                  // VMBO   + HAVO  
>       + MBO2-4
(1 real change made)

. replace edu14 = 3   if onderw1s14==1 & onderw2s14== 3 & onderw3s14== 8                                                  // VMBO   + HAVO  
>       + HBO
(1 real change made)

. replace edu14 = 2.5 if onderw1s14==1 & onderw2s14== 3 & onderw3s14==10                                                  // VMBO   + HAVO  
>       + Anders
(1 real change made)

. replace edu14 = 2   if onderw1s14==1 & onderw2s14== 7 & onderw3s14== 8                                                  // VMBO   + MBO2-4
>       + HBO
(1 real change made)

. replace edu14 = 2.5 if onderw1s14==1 & onderw2s14== 8 & onderw3s14== 9                                                  // VMBO   + HBO   
>       + Uni
(0 real changes made)

. replace edu14 = 3   if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 4                                                  // VMBO-t + HAVO  
>       + VWO
(14 real changes made)

. replace edu14 = 3   if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 5                                                  // VMBO-t + HAVO  
>       + Gym
(1 real change made)

. replace edu14 = 2.5 if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 6                                                  // VMBO-t + HAVO  
>       + MBO1
(1 real change made)

. replace edu14 = 2.5 if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 7                                                  // VMBO-t + HAVO  
>       + MBO2-4
(5 real changes made)

. replace edu14 = 2.5 if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 8                                                  // VMBO-t + HAVO  
>       + HBO
(3 real changes made)

. replace edu14 = 2.5 if onderw1s14==2 & onderw2s14== 3 & onderw3s14==10                                                  // VMBO-t + HAVO  
>       + Anders
(5 real changes made)

. replace edu14 = 2   if onderw1s14==2 & onderw2s14== 7 & onderw3s14== 8                                                  // VMBO-t + MBO2-4
>       + HBO
(1 real change made)

. replace edu14 = 2   if onderw1s14==2 & onderw2s14== 7 & onderw3s14==10                                                  // VMBO-t + MBO2-4
>       + Anders
(0 real changes made)

. replace edu14 = 2   if onderw1s14==2 & onderw2s14==10 & onderw3s14==10                                                  // VMBO-t + Anders
>       + Anders
(0 real changes made)

. replace edu14 = 3.5 if onderw1s14==3 & onderw2s14== 4 & onderw3s14== 5                                                  // HAVO   + VWO   
>       + Gym
(4 real changes made)

. replace edu14 = 3.5 if onderw1s14==3 & onderw2s14== 4 & onderw3s14== 8                                                  // HAVO   + VWO   
>       + HBO
(3 real changes made)

. replace edu14 = 3.5 if onderw1s14==3 & onderw2s14== 4 & onderw3s14== 9                                                  // HAVO   + VWO   
>       + Uni
(1 real change made)

. replace edu14 = 3.5 if onderw1s14==3 & onderw2s14== 4 & onderw3s14==10                                                  // HAVO   + VWO   
>       + Anders
(10 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14== 5 & onderw3s14== 9                                                  // VWO    +     Gy
> m             + Uni
(3 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14== 5 & onderw3s14==10                                                  // VWO    +     Gy
> m             + Anders
(4 real changes made)

. replace edu14 = 4   if onderw1s14==4 & onderw2s14== 8 & onderw3s14== 9                                                  // VWO    +     HB
> O             + Uni
(2 real changes made)

. 
. *       Mentioned four levels
. replace edu14 = 2.5 if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 4 & onderw4s14== 7                 // VMBO-t + HAVO        + VWO    +
>  MBO2-4
(2 real changes made)

. replace edu14 = 3   if onderw1s14==2 & onderw2s14== 3 & onderw3s14== 4 & onderw4s14==10                 // VMBO-t + HAVO        + VWO    +
>  Anders
(0 real changes made)

. replace edu14 = 3   if onderw1s14==3 & onderw2s14== 6 & onderw3s14== 7 & onderw4s14== 8                 // HAVO   + MBO1        + MBO2-4 +
>  HBO
(1 real change made)

. 
. *       Mentioned five levels
. replace edu14 = 3   if onderw1s14==1 & onderw2s14== 3 & onderw3s14== 4  & onderw4s14== 5 & onderw5s14== 10      // VMBO + HAVO + VWO + Gym
>  + Anders
(0 real changes made)

. 
. codebook edu14

--------------------------------------------------------------------------------------------------------------------------------------------
edu14                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  11144/18858
       unique mv codes:  2                       missing .*:  26/18858

            tabulation:  Freq.  Value
                             2  0
                           674  .5
                            15  1
                          1298  1.5
                           895  2
                           153  2.5
                          1953  3
                           179  3.5
                          2519  4
                         11144  .
                            26  .a

. codebook edu14 if edu12<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu14                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [.5,4]                       units:  .1
         unique values:  8                        missing .:  4766/7895
       unique mv codes:  2                       missing .*:  2/7895

            tabulation:  Freq.  Value
                           171  .5
                             4  1
                           642  1.5
                           246  2
                            25  2.5
                           794  3
                            43  3.5
                          1202  4
                          4766  .
                             2  .a

. 
. 
. //      STEP 1.5 --------------------------------------------------------------------------------------------------------
. //      Educational attainment age 16 filled in by student
. 
. **      Explore which categories there are over the years
. 
. *       Which survey is taken when?
. tab invjaars16 if onderwijss16  <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2005 |        529       29.77       29.77
       2006 |        595       33.48       63.25
       2007 |        646       36.35       99.61
       2008 |          7        0.39      100.00
------------+-----------------------------------
      Total |      1,777      100.00

. tab invjaars16 if onderw1s16    <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2009 |        900       35.13       35.13
       2010 |          6        0.23       35.36
       2011 |      1,194       46.60       81.97
       2012 |        287       11.20       93.17
       2013 |        173        6.75       99.92
       2014 |          2        0.08      100.00
------------+-----------------------------------
      Total |      2,562      100.00

. tab invjaars16 if onderw2s16    <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2009 |        900       35.13       35.13
       2010 |          6        0.23       35.36
       2011 |      1,194       46.60       81.97
       2012 |        287       11.20       93.17
       2013 |        173        6.75       99.92
       2014 |          2        0.08      100.00
------------+-----------------------------------
      Total |      2,562      100.00

. tab invjaars16 if onderw3s16    <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2009 |        900       35.13       35.13
       2010 |          6        0.23       35.36
       2011 |      1,194       46.60       81.97
       2012 |        287       11.20       93.17
       2013 |        173        6.75       99.92
       2014 |          2        0.08      100.00
------------+-----------------------------------
      Total |      2,562      100.00

. tab invjaars16 if onderw4s16    <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2009 |        900       35.13       35.13
       2010 |          6        0.23       35.36
       2011 |      1,194       46.60       81.97
       2012 |        287       11.20       93.17
       2013 |        173        6.75       99.92
       2014 |          2        0.08      100.00
------------+-----------------------------------
      Total |      2,562      100.00

. tab invjaars16 if onderw5s16    <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2009 |        184        9.97        9.97
       2010 |          6        0.33       10.29
       2011 |      1,194       64.68       74.97
       2012 |        287       15.55       90.52
       2013 |        173        9.37       99.89
       2014 |          2        0.11      100.00
------------+-----------------------------------
      Total |      1,846      100.00

. tab invjaars16 if onderwijsNs16 <.

   jaar van |
  invullen, |
     dhbq16 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2013 |        796      100.00      100.00
------------+-----------------------------------
      Total |        796      100.00

. 
. *       What years of birth do each survey cover?
. tab yob if onderwijss16  <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1988 |        461       30.47       30.47
       1989 |        489       32.32       62.79
       1990 |        563       37.21      100.00
------------+-----------------------------------
      Total |      1,513      100.00

. tab yob if onderw1s16    <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1991 |        409       18.15       18.15
       1992 |        388       17.22       35.38
       1993 |        473       20.99       56.37
       1994 |        465       20.64       77.01
       1995 |        420       18.64       95.65
       1996 |         98        4.35      100.00
------------+-----------------------------------
      Total |      2,253      100.00

. tab yob if onderwijsNs16 <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |        125       16.80       16.80
       1996 |        559       75.13       91.94
       1997 |         60        8.06      100.00
------------+-----------------------------------
      Total |        744      100.00

. 
. tab yob if onderwijss16  <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1981 |          2        0.11        0.11
       1982 |          2        0.11        0.23
       1983 |          3        0.17        0.39
       1984 |          3        0.17        0.56
       1985 |         15        0.84        1.41
       1986 |         36        2.03        3.43
       1987 |         41        2.31        5.74
       1988 |        486       27.35       33.09
       1989 |        510       28.70       61.79
       1990 |        573       32.25       94.03
       1991 |         36        2.03       96.06
       1992 |         40        2.25       98.31
       1993 |         21        1.18       99.49
       1994 |          8        0.45       99.94
       1995 |          1        0.06      100.00
------------+-----------------------------------
      Total |      1,777      100.00

. tab yob if onderw1s16    <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1983 |          1        0.04        0.04
       1984 |          1        0.04        0.08
       1985 |          3        0.12        0.20
       1986 |          7        0.27        0.47
       1987 |         15        0.59        1.05
       1988 |         26        1.01        2.07
       1989 |         48        1.87        3.94
       1990 |         46        1.80        5.74
       1991 |        452       17.64       23.38
       1992 |        423       16.51       39.89
       1993 |        507       19.79       59.68
       1994 |        484       18.89       78.57
       1995 |        428       16.71       95.28
       1996 |        106        4.14       99.41
       1997 |          8        0.31       99.73
       1998 |          7        0.27      100.00
------------+-----------------------------------
      Total |      2,562      100.00

. tab yob if onderwijsNs16 <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1989 |          1        0.13        0.13
       1990 |          2        0.25        0.38
       1991 |          2        0.25        0.63
       1992 |          9        1.13        1.76
       1993 |         11        1.38        3.14
       1994 |         18        2.26        5.40
       1995 |        128       16.08       21.48
       1996 |        559       70.23       91.71
       1997 |         60        7.54       99.25
       1998 |          5        0.63       99.87
       1999 |          1        0.13      100.00
------------+-----------------------------------
      Total |        796      100.00

. 
. *   Which categories are there in each survey?
. tab onderwijss16        if twzyg<.

   School: op |
   welke vorm |
          van |
   voortgezet |
onderwijs zit |
 je of heb je |
gezeten ? (tm |
           ve |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -2 |          3        0.20        0.20
           -1 |          9        0.59        0.79
         vmbo |        554       36.62       37.41
         havo |        429       28.35       65.76
vwo/gymnasium |        518       34.24      100.00
--------------+-----------------------------------
        Total |      1,513      100.00

. tab onderw1s16          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |         12        0.53        0.53
                     vmbo |        231       10.25       10.79
vmbo theoretische leerweg |        341       15.14       25.92
                     havo |        576       25.57       51.49
                      vwo |        588       26.10       77.59
                gymnasium |        197        8.74       86.33
             1-jarige mbo |         33        1.46       87.79
            2-4 jarig mbo |        191        8.48       96.27
                      hbo |         61        2.71       98.98
             universiteit |         13        0.58       99.56
         anders, namelijk |         10        0.44      100.00
--------------------------+-----------------------------------
                    Total |      2,253      100.00

. tab onderw2s16          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      1,797       79.76       79.76
vmbo theoretische leerweg |         14        0.62       80.38
                     havo |         68        3.02       83.40
                      vwo |         24        1.07       84.47
                gymnasium |         25        1.11       85.57
             1-jarige mbo |         28        1.24       86.82
            2-4 jarig mbo |        173        7.68       94.50
                      hbo |         80        3.55       98.05
             universiteit |          8        0.36       98.40
         anders, namelijk |         36        1.60      100.00
--------------------------+-----------------------------------
                    Total |      2,253      100.00

. tab onderw3s16          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      2,228       98.89       98.89
                     havo |          3        0.13       99.02
                      vwo |          2        0.09       99.11
                gymnasium |          1        0.04       99.16
             1-jarige mbo |          2        0.09       99.25
            2-4 jarig mbo |          8        0.36       99.60
                      hbo |          5        0.22       99.82
         anders, namelijk |          4        0.18      100.00
--------------------------+-----------------------------------
                    Total |      2,253      100.00

. tab onderw4s16          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      2,251       99.91       99.91
            2-4 jarig mbo |          2        0.09      100.00
--------------------------+-----------------------------------
                    Total |      2,253      100.00

. tab onderw5s16          if twzyg<.

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      1,622      100.00      100.00
--------------------------+-----------------------------------
                    Total |      1,622      100.00

. tab onderwijsNs16       if twzyg<.

     School: versie 7: op |
welke vorm van voortgezet |
  onderwijs zit je of heb |
                je laatst |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                     vmbo |        106       14.25       14.25
vmbo theoretische leerweg |        148       19.89       34.14
                     havo |        223       29.97       64.11
                      vwo |        193       25.94       90.05
                gymnasium |         74        9.95      100.00
--------------------------+-----------------------------------
                    Total |        744      100.00

. 
. tab onderwijss16

   School: op |
   welke vorm |
          van |
   voortgezet |
onderwijs zit |
 je of heb je |
gezeten ? (tm |
           ve |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -2 |          6        0.34        0.34
           -1 |         14        0.79        1.13
         vmbo |        626       35.23       36.35
         havo |        498       28.02       64.38
vwo/gymnasium |        633       35.62      100.00
--------------+-----------------------------------
        Total |      1,777      100.00

. tab onderw1s16

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |         15        0.59        0.59
                     vmbo |        252        9.84       10.42
vmbo theoretische leerweg |        373       14.56       24.98
                     havo |        629       24.55       49.53
                      vwo |        640       24.98       74.51
                gymnasium |        214        8.35       82.86
             1-jarige mbo |         33        1.29       84.15
            2-4 jarig mbo |        221        8.63       92.78
                      hbo |        114        4.45       97.23
             universiteit |         60        2.34       99.57
         anders, namelijk |         11        0.43      100.00
--------------------------+-----------------------------------
                    Total |      2,562      100.00

. tab onderw2s16

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      2,005       78.26       78.26
vmbo theoretische leerweg |         17        0.66       78.92
                     havo |         76        2.97       81.89
                      vwo |         27        1.05       82.94
                gymnasium |         29        1.13       84.07
             1-jarige mbo |         30        1.17       85.25
            2-4 jarig mbo |        202        7.88       93.13
                      hbo |        114        4.45       97.58
             universiteit |         26        1.01       98.59
         anders, namelijk |         36        1.41      100.00
--------------------------+-----------------------------------
                    Total |      2,562      100.00

. tab onderw3s16

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      2,515       98.17       98.17
                     havo |          5        0.20       98.36
                      vwo |          3        0.12       98.48
                gymnasium |          1        0.04       98.52
             1-jarige mbo |          2        0.08       98.59
            2-4 jarig mbo |         11        0.43       99.02
                      hbo |         17        0.66       99.69
             universiteit |          3        0.12       99.80
         anders, namelijk |          5        0.20      100.00
--------------------------+-----------------------------------
                    Total |      2,562      100.00

. tab onderw4s16

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      2,557       99.80       99.80
             1-jarige mbo |          1        0.04       99.84
            2-4 jarig mbo |          4        0.16      100.00
--------------------------+-----------------------------------
                    Total |      2,562      100.00

. tab onderw5s16

School: op welke vorm van |
 voortgezet onderwijs zit |
  je of heb je het laatst |
                    gezet |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                       -1 |      1,845       99.95       99.95
            2-4 jarig mbo |          1        0.05      100.00
--------------------------+-----------------------------------
                    Total |      1,846      100.00

. tab onderwijsNs16

     School: versie 7: op |
welke vorm van voortgezet |
  onderwijs zit je of heb |
                je laatst |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                     vmbo |        112       14.07       14.07
vmbo theoretische leerweg |        158       19.85       33.92
                     havo |        238       29.90       63.82
                      vwo |        208       26.13       89.95
                gymnasium |         80       10.05      100.00
--------------------------+-----------------------------------
                    Total |        796      100.00

. 
. 
. /*
> Variabele               Invuljaar       Geboortejaar
> 
> onderwijss16    2005-2008       1988-1990 (1981-1995)   2004            DHBQ_14-16-18_versie1_rood-grijsBoekje                  VMBO/HAVO/
> VWO-GYM
>                                                                                                         2005            DHBQ_14-16-18_vers
> ie2_blauwBoekje_druk1
> onderw1s16              2009-2014       1991-1996 (1983-1999)   2009            DHBQ14_versie3_ONLINE_2009                                
>               VMBO/VMBO-t/HAVO/VWO/Gymnasium 
> onderwXs16                      ""                                                              2011            DHBQ14_versie4_ONLINE_2011
>                                               +       MBO1/MBO2-4/HBO/UNI/Anders, nl
>                                                                                                         2012            DHBQ14_versie5_ONL
> INE_2012                                                      (meerdere)
> onderwijsNs16   2013            1995-1997 (1994-1999)   2013            DHBQ14_versie6_ONLINE_2013                                        
>       VMBO/VMBO-t/HAVO/VWO/Gymnasium 
> */
. 
. 
. **      Check whether there are strange things going on
. 
. *       There is no child that has information entered on two occassions  
. list PID if onderwijss16<. & (onderw1s16<. | onderwijsNs16<.)

. list PID if onderw1s16<. & onderwijsNs16<.              

. 
. 
. **      Check which combination of levels occur when more than one option is possible
. 
. *       First those who give 2 answers, N=431/(510)
. tab onderw1s16 onderw2s16 if onderw2s16>-1 & onderw3s16==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |
    heb je het laatst |          School: op welke vorm van voortgezet onderwijs zit je of heb je het laatst gezet
                gezet | vmbo theo       havo        vwo  gymnasium   1-jarige  2-4 jarig        hbo  universit  anders, n |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                 vmbo |         9          5          0          0         10         73          1          0          9 |       107 
vmbo theoretische lee |         0         52          1          0         13        113          1          0          3 |       183 
                 havo |         0          0         23          1          3          9        102          0          0 |       138 
                  vwo |         0          0          0         25          0          0          5         18         17 |        65 
            gymnasium |         0          0          0          0          0          0          0          7          2 |         9 
         1-jarige mbo |         0          0          0          0          0          1          0          0          0 |         1 
        2-4 jarig mbo |         0          0          0          0          0          0          2          0          5 |         7 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |         9         57         24         26         26        196        111         25         36 |       510 


. tab onderw1s16 onderw2s16 if onderw2s16>-1 & onderw3s16==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |
    heb je het laatst |          School: op welke vorm van voortgezet onderwijs zit je of heb je het laatst gezet
                gezet | vmbo theo       havo        vwo  gymnasium   1-jarige  2-4 jarig        hbo  universit  anders, n |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                 vmbo |         8          5          0          0         10         66          1          0          9 |        99 
vmbo theoretische lee |         0         51          1          0         13         98          1          0          3 |       167 
                 havo |         0          0         22          1          1          7         78          0          0 |       109 
                  vwo |         0          0          0         23          0          0          0          6         17 |        46 
            gymnasium |         0          0          0          0          0          0          0          2          2 |         4 
         1-jarige mbo |         0          0          0          0          0          1          0          0          0 |         1 
        2-4 jarig mbo |         0          0          0          0          0          0          0          0          5 |         5 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |         8         56         23         24         24        172         80          8         36 |       431 


. *       (I've checked: when people have -1 on onderw(X)s16, they have -1 on onderw(X+1)s16.
. 
. /*
>  1 :    2       3                   6   7       8               10
>  2 :            3       4           6   7       8               10
>  3 :                    4       5       6       7   8   
>  4 :                            5                  (8)  9       10
>  5 :                                                        9   10
>  6 :                                    7
>  7 :                                               (8)      10  
> 
> Between brackets if siblings are included
> */
. 
. *       Those who give 3 answers, N=23/(42)
. tab onderw2s16 onderw3s16 if onderw1s16==1  & onderw3s16>-1 & onderw4s16==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of | School: op welke vorm van voortgezet onderwijs zit je
    heb je het laatst |               of heb je het laatst gezet
                gezet |      havo   1-jarige  2-4 jarig        hbo  anders, n |     Total
----------------------+-------------------------------------------------------+----------
vmbo theoretische lee |         2          1          2          0          0 |         5 
                 havo |         0          0          0          2          1 |         3 
         1-jarige mbo |         0          0          2          0          0 |         2 
        2-4 jarig mbo |         0          0          0          1          0 |         1 
----------------------+-------------------------------------------------------+----------
                Total |         2          1          4          3          1 |        11 


. tab onderw2s16 onderw3s16 if onderw1s16==1  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |    School: op welke vorm van voortgezet
    heb je het laatst | onderwijs zit je of heb je het laatst gezet
                gezet |      havo   1-jarige  2-4 jarig  anders, n |     Total
----------------------+--------------------------------------------+----------
vmbo theoretische lee |         2          1          2          0 |         5 
                 havo |         0          0          0          1 |         1 
         1-jarige mbo |         0          0          2          0 |         2 
----------------------+--------------------------------------------+----------
                Total |         2          1          4          1 |         8 


. tab onderw2s16 onderw3s16 if onderw1s16==2  & onderw3s16>-1 & onderw4s16==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of | School: op welke vorm van voortgezet onderwijs zit je
    heb je het laatst |               of heb je het laatst gezet
                gezet |       vwo   1-jarige  2-4 jarig        hbo  anders, n |     Total
----------------------+-------------------------------------------------------+----------
                 havo |         1          1          5          6          1 |        14 
         1-jarige mbo |         0          0          1          0          0 |         1 
        2-4 jarig mbo |         0          0          0          1          0 |         1 
----------------------+-------------------------------------------------------+----------
                Total |         1          1          6          7          1 |        16 


. tab onderw2s16 onderw3s16 if onderw1s16==2  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of | School: op welke vorm van voortgezet onderwijs zit je
    heb je het laatst |               of heb je het laatst gezet
                gezet |       vwo   1-jarige  2-4 jarig        hbo  anders, n |     Total
----------------------+-------------------------------------------------------+----------
                 havo |         1          1          3          4          1 |        10 
         1-jarige mbo |         0          0          1          0          0 |         1 
----------------------+-------------------------------------------------------+----------
                Total |         1          1          4          4          1 |        11 


. tab onderw2s16 onderw3s16 if onderw1s16==3  & onderw3s16>-1 & onderw4s16==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |    School: op welke vorm van voortgezet
    heb je het laatst | onderwijs zit je of heb je het laatst gezet
                gezet | gymnasium        hbo  universit  anders, n |     Total
----------------------+--------------------------------------------+----------
                  vwo |         1          2          0          0 |         3 
         1-jarige mbo |         0          1          0          0 |         1 
        2-4 jarig mbo |         0          3          0          1 |         4 
                  hbo |         0          0          1          0 |         1 
----------------------+--------------------------------------------+----------
                Total |         1          6          1          1 |         9 


. tab onderw2s16 onderw3s16 if onderw1s16==3  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.

School: op welke vorm |
       van voortgezet |    School: op welke vorm van
  onderwijs zit je of |  voortgezet onderwijs zit je of
    heb je het laatst |     heb je het laatst gezet
                gezet | gymnasium        hbo  anders, n |     Total
----------------------+---------------------------------+----------
                  vwo |         1          0          0 |         1 
         1-jarige mbo |         0          1          0 |         1 
        2-4 jarig mbo |         0          0          1 |         1 
----------------------+---------------------------------+----------
                Total |         1          1          1 |         3 


. tab onderw2s16 onderw3s16 if onderw1s16==4  & onderw3s16>-1 & onderw4s16==-1

School: op welke vorm |
       van voortgezet |
  onderwijs zit je of |    School: op welke vorm van voortgezet
    heb je het laatst | onderwijs zit je of heb je het laatst gezet
                gezet | 2-4 jarig        hbo  universit  anders, n |     Total
----------------------+--------------------------------------------+----------
            gymnasium |         1          1          0          1 |         3 
                  hbo |         0          0          2          0 |         2 
----------------------+--------------------------------------------+----------
                Total |         1          1          2          1 |         5 


. tab onderw2s16 onderw3s16 if onderw1s16==4  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.

                      | School: op
                      | welke vorm
                      |    van
                      | voortgezet
                      | onderwijs
School: op welke vorm | zit je of
       van voortgezet | heb je het
  onderwijs zit je of |   laatst
    heb je het laatst |   gezet
                gezet | anders, n |     Total
----------------------+-----------+----------
            gymnasium |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 


. tab onderw2s16 onderw3s16 if onderw1s16==5  & onderw3s16>-1 & onderw4s16==-1

                      | School: op
                      | welke vorm
                      |    van
                      | voortgezet
                      | onderwijs
School: op welke vorm | zit je of
       van voortgezet | heb je het
  onderwijs zit je of |   laatst
    heb je het laatst |   gezet
                gezet | anders, n |     Total
----------------------+-----------+----------
         universiteit |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 


. tab onderw2s16 onderw3s16 if onderw1s16==5  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==6  & onderw3s16>-1 & onderw4s16==-1                            
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==6  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.          
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==7  & onderw3s16>-1 & onderw4s16==-1
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==7  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==8  & onderw3s16>-1 & onderw4s16==-1
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==8  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==9  & onderw3s16>-1 & onderw4s16==-1
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==9  & onderw3s16>-1 & onderw4s16==-1 & twzyg<.
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==10 & onderw3s16>-1 & onderw4s16==-1
no observations

. tab onderw2s16 onderw3s16 if onderw1s16==10 & onderw3s16>-1 & onderw4s16==-1 & twzyg<.
no observations

. 
. 
. /*
>  1 :  2+[3   6 7]   3+[     (8)10]                                                              6+[7]     (7+[ 8         ])    
>  2 :                        3+[4 6 7 8 10]                                                                      6+[7]      7+[(8)(10)]    
>       
>  3 :                                                            4+[5(8)]                                                6+[8]      7+[    
> 10 ]  (8+[9])
>  4 :                                                                                    5+[(7)(8) 10 ]                                    
>                       (8+[9])
>  5 :                                                                                                                                      
>                                                               (9+[10])
>  6 :            
>  7 :            
>  8 :
>  9 :
>  10:
>  
> Between brackets if siblings are included
> */
. 
. *       Those who give 4 answers, N=2/(4)
. list onderw1s16 onderw2s16 onderw3s16 onderw4s16                        if onderw4s16>-1 & onderw5s16==-1 

       +-------------------------------------------------------+
       |   onderw1s16     onderw2s16   ond~3s16     onderw4s16 |
       |-------------------------------------------------------|
 4036. | vmbo theoret           havo        vwo   2-4 jarig mb |
 6136. |         vmbo   vmbo theoret       havo   2-4 jarig mb |
 6971. | vmbo theoret           havo        vwo   2-4 jarig mb |
17855. |         vmbo   vmbo theoret       havo   2-4 jarig mb |
       +-------------------------------------------------------+

. list onderw1s16 onderw2s16 onderw3s16 onderw4s16                        if onderw4s16>-1 & onderw5s16==-1 & twzyg<.

       +-------------------------------------------------------+
       |   onderw1s16     onderw2s16   ond~3s16     onderw4s16 |
       |-------------------------------------------------------|
 4036. | vmbo theoret           havo        vwo   2-4 jarig mb |
 6136. |         vmbo   vmbo theoret       havo   2-4 jarig mb |
       +-------------------------------------------------------+

. /*
>  1+2+3   +6
>    2+3+4 +6 
> */
. 
. list onderw1s16 onderw2s16 onderw3s16 onderw4s16 onderw5s16 if onderw5s16>-1 & onderw5s16<.

       +-----------------------------------------------------------------+
       | ond~1s16     onderw2s16   ond~3s16    onderw4s16     onderw5s16 |
       |-----------------------------------------------------------------|
 7313. |     vmbo   vmbo theoret       havo   1-jarige mb   2-4 jarig mb |
       +-----------------------------------------------------------------+

. *       Those who give 5 answers, N=1/(1)
. * 1+2+3+6+7
. 
. 
. **      Create the actual variable 
. 
. *       Mentioned one particular level
. gen edu16 =.
(18858 missing values generated)

. replace edu16 = 0.5 if                                   (onderw1s16== 1 & onderw2s16==-1) | onderwijsNs16==1   // VMBO (vmbo-t ook optie)
(289 real changes made)

. replace edu16 = 1.5 if onderwijss16==1                                                                                                    
>               // VMBO (enige optie)
(626 real changes made)

. replace edu16 = 2   if                                   (onderw1s16== 2 & onderw2s16==-1) | onderwijsNs16==2   // VMBO theoretische
(410 real changes made)

. replace edu16 = 3   if onderwijss16==2 | (onderw1s16== 3 & onderw2s16==-1) | onderwijsNs16==3   // HAVO
(1188 real changes made)

. replace edu16 = 4   if                                   (onderw1s16== 4 & onderw2s16==-1) | onderwijsNs16==4   // VWO
(650 real changes made)

. replace edu16 = 4   if onderwijss16==3                                                                                                    
>               // VWO-Gymnasium
(633 real changes made)

. replace edu16 = 4   if                                   (onderw1s16== 5 & onderw2s16==-1) | onderwijsNs16==5   // Gymnasium
(204 real changes made)

. replace edu16 = 0   if                                   (onderw1s16== 6 & onderw2s16==-1)                                              //
>  MBO1
(32 real changes made)

. replace edu16 = 1.5 if                                   (onderw1s16== 7 & onderw2s16==-1)                                              //
>  MBO2-4
(214 real changes made)

. replace edu16 = 3   if                                   (onderw1s16== 8 & onderw2s16==-1)                                              //
>  HBO
(114 real changes made)

. replace edu16 = 4   if                                   (onderw1s16== 9 & onderw2s16==-1)                                              //
>  Universiteit
(60 real changes made)

. replace edu16 = .a  if                                   (onderw1s16==10 & onderw2s16==-1)                                              //
>  Anders
(11 real changes made, 11 to missing)

. 
. *       Mentioned two levels
. replace edu16 = 1.5 if onderw1s16==1 & onderw2s16== 2 & onderw3s16==-1                                                  // VMBO   + VMBO-t
(9 real changes made)

. replace edu16 = 2.5 if onderw1s16==1 & onderw2s16== 3 & onderw3s16==-1                                                  // VMBO   + HAVO
(5 real changes made)

. replace edu16 = 3   if onderw1s16==1 & onderw2s16== 4 & onderw3s16==-1                                                  // VMBO   + VWO
(0 real changes made)

. replace edu16 = 0   if onderw1s16==1 & onderw2s16== 6 & onderw3s16==-1                                                  // VMBO   + MBO1
(10 real changes made)

. replace edu16 = 1   if onderw1s16==1 & onderw2s16== 7 & onderw3s16==-1                                                  // VMBO   + MBO2-4
(73 real changes made)

. replace edu16 = 2   if onderw1s16==1 & onderw2s16== 8 & onderw3s16==-1                                                  // VMBO   + HBO
(1 real change made)

. replace edu16 = 0.5 if onderw1s16==1 & onderw2s16==10 & onderw3s16==-1                                                  // VMBO   + Anders
(9 real changes made)

. replace edu16 = 2.5 if onderw1s16==2 & onderw2s16== 3 & onderw3s16==-1                                                  // VMBO-t + HAVO
(52 real changes made)

. replace edu16 = 3   if onderw1s16==2 & onderw2s16== 4 & onderw3s16==-1                                                  // VMBO-t + VWO
(1 real change made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 6 & onderw3s16==-1                                                  // VMBO-t + MBO1
(13 real changes made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 7 & onderw3s16==-1                                                  // VMBO-t + MBO2-4
(113 real changes made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 8 & onderw3s16==-1                                                  // VMBO-t + HBO
(1 real change made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16==10 & onderw3s16==-1                                                  // VMBO-t + Anders
(3 real changes made)

. replace edu16 = 3.5 if onderw1s16==3 & onderw2s16== 4 & onderw3s16==-1                                                  // HAVO   + VWO
(23 real changes made)

. replace edu16 = 3.5 if onderw1s16==3 & onderw2s16== 5 & onderw3s16==-1                                                  // HAVO   + Gymnas
> ium
(1 real change made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 6 & onderw3s16==-1                                                  // HAVO   + MBO1
(3 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 7 & onderw3s16==-1                                                  // HAVO   + MBO2-4
(9 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 8 & onderw3s16==-1                                                  // HAVO   + HBO
(102 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 9 & onderw3s16==-1                                                  // HAVO   + Univer
> siteit
(0 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16==10 & onderw3s16==-1                                                  // HAVO   + Anders
(0 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 5 & onderw3s16==-1                                                  // VWO    + Gymnas
> ium
(25 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 8 & onderw3s16==-1                                                  // VWO    + HBO
(5 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 9 & onderw3s16==-1                                                  // VWO    + Univer
> siteit
(18 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16==10 & onderw3s16==-1                                                  // VWO    + Anders
(17 real changes made)

. replace edu16 = 4   if onderw1s16==5 & onderw2s16== 9 & onderw3s16==-1                                                  // Gymna. + Univer
> siteit
(7 real changes made)

. replace edu16 = 4   if onderw1s16==5 & onderw2s16==10 & onderw3s16==-1                                                  // Gymna. + Anders
(2 real changes made)

. replace edu16 = 1.5 if onderw1s16==6 & onderw2s16== 7 & onderw3s16==-1                                                  // MBO1   + MBO2-4
(1 real change made)

. replace edu16 = 2   if onderw1s16==7 & onderw2s16== 8 & onderw3s16==-1                                                  // MBO2-4 + HBO
(2 real changes made)

. replace edu16 = 1.5 if onderw1s16==7 & onderw2s16==10 & onderw3s16==-1                                                  // MBO2-4 + Anders
(5 real changes made)

. 
. 
. *       Mentioned three levels
. replace edu16 = 2   if onderw1s16==1 & onderw2s16== 2 & onderw3s16== 3  & onderw4s16==.                 // VMBO   + VMBO-t      + HAVO
(0 real changes made)

. replace edu16 = 3   if onderw1s16==1 & onderw2s16== 2 & onderw3s16== 4  & onderw4s16==.                 // VMBO   + VMBO-t      + VWO
(0 real changes made)

. replace edu16 = 1   if onderw1s16==1 & onderw2s16== 2 & onderw3s16== 6  & onderw4s16==.                 // VMBO   + VMBO-t      + MBO1
(0 real changes made)

. replace edu16 = 1.5 if onderw1s16==1 & onderw2s16== 2 & onderw3s16== 7  & onderw4s16==.                 // VMBO   + VMBO-t      + MBO2-4
(0 real changes made)

. replace edu16 = 1.5 if onderw1s16==1 & onderw2s16== 2 & onderw3s16==10  & onderw4s16==.                 // VMBO   + VMBO-t      + Anders
(0 real changes made)

. replace edu16 = 3   if onderw1s16==1 & onderw2s16== 3 & onderw3s16== 4  & onderw4s16==.                 // VMBO   + HAVO        + VWO
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==1 & onderw2s16== 3 & onderw3s16== 7  & onderw4s16==.                 // VMBO   + HAVO        + MBO2-4
(0 real changes made)

. replace edu16 = 3   if onderw1s16==1 & onderw2s16== 3 & onderw3s16== 8  & onderw4s16==.                 // VMBO   + HAVO        + HBO
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==1 & onderw2s16== 3 & onderw3s16==10  & onderw4s16==.                 // VMBO   + HAVO        + Anders
(0 real changes made)

. replace edu16 = 1   if onderw1s16==1 & onderw2s16== 6 & onderw3s16== 7  & onderw4s16==.                 // VMBO   + MBO1        + MBO2-4
(0 real changes made)

. replace edu16 = 2   if onderw1s16==1 & onderw2s16== 7 & onderw3s16== 8  & onderw4s16==.                 // VMBO   + MBO2-4      + HBO
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==1 & onderw2s16== 8 & onderw3s16== 9  & onderw4s16==.                 // VMBO   + HBO         + Uni
(0 real changes made)

. replace edu16 = 3   if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 4  & onderw4s16==.                 // VMBO-t + HAVO        + VWO
(0 real changes made)

. replace edu16 = 3   if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 5  & onderw4s16==.                 // VMBO-t + HAVO        + Gym
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 6  & onderw4s16==.                 // VMBO-t + HAVO        + MBO1
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 7  & onderw4s16==.                 // VMBO-t + HAVO        + MBO2-4
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 8  & onderw4s16==.                 // VMBO-t + HAVO        + HBO
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==2 & onderw2s16== 3 & onderw3s16==10  & onderw4s16==.                 // VMBO-t + HAVO        + Anders
(0 real changes made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 6 & onderw3s16== 7  & onderw4s16==.                 // VMBO-t + MBO1        + MBO2-4
(0 real changes made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 7 & onderw3s16== 8  & onderw4s16==.                 // VMBO-t + MBO2-4      + HBO
(0 real changes made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 7 & onderw3s16==10  & onderw4s16==.                 // VMBO-t + MBO2-4      + Anders
(0 real changes made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16==10 & onderw3s16==10  & onderw4s16==.                 // VMBO-t + Anders      + Anders
(0 real changes made)

. replace edu16 = 3.5 if onderw1s16==3 & onderw2s16== 4 & onderw3s16== 5  & onderw4s16==.                 // HAVO   + VWO         + Gym
(0 real changes made)

. replace edu16 = 3.5 if onderw1s16==3 & onderw2s16== 4 & onderw3s16== 8  & onderw4s16==.                 // HAVO   + VWO         + HBO
(0 real changes made)

. replace edu16 = 3.5 if onderw1s16==3 & onderw2s16== 4 & onderw3s16== 9  & onderw4s16==.                 // HAVO   + VWO         + Uni
(0 real changes made)

. replace edu16 = 3.5 if onderw1s16==3 & onderw2s16== 4 & onderw3s16==10  & onderw4s16==.                 // HAVO   + VWO         + Anders
(0 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 6 & onderw3s16== 8  & onderw4s16==.                 // HAVO   + MBO1        + HBO
(0 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 7 & onderw3s16==10  & onderw4s16==.                 // HAVO   + MBO2-4      + Anders
(0 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 8 & onderw3s16== 9  & onderw4s16==.                 // HAVO   + HBO         + Uni
(0 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 5 & onderw3s16== 7  & onderw4s16==.                 // VWO    +     Gym             + 
> MBO2-4
(0 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 5 & onderw3s16== 8  & onderw4s16==.                 // VWO    +     Gym             + 
> HBO
(0 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 5 & onderw3s16== 9  & onderw4s16==.                 // VWO    +     Gym             + 
> Uni
(0 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 5 & onderw3s16==10  & onderw4s16==.                 // VWO    +     Gym             + 
> Anders
(0 real changes made)

. replace edu16 = 4   if onderw1s16==4 & onderw2s16== 8 & onderw3s16== 9  & onderw4s16==.                 // VWO    +     HBO             + 
> Uni
(0 real changes made)

. replace edu16 = 4   if onderw1s16==5 & onderw2s16== 9 & onderw3s16==10  & onderw4s16==.                 // Gym    +     Uni             + 
> Anders
(0 real changes made)

. 
. 
. *       Mentioned four levels
. replace edu16 = 1.5 if onderw1s16==1 & onderw2s16== 2 & onderw3s16== 3 & onderw4s16== 6                 // VMBO   + VMBO-t      + HAVO   +
>  MBO1
(1 real change made)

. replace edu16 = 2   if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 4 & onderw4s16== 6                 // VMBO-t + HAVO        + VWO    +
>  MBO1
(0 real changes made)

. replace edu16 = 2.5 if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 4 & onderw4s16== 7                 // VMBO-t + HAVO        + VWO    +
>  MBO2-4
(2 real changes made)

. replace edu16 = 3   if onderw1s16==2 & onderw2s16== 3 & onderw3s16== 4 & onderw4s16==10                 // VMBO-t + HAVO        + VWO    +
>  Anders
(0 real changes made)

. replace edu16 = 3   if onderw1s16==3 & onderw2s16== 6 & onderw3s16== 7 & onderw4s16== 8                 // HAVO   + MBO1        + MBO2-4 +
>  HBO
(0 real changes made)

. 
. *       Mentioned five levels
. replace edu16 = 2   if onderw1s16==1 & onderw2s16== 2 & onderw3s16== 3  & onderw4s16== 6 & onderw5s16==  7      // VMBO + VMBO-t + HAVO + 
> MBO1 + MBO2-4
(1 real change made)

. replace edu16 = 3   if onderw1s16==1 & onderw2s16== 3 & onderw3s16== 4  & onderw4s16== 5 & onderw5s16== 10      // VMBO + HAVO   + VWO  + 
> Gym  + Anders
(0 real changes made)

. 
. codebook edu16

--------------------------------------------------------------------------------------------------------------------------------------------
edu16                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  13914/18858
       unique mv codes:  2                       missing .*:  11/18858

            tabulation:  Freq.  Value
                            42  0
                           298  .5
                            73  1
                           855  1.5
                           544  2
                            59  2.5
                          1417  3
                            24  3.5
                          1621  4
                         13914  .
                            11  .a

. codebook edu16 if edu12<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu16                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  5565/7895
       unique mv codes:  2                       missing .*:  3/7895

            tabulation:  Freq.  Value
                            12  0
                           110  .5
                            30  1
                           412  1.5
                           201  2
                            19  2.5
                           680  3
                            12  3.5
                           851  4
                          5565  .
                             3  .a

. codebook edu16 if edu12<. & edu14<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu16                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  1710/3127
       unique mv codes:  2                       missing .*:  1/3127

            tabulation:  Freq.  Value
                             8  0
                            75  .5
                            22  1
                           177  1.5
                           146  2
                            12  2.5
                           405  3
                            12  3.5
                           559  4
                          1710  .
                             1  .a

. 
. 
. //      STEP 1.6 --------------------------------------------------------------------------------------------------------
. //      Educational attainment age 18 filled in by student
. 
. **      Explore which categories there are over the years
. 
. *       Which survey is taken when?
. tab invjaars18 if onderwijss18  <.

   jaar van |
  invullen, |
     dhbq18 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2004 |         15        1.70        1.70
       2005 |        242       27.38       29.07
       2006 |        325       36.76       65.84
       2007 |        302       34.16      100.00
------------+-----------------------------------
      Total |        884      100.00

. *tab invjaars18 if onderw1s18    <.
. *tab invjaars18 if onderw2s18    <.
. *tab invjaars18 if onderw3s18    <.
. *tab invjaars18 if onderw4s18    <.
. *tab invjaars18 if onderw5s18    <.
. *tab invjaars18 if onderwijsNs18 <.
. 
. *       What years of birth do each survey cover?
. tab yob if onderwijss18  <. & twzyg<.

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1984 |          2        0.26        0.26
       1986 |         80       10.60       10.86
       1987 |        364       48.21       59.07
       1988 |        309       40.93      100.00
------------+-----------------------------------
      Total |        755      100.00

. *tab yob if onderw1s18    <. & twzyg<.
. *tab yob if onderwijsNs18 <. & twzyg<.
. 
. tab yob if onderwijss18  <. 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1981 |          4        0.45        0.45
       1982 |          1        0.11        0.57
       1983 |          9        1.02        1.58
       1984 |         11        1.24        2.83
       1985 |         16        1.81        4.64
       1986 |         96       10.86       15.50
       1987 |        369       41.74       57.24
       1988 |        313       35.41       92.65
       1989 |         11        1.24       93.89
       1990 |         13        1.47       95.36
       1991 |         21        2.38       97.74
       1992 |         14        1.58       99.32
       1993 |          4        0.45       99.77
       1994 |          2        0.23      100.00
------------+-----------------------------------
      Total |        884      100.00

. *tab yob if onderw1s18    <. 
. *tab yob if onderwijsNs18 <. 
. 
. *   Which categories are there in each survey?
. tab onderwijss18        if twzyg<.

   School: op |
   welke vorm |
          van |
   voortgezet |
onderwijs zit |
 je of heb je |
gezeten ? (tm |
           ve |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -2 |          6        0.79        0.79
           -1 |         14        1.85        2.65
         vmbo |        261       34.57       37.22
         havo |        215       28.48       65.70
vwo/gymnasium |        259       34.30      100.00
--------------+-----------------------------------
        Total |        755      100.00

. *tab onderw1s18         if twzyg<.
. *tab onderw2s18         if twzyg<.
. *tab onderw3s18         if twzyg<.
. *tab onderw4s18         if twzyg<.
. *tab onderw5s18         if twzyg<.
. *tab onderwijsNs18      if twzyg<.
. 
. tab onderwijss18

   School: op |
   welke vorm |
          van |
   voortgezet |
onderwijs zit |
 je of heb je |
gezeten ? (tm |
           ve |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -2 |          8        0.90        0.90
           -1 |         14        1.58        2.49
         vmbo |        308       34.84       37.33
         havo |        245       27.71       65.05
vwo/gymnasium |        309       34.95      100.00
--------------+-----------------------------------
        Total |        884      100.00

. *tab onderw1s18
. *tab onderw2s18
. *tab onderw3s18
. *tab onderw4s18
. *tab onderw5s18
. *tab onderwijsNs18
. 
. 
. /*
> Variabele               Invuljaar       Geboortejaar
> 
> onderwijss18    2004-2007       1986-1988 (1981-1994)   2004            DHBQ_14-16-18_versie1_rood-grijsBoekje                  VMBO/HAVO/
> VWO-GYM
>                                                                                                         2005            DHBQ_14-16-18_vers
> ie2_blauwBoekje_druk1
> ???
> onderw1s18              2009-2014       1991-1996 (1983-1999)   2009            DHBQ14_versie3_ONLINE_2009                                
>               VMBO/VMBO-t/HAVO/VWO/Gymnasium 
> onderwXs18                      ""                                                              2011            DHBQ14_versie4_ONLINE_2011
>                                               +       MBO1/MBO2-4/HBO/UNI/Anders, nl
>                                                                                                         2012            DHBQ14_versie5_ONL
> INE_2012                                                      (meerdere)
> onderwijsNs18   2013            1995-1997 (1994-1999)   2003            DHBQ14_versie6_ONLINE_2013                                        
>       VMBO/VMBO-t/HAVO/VWO/Gymnasium 
> */
. 
. 
. **      Check whether there are strange things going on
. 
. *       There is no child that has information entered on two occassions  
. *list PID if onderwijss18<. & (onderw1s18<. | onderwijsNs18<.)
. *list PID if onderw1s18<. & onderwijsNs18<.             
. 
. /*
> **      Check which combination of levels occur when more than one option is possible
> 
> *       First those who give 2 answers, N=431/(510)
> tab onderw1s18 onderw2s18 if onderw2s18>-1 & onderw3s18==-1
> tab onderw1s18 onderw2s18 if onderw2s18>-1 & onderw3s18==-1 & twzyg<.
> *       (I've checked: when people have -1 on onderw(X)s18, they have -1 on onderw(X+1)s18.
> 
> /*
>  1 :    2       3                   6   7       8               10
>  2 :            3       4           6   7       8               10
>  3 :                    4       5       6       7   8   
>  4 :                            5                  (8)  9       10
>  5 :                                                        9   10
>  6 :                                    7
>  7 :                                               (8)      10  
> 
> Between brackets if siblings are included
> */
> 
> *       Those who give 3 answers, N=23/(42)
> tab onderw2s18 onderw3s18 if onderw1s18==1  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==1  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==2  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==2  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==3  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==3  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==4  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==4  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==5  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==5  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==6  & onderw3s18>-1 & onderw4s18==-1                            
> tab onderw2s18 onderw3s18 if onderw1s18==6  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.          
> tab onderw2s18 onderw3s18 if onderw1s18==7  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==7  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==8  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==8  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==9  & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==9  & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> tab onderw2s18 onderw3s18 if onderw1s18==10 & onderw3s18>-1 & onderw4s18==-1
> tab onderw2s18 onderw3s18 if onderw1s18==10 & onderw3s18>-1 & onderw4s18==-1 & twzyg<.
> 
> 
> /*
>  1 :  2+[3   6 7]   3+[     (8)10]                                                              6+[7]     (7+[ 8         ])    
>  2 :                        3+[4 6 7 8 10]                                                                      6+[7]      7+[(8)(10)]    
>       
>  3 :                                                            4+[5(8)]                                                6+[8]      7+[    
> 10 ]  (8+[9])
>  4 :                                                                                    5+[(7)(8) 10 ]                                    
>                       (8+[9])
>  5 :                                                                                                                                      
>                                                               (9+[10])
>  6 :            
>  7 :            
>  8 :
>  9 :
>  10:
>  
> Between brackets if siblings are included
> */
> 
> *       Those who give 4 answers, N=2/(4)
> list onderw1s18 onderw2s18 onderw3s18 onderw4s18                        if onderw4s18>-1 & onderw5s18==-1 
> list onderw1s18 onderw2s18 onderw3s18 onderw4s18                        if onderw4s18>-1 & onderw5s18==-1 & twzyg<.
> /*
>  1+2+3   +6
>    2+3+4 +6 
> */
> 
> list onderw1s18 onderw2s18 onderw3s18 onderw4s18 onderw5s18 if onderw5s18>-1 & onderw5s18<.
> *       Those who give 5 answers, N=1/(1)
> * 1+2+3+6+7
> */
. 
. **      Create the actual variable 
. 
. *       Mentioned one particular level
. gen edu18 =.
(18858 missing values generated)

. replace edu18 = 1.5 if onderwijss18==1                                                                                                    
>               // VMBO (enige optie)
(308 real changes made)

. replace edu18 = 3   if onderwijss18==2                                                                                                    
>               // HAVO
(245 real changes made)

. replace edu18 = 4   if onderwijss18==3                                                                                                    
>               // VWO-Gymnasium
(309 real changes made)

. **      More than one level mentioned not available - check whether it's really not available?
. 
. codebook edu18

--------------------------------------------------------------------------------------------------------------------------------------------
edu18                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1.5,4]                      units:  .1
         unique values:  3                        missing .:  17996/18858

            tabulation:  Freq.  Value
                           308  1.5
                           245  3
                           309  4
                         17996  .

. codebook edu18 if edu12<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu18                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1.5,4]                      units:  .1
         unique values:  3                        missing .:  7545/7895

            tabulation:  Freq.  Value
                           120  1.5
                            98  3
                           132  4
                          7545  .

. codebook edu18 if edu12<. & edu14<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu18                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [.,.]                        units:  .
         unique values:  0                        missing .:  3127/3127

            tabulation:  Freq.  Value
                          3127  .

. 
. 
. gen edu_dif_14_12               = edu14-edu12
(15731 missing values generated)

. gen edu_difabs_14_12    = abs(edu_dif_14_12)
(15731 missing values generated)

. gen edu_dif_16_14               = edu16-edu14
(15795 missing values generated)

. gen edu_difabs_16_14    = abs(edu_dif_16_14)
(15795 missing values generated)

. 
. tab edu_dif_14_12

edu_dif_14_ |
         12 |      Freq.     Percent        Cum.
------------+-----------------------------------
       -2.5 |         17        0.54        0.54
         -2 |         20        0.64        1.18
      -1.75 |          5        0.16        1.34
       -1.5 |        101        3.23        4.57
      -1.25 |          4        0.13        4.70
         -1 |        226        7.23       11.93
       -.75 |         22        0.70       12.63
        -.5 |        446       14.26       26.89
       -.25 |         36        1.15       28.05
          0 |      1,399       44.74       72.79
        .25 |         71        2.27       75.06
         .5 |        430       13.75       88.81
        .75 |         31        0.99       89.80
          1 |        214        6.84       96.64
       1.25 |          4        0.13       96.77
        1.5 |         78        2.49       99.26
       1.75 |          2        0.06       99.33
          2 |         12        0.38       99.71
        2.5 |          2        0.06       99.78
          3 |          6        0.19       99.97
          4 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,127      100.00

. tab edu_difabs_14_12

edu_difabs_ |
      14_12 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,399       44.74       44.74
        .25 |        107        3.42       48.16
         .5 |        876       28.01       76.18
        .75 |         53        1.69       77.87
          1 |        440       14.07       91.94
       1.25 |          8        0.26       92.20
        1.5 |        179        5.72       97.92
       1.75 |          7        0.22       98.15
          2 |         32        1.02       99.17
        2.5 |         19        0.61       99.78
          3 |          6        0.19       99.97
          4 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,127      100.00

. tab edu_dif_16_14

edu_dif_16_ |
         14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       -3.5 |          1        0.03        0.03
         -3 |          1        0.03        0.07
       -2.5 |         13        0.42        0.49
         -2 |         34        1.11        1.60
       -1.5 |        125        4.08        5.68
         -1 |        417       13.61       19.29
        -.5 |        142        4.64       23.93
          0 |      2,005       65.46       89.39
         .5 |        189        6.17       95.56
          1 |         83        2.71       98.27
        1.5 |         49        1.60       99.87
          2 |          1        0.03       99.90
        2.5 |          2        0.07       99.97
        3.5 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,063      100.00

. tab edu_difabs_16_14

edu_difabs_ |
      16_14 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,005       65.46       65.46
         .5 |        331       10.81       76.27
          1 |        500       16.32       92.59
        1.5 |        174        5.68       98.27
          2 |         35        1.14       99.41
        2.5 |         15        0.49       99.90
          3 |          1        0.03       99.93
        3.5 |          2        0.07      100.00
------------+-----------------------------------
      Total |      3,063      100.00

. 
. tab edu_dif_14_12               if twzyg<.

edu_dif_14_ |
         12 |      Freq.     Percent        Cum.
------------+-----------------------------------
       -2.5 |         17        0.54        0.54
         -2 |         20        0.64        1.18
      -1.75 |          5        0.16        1.34
       -1.5 |        101        3.23        4.57
      -1.25 |          4        0.13        4.70
         -1 |        226        7.23       11.93
       -.75 |         22        0.70       12.63
        -.5 |        446       14.26       26.89
       -.25 |         36        1.15       28.05
          0 |      1,399       44.74       72.79
        .25 |         71        2.27       75.06
         .5 |        430       13.75       88.81
        .75 |         31        0.99       89.80
          1 |        214        6.84       96.64
       1.25 |          4        0.13       96.77
        1.5 |         78        2.49       99.26
       1.75 |          2        0.06       99.33
          2 |         12        0.38       99.71
        2.5 |          2        0.06       99.78
          3 |          6        0.19       99.97
          4 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,127      100.00

. tab edu_difabs_14_12    if twzyg<.

edu_difabs_ |
      14_12 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,399       44.74       44.74
        .25 |        107        3.42       48.16
         .5 |        876       28.01       76.18
        .75 |         53        1.69       77.87
          1 |        440       14.07       91.94
       1.25 |          8        0.26       92.20
        1.5 |        179        5.72       97.92
       1.75 |          7        0.22       98.15
          2 |         32        1.02       99.17
        2.5 |         19        0.61       99.78
          3 |          6        0.19       99.97
          4 |          1        0.03      100.00
------------+-----------------------------------
      Total |      3,127      100.00

. tab edu_dif_16_14               if twzyg<.

edu_dif_16_ |
         14 |      Freq.     Percent        Cum.
------------+-----------------------------------
       -3.5 |          1        0.04        0.04
         -3 |          1        0.04        0.07
       -2.5 |         13        0.48        0.55
         -2 |         31        1.15        1.70
       -1.5 |        115        4.25        5.96
         -1 |        371       13.73       19.68
        -.5 |        124        4.59       24.27
          0 |      1,765       65.30       89.57
         .5 |        164        6.07       95.63
          1 |         73        2.70       98.34
        1.5 |         42        1.55       99.89
          2 |          1        0.04       99.93
        2.5 |          1        0.04       99.96
        3.5 |          1        0.04      100.00
------------+-----------------------------------
      Total |      2,703      100.00

. tab edu_difabs_16_14    if twzyg<.

edu_difabs_ |
      16_14 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,765       65.30       65.30
         .5 |        288       10.65       75.95
          1 |        444       16.43       92.38
        1.5 |        157        5.81       98.19
          2 |         32        1.18       99.37
        2.5 |         14        0.52       99.89
          3 |          1        0.04       99.93
        3.5 |          2        0.07      100.00
------------+-----------------------------------
      Total |      2,703      100.00

. 
. egen edu14_16 = rowmean(edu14 edu16)
(9300 missing values generated)

. tab edu14 if edu16<.

      edu14 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        0.03        0.03
         .5 |        133        4.34        4.37
          1 |          5        0.16        4.54
        1.5 |        488       15.93       20.47
          2 |        272        8.88       29.35
        2.5 |         62        2.02       31.37
          3 |        765       24.98       56.35
        3.5 |         68        2.22       58.57
          4 |      1,269       41.43      100.00
------------+-----------------------------------
      Total |      3,063      100.00

. tab edu14_16

   edu14_16 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         16        0.17        0.17
        .25 |         10        0.10        0.27
         .5 |        688        7.20        7.47
        .75 |         40        0.42        7.89
          1 |        118        1.23        9.12
       1.25 |        108        1.13       10.25
        1.5 |      1,590       16.64       26.89
       1.75 |        148        1.55       28.44
          2 |        887        9.28       37.72
       2.25 |         94        0.98       38.70
        2.5 |        247        2.58       41.28
       2.75 |         58        0.61       41.89
          3 |      2,292       23.98       65.87
       3.25 |         39        0.41       66.28
        3.5 |        367        3.84       70.12
       3.75 |         25        0.26       70.38
          4 |      2,831       29.62      100.00
------------+-----------------------------------
      Total |      9,558      100.00

. codebook edu16 if edu12<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu16                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  5565/7895
       unique mv codes:  2                       missing .*:  3/7895

            tabulation:  Freq.  Value
                            12  0
                           110  .5
                            30  1
                           412  1.5
                           201  2
                            19  2.5
                           680  3
                            12  3.5
                           851  4
                          5565  .
                             3  .a

. codebook edu14_16 if edu12<.

--------------------------------------------------------------------------------------------------------------------------------------------
edu14_16                                                                                                                         (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .01
         unique values:  17                       missing .:  3857/7895

                  mean:   2.80628
              std. dev:   1.10854

           percentiles:        10%       25%       50%       75%       90%
                               1.5       1.5         3         4         4

. tab edu16 if edu12<.

      edu16 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         12        0.52        0.52
         .5 |        110        4.73        5.24
          1 |         30        1.29        6.53
        1.5 |        412       17.71       24.24
          2 |        201        8.64       32.87
        2.5 |         19        0.82       33.69
          3 |        680       29.22       62.91
        3.5 |         12        0.52       63.43
          4 |        851       36.57      100.00
------------+-----------------------------------
      Total |      2,327      100.00

. tab edu14_16 if edu12<.

   edu14_16 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        0.10        0.10
        .25 |          2        0.05        0.15
         .5 |        180        4.46        4.61
        .75 |         15        0.37        4.98
          1 |         39        0.97        5.94
       1.25 |         51        1.26        7.21
        1.5 |        775       19.19       26.40
       1.75 |         61        1.51       27.91
          2 |        259        6.41       34.32
       2.25 |         34        0.84       35.17
        2.5 |         77        1.91       37.07
       2.75 |         15        0.37       37.44
          3 |        988       24.47       61.91
       3.25 |         14        0.35       62.26
        3.5 |        148        3.67       65.92
       3.75 |          7        0.17       66.10
          4 |      1,369       33.90      100.00
------------+-----------------------------------
      Total |      4,038      100.00

. 
. tab o9h0_1 

       Highest education, 9 cat, AS_0.1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
         upper general secondary school |          2       66.67       66.67
   higher education (hbo or university) |          1       33.33      100.00
----------------------------------------+-----------------------------------
                                  Total |          3      100.00

. tab oplh0_2 

              Highest education, AS_0.2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
question asked, but not answered (onlin |          1        0.33        0.33
            question not asked (online) |         42       14.05       14.38
intermediate secondary general school ( |          2        0.67       15.05
  intermediate secondary general school |         10        3.34       18.39
intermediate vocational education (2-4  |         38       12.71       31.10
         upper general secondary school |         88       29.43       60.54
   higher education (hbo or university) |        105       35.12       95.65
          university or post-hbo degree |         13        4.35      100.00
----------------------------------------+-----------------------------------
                                  Total |        299      100.00

. tab o7hg1 
no observations

. tab op9h2
no observations

. tab op9h3
no observations

. tab o13h4

 Educational attainment, 13 categories, |
                                   AS_4 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      elementary school |          2      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          2      100.00

. tab o13h5 

 Highest education of yourself, ANTR_5, |
                                   AS_5 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
several years of upper general secondar |          1       50.00       50.00
several years of intermediate vocationa |          1       50.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          2      100.00

. tab o13h6 

Educational attainment , 13 categories, |
                                   AS_6 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      elementary school |          1       10.00       10.00
several years of lower general secondar |          1       10.00       20.00
several years of upper general secondar |          4       40.00       60.00
upper general secondary school complete |          2       20.00       80.00
several years of intermediate vocationa |          2       20.00      100.00
----------------------------------------+-----------------------------------
                                  Total |         10      100.00

. tab oplhu7 

 What is the highest level of education |
       you and your parents/carers have |
                               attained |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
upper general secondary school (havo/vw |          3      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          3      100.00

. tab o9h8 

       Highest attended education, AS_8 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                     -1 |         22        1.14        1.14
                      elementary school |         13        0.68        1.82
lower general secondary (vmbo/vocationa |         22        1.14        2.97
lower general secondary school (mulo, m |         52        2.71        5.67
upper general secondary school (havo, h |        370       19.25       24.92
1 year of intermediate vocational educa |         18        0.94       25.86
2-4 years of intermediate vocational ed |        430       22.37       48.23
      higher vocational education (hbo) |        576       29.97       78.20
   university degree or post-hbo degree |        413       21.49       99.69
     post-graduate degree or PhD degree |          6        0.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,922      100.00

. tab o9h10 

      Highest level of education, AS_10 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                     -9 |         13        0.35        0.35
            question not asked (online) |        132        3.60        3.95
                  double answer (paper) |         10        0.27        4.23
                                missing |         14        0.38        4.61
                      elementary school |          3        0.08        4.69
lower general secondary (vmbo/vocationa |         46        1.25        5.94
lower general secondary school (mulo, m |         69        1.88        7.82
higher general secondary school (havo,  |        490       13.36       21.18
1 year of intermediate vocational educa |         23        0.63       21.81
2-4 years of intermediate vocational ed |        703       19.17       40.98
      higher vocational education (hbo) |      1,161       31.65       72.63
   university degree or post-hbo degree |        969       26.42       99.05
     post-graduate degree or PhD degree |         25        0.68       99.73
              not applicable/don't know |         10        0.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      3,668      100.00

. 
. 
. //      STEP 1.7 --------------------------------------------------------------------------------------------------------
. //      Educational attainment: 
. 
. tab diplvo1s18 diplvo2s18       // Checked: diplvo2s18>diplvo1s18 if diplvo1s18==0,1,2,3 & diplvo2s18==1,2,3

   School: heb je een |
   diploma gehaald in |
        het voorgezet |  School: heb je een diploma gehaald in het voorgezet
 onderwijs, 1ste antw |              onderwijs, 2de antw (tm vers
              (tm ver |        -1   ja, vmbo   ja, havo   ja, vwo/   nee, ik  |     Total
----------------------+-------------------------------------------------------+----------
 nee, ik zit nog op s |         0          1          1          1          2 |         5 
             ja, vmbo |         0          0          7          0          1 |         8 
          ja, vwo/gym |         1          0          0          0          0 |         1 
----------------------+-------------------------------------------------------+----------
                Total |         1          1          8          1          3 |        14 


. tab diplvo2s18 diplvo3s18       // Checked: diplvo3s18>diplvo2s18 if diplvo2s18==0,1,2,3 & diplvo3s18==1,2,3

                      |  School:
                      | heb je een
                      |  diploma
                      | gehaald in
                      |    het
   School: heb je een | voorgezet
   diploma gehaald in | onderwijs,
        het voorgezet |  3de antw
  onderwijs, 2de antw |  (tm vers
             (tm vers |  ja, vwo/ |     Total
----------------------+-----------+----------
             ja, havo |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 


. 
. gen dip18 = .
(18858 missing values generated)

. replace dip18 = 1.5 if diplvo1s18==1    
(314 real changes made)

. replace dip18 = 3   if diplvo1s18==2    
(184 real changes made)

. replace dip18 = 4   if diplvo1s18==3    
(170 real changes made)

. replace dip18 = 1.5 if diplvo2s18==1     
(1 real change made)

. replace dip18 = 3   if diplvo2s18==2    
(8 real changes made)

. replace dip18 = 4   if diplvo2s18==3    
(1 real change made)

. replace dip18 = 1.5 if diplvo3s18==1     
(0 real changes made)

. replace dip18 = 3   if diplvo3s18==2    
(0 real changes made)

. replace dip18 = 4   if diplvo3s18==3    
(1 real change made)

. 
. tab diplvo1s16 diplvo2s16       // Checked: diplvo2s16>diplvo1s16 if diplvo1s16==0,1,2,3 & diplvo2s16==1,2,3

   School: heb je een |
   diploma gehaald in |
        het voorgezet |  School: heb je een diploma gehaald in het voorgezet
 onderwijs, 1ste antw |              onderwijs, 2de antw (tm vers
              (tm ver |        -1   ja, vmbo   ja, havo   ja, vwo/   nee, ik  |     Total
----------------------+-------------------------------------------------------+----------
 nee, ik zit nog op s |         0          8          1          1          7 |        17 
             ja, vmbo |         1          0          4          0          0 |         5 
----------------------+-------------------------------------------------------+----------
                Total |         1          8          5          1          7 |        22 


. tab diplvo2s16 diplvo3s16       // Checked: diplvo3s16>diplvo2s16 if diplvo2s16==0,1,2,3 & diplvo3s16==1,2,3

                      |  School:
                      | heb je een
                      |  diploma
                      | gehaald in
                      |    het
   School: heb je een | voorgezet
   diploma gehaald in | onderwijs,
        het voorgezet |  3de antw
  onderwijs, 2de antw |  (tm vers
             (tm vers |  nee, ik  |     Total
----------------------+-----------+----------
             ja, vmbo |         2 |         2 
----------------------+-----------+----------
                Total |         2 |         2 


. 
. gen dip16 = .
(18858 missing values generated)

. replace dip16 = 1.5 if diplvo1s16==1    
(394 real changes made)

. replace dip16 = 3   if diplvo1s16==2    
(63 real changes made)

. replace dip16 = 4   if diplvo1s16==3    
(42 real changes made)

. replace dip16 = 1.5 if diplvo2s16==1     
(8 real changes made)

. replace dip16 = 3   if diplvo2s16==2    
(5 real changes made)

. replace dip16 = 4   if diplvo2s16==3    
(1 real change made)

. replace dip16 = 1.5 if diplvo3s16==1     
(0 real changes made)

. replace dip16 = 3   if diplvo3s16==2    
(0 real changes made)

. replace dip16 = 4   if diplvo3s16==3    
(0 real changes made)

. 
. *       The few cases where dip16>edu16 if edu16<. are not very realistic given the age, so I won't
. *       do anything with them. I will use dip16 only when edu16==. 
. list onderwijss14 onderwijss16 lfts16 diplvo1s16 diplvo2s16 diplvo3s16 edu16 dip16 ///
>          if dip16<. & (dip16>edu16 | edu16==.)                          

       +-------------------------------------------------------------------------------------+
       | ond~ss14   ond~ss16   lfts16    diplvo1s16    diplvo2s16   dip~3s16   edu16   dip16 |
       |-------------------------------------------------------------------------------------|
  694. |        .         -2       16      ja, vmbo             .          .       .     1.5 |
 1243. |        .         -1       17   nee, ik zit      ja, vmbo          .       .     1.5 |
 1625. |        .         -2       17      ja, vmbo             .          .       .     1.5 |
 1906. |        .         -1       16      ja, vmbo             .          .       .     1.5 |
 1980. |     havo       havo       17   ja, vwo/gym             .          .       3       4 |
       |-------------------------------------------------------------------------------------|
 2097. |     havo         -1       19      ja, vmbo             .          .       .     1.5 |
 2363. |     vmbo         -1       16      ja, vmbo             .          .       .     1.5 |
 3284. |     havo       havo       16   ja, vwo/gym             .          .       3       4 |
 3682. |     havo       havo       19   ja, vwo/gym             .          .       3       4 |
 4586. |     vmbo       vmbo       16   ja, vwo/gym             .          .     1.5       4 |
       |-------------------------------------------------------------------------------------|
 5406. |     havo       vmbo       16   nee, ik zit   ja, vwo/gym          .     1.5       4 |
       +-------------------------------------------------------------------------------------+

. 
. gen edu = . 
(18858 missing values generated)

. replace edu = edu18 if edu18<.
(862 real changes made)

. replace edu = dip18 if dip18<. & (dip18>edu18 | edu18==.) 
(18 real changes made)

. replace edu = edu16 if edu18==. & dip18==. & edu16<.                    // "set to missing" are missings changed to specific missings
(4647 real changes made)

. replace edu = dip16 if edu18==. & dip18==. & dip16<.  & (edu16==. | edu16 ==.a)
(5 real changes made)

. replace edu = edu14 if edu18==. & dip18==. & dip16==. & (edu16==. | edu16 ==.a) & edu14<.
(4623 real changes made)

. tab edu

        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43        0.42        0.42
         .5 |        839        8.26        8.69
          1 |         83        0.82        9.50
        1.5 |      1,888       18.59       28.10
          2 |      1,167       11.49       39.59
        2.5 |        150        1.48       41.07
          3 |      2,784       27.42       68.49
        3.5 |        135        1.33       69.81
          4 |      3,065       30.19      100.00
------------+-----------------------------------
      Total |     10,154      100.00

. codebook edu

--------------------------------------------------------------------------------------------------------------------------------------------
edu                                                                                                                              (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,4]                        units:  .1
         unique values:  9                        missing .:  8704/18858

            tabulation:  Freq.  Value
                            43  0
                           839  .5
                            83  1
                          1888  1.5
                          1167  2
                           150  2.5
                          2784  3
                           135  3.5
                          3065  4
                          8704  .

. 
. *       Create age at which education is being measured.
. gen age = .
(18858 missing values generated)

. replace age = lfts18 if edu18<.
(862 real changes made)

. replace age = lfts18 if dip18<. & (dip18>edu18 | edu18==.) 
(17 real changes made)

. replace age = lfts16 if edu18==. & dip18==.     & edu16<.                       // "set to missing" are missings changed to specific missi
> ngs
(4643 real changes made)

. replace age = lfts16 if edu18==. & dip18==. & dip16<.  & (edu16==. | edu16 ==.a)
(5 real changes made)

. replace age = lfts14 if edu18==. & dip18==. & dip16==. & (edu16==. | edu16 ==.a) & edu14<.
(4623 real changes made)

. replace age = . if edu==.
(0 real changes made)

. list PID edu14 lfts14 edu16 lfts16 edu18 lfts18 edu age if edu<. & age==. // 4 children have edu16 but lfts16 missing

       +----------------------------------------------------------------------+
       |   PID   edu14   lfts14   edu16   lfts16   edu18   lfts18   edu   age |
       |----------------------------------------------------------------------|
 7963. | 11109       .        .       2        .       .        .     2     . |
 9326. | 12884       .        .       3        .       .        .     3     . |
 9894. | 13599       2       15       2        .       .        .     2     . |
10326. | 14167     1.5       14       2        .       .        .     2     . |
       +----------------------------------------------------------------------+

. codebook lfts16

--------------------------------------------------------------------------------------------------------------------------------------------
lfts16                                                                          demografische gegevens: mijn leeftijd is _______jaar, dhbq16
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [11,26]                      units:  1
         unique values:  16                       missing .:  13059/18858

                  mean:   16.6691
              std. dev:   1.25101

           percentiles:        10%       25%       50%       75%       90%
                                16        16        16        17        18

. replace age = 16.67 if edu16<. & lfts16==.      // Give 4 children with age missing the average age 
(4 real changes made)

. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |          1        0.01        0.01
         12 |         36        0.35        0.36
         13 |        784        7.72        8.09
         14 |      2,641       26.01       34.09
         15 |        937        9.23       43.32
         16 |      2,489       24.51       67.84
      16.67 |          4        0.04       67.87
         17 |      1,709       16.83       84.71
         18 |        988        9.73       94.44
         19 |        299        2.94       97.38
         20 |        126        1.24       98.62
         21 |         71        0.70       99.32
         22 |         34        0.33       99.66
         23 |         15        0.15       99.80
         24 |         11        0.11       99.91
         25 |          7        0.07       99.98
         26 |          2        0.02      100.00
------------+-----------------------------------
      Total |     10,154      100.00

. codebook age

--------------------------------------------------------------------------------------------------------------------------------------------
age                                                                                                                              (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [11,26]                      units:  .01
         unique values:  17                       missing .:  8704/18858

                  mean:   15.7246
              std. dev:   1.82896

           percentiles:        10%       25%       50%       75%       90%
                                14        14        16        17        18

. 
. *       Create an alternative measure of educational attainment to get better prediction of unclear "VMBO" category
. gen edu_alt = edu                                                                       
(8704 missing values generated)

. replace edu_alt = edu12 if edu_alt==1.5 & edu12<.       // Use information at age 12 to make a better prediction
(653 real changes made)

. 
. 
. //      STEP 2 ==========================================================================================================
. //      Definite vs delayed tracking
. 
. * Homogenous vs heterogenous class, based on mother
. gen delay_m = .
(18858 missing values generated)

. 
. labelbook hschm12

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschm12 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,17]                   string length:  [3,45]
           N:  20                unique at full length:  yes
        gaps:  yes                 unique at length 12:  no
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   nog niet van toepassing
           2   SVO (speciaal voortgezet onderwijs)
           3   PRO (praktijkonderijws)
           4   VMBO theoretische
           5   VMBO gemengde leerweg
           6   VMBO kaderberoepsgericht leerweg
           7   VMBO basisberoepsgerichte leerweg
           8   HAVO
           9   VWO
          10   gymnasium
          11   dubbel antwoord: vmbo/havo
          12   dubbel antwoord: vmbo verschillende leerwegen
          13   dubbel antwoord: vmbo beroep + havo
          14   dubbel antwoord: vwo/gym
          15   dubbel antwoord: vmbo/havo/vwo
          16   dubbel antwoord: havo/vwo
          17   dubbel antwoord: havo/vwo/gymnasium

   variables:  hschm12


. replace delay_m = 0 if hschm12>= 3 & hschm12<=10                                                                        // SVO not include
> d
(4951 real changes made)

. replace delay_m = 1 if hschm12>=11 & hschm12<=17                
(610 real changes made)

. 
. labelbook hschm12_v2            

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschm12_v2 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,8]                    string length:  [4,38]
           N:  11                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   nog niet van toepassing
           2   speciaal vervolgonderwijs
           3   lager beroepsonderwijs
           4   middelbaar beroepsonderwijs
           5   brugklas (anders dan beroepsonderwijs)
           6   MAVO
           7   HAVO
           8   VWO-gymnasium

   variables:  hschm12_v2


. replace delay_m = 0 if hschm12_v2>= 3 & hschm12_v2<=8                                                           // SVO not included
(363 real changes made)

. replace delay_m = 1 if hschm12_v2== 5                                                                                           // brugkla
> s (anders dan beroepsonderwijs)
(91 real changes made)

.         
. labelbook hschm12_v3                    

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschm12_v3 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,11]                   string length:  [4,38]
           N:  14                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   nog niet van toepassing
           2   speciaal vervolgonderwijs
           3   lager beroepsonderwijs
           4   middelbaar beroepsonderwijs
           5   VMBO
           6   brugklas (anders dan beroepsonderwijs)
           7   brugklas MAVO/HAVO
           8   brugklas HAVO/VWO
           9   MAVO
          10   HAVO
          11   VWO-gymnasium

   variables:  hschm12_v3


. replace delay_m = 0 if hschm12_v3>= 3 & hschm12_v3<=11                                                          // SVO not included
(1733 real changes made)

. replace delay_m = 1 if hschm12_v3>= 6 & hschm12_v3<= 8                                                          // brugklas (anders dan be
> roepsonderwijs); MAVO/HAVO; HAVO/VWO
(950 real changes made)

. 
. labelbook hschm12_1n hschm12_2n                                                                                                           
>                               

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschm12_1n 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,9]                    string length:  [5,37]
           N:  12                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  yes
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   1 SVO (speciaal voorgezet onderwijs)
           2   2 PRO (praktijkonderwijs)
           3   3 VMBO theoretische leerweg
           4   4 VMBO gemengde leerweg
           5   5 VMBO kaderberoepsgerichte leerweg
           6   6 VMBO basisberoepsgerichte leerweg
           7   7 HAVO
           8   8 VWO
           9   9 gymnasium

   variables:  hschm12_1n


--------------------------------------------------------------------------------------------------------------------------------------------
value label hschm12_2n 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,9]                    string length:  [5,37]
           N:  12                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  yes
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   1 SVO (speciaal voorgezet onderwijs)
           2   2 PRO (praktijkonderwijs)
           3   3 VMBO theoretische leerweg
           4   4 VMBO gemengde leerweg
           5   5 VMBO kaderberoepsgerichte leerweg
           6   6 VMBO basisberoepsgerichte leerweg
           7   7 HAVO
           8   8 VWO
           9   9 gymnasium

   variables:  hschm12_2n


. replace delay_m = 0 if hschm12_1n>= 2 & hschm12_1n<=9                                                           // SVO not included
(116 real changes made)

. replace delay_m = 1 if hschm12_2n>= 2 & hschm12_2n<=9 & hschm12_1n!=1                           // See earlier check that hschm12_2n/_3n a
> re missing if _1n missing
(116 real changes made)

. 
. codebook delay_m

--------------------------------------------------------------------------------------------------------------------------------------------
delay_m                                                                                                                          (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  11201/18858

            tabulation:  Freq.  Value
                          6006  0
                          1651  1
                         11201  .

. tab delay_m

    delay_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,006       78.44       78.44
          1 |      1,651       21.56      100.00
------------+-----------------------------------
      Total |      7,657      100.00

. 
. * Homogenous vs heterogenous class, based on father
. gen delay_v = .
(18858 missing values generated)

. 
. labelbook hschv12

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschv12 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,16]                   string length:  [3,45]
           N:  19                unique at full length:  yes
        gaps:  yes                 unique at length 12:  no
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   Nog niet van toepassing
           2   SVO
           3   PRO
           4   VMBO-t
           5   VMBO-g
           6   VMBO-k
           7   VMBO-b
           8   HAVO
           9   VWO
          10   gymnasium
          11   dubbel antwoord: vmbo/havo
          12   dubbel antwoord: vmbo verschillende leerwegen
          13   dubbel antwoord: vmbo beroep + havo
          14   dubbel antwoord: vwo/gym
          15   dubbel antwoord: vmbo/havo/vwo
          16   dubbel antwoord: havo/vwo

   variables:  hschv12


. replace delay_v = 0 if hschv12>= 3 & hschv12<=10                                                                        // SVO not include
> d
(1531 real changes made)

. replace delay_v = 1 if hschv12>=11 & hschv12<=16                
(287 real changes made)

. 
. labelbook hschv12_v2            

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschv12_v2 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,8]                    string length:  [4,38]
           N:  11                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   nog niet van toepassing
           2   speciaal vervolgonderwijs
           3   lager beroepsonderwijs
           4   middelbaar beroepsonderwijs
           5   brugklas (anders dan beroepsonderwijs)
           6   MAVO
           7   HAVO
           8   VWO-gymnasium

   variables:  hschv12_v2


. replace delay_v = 0 if hschv12_v2>= 3 & hschv12_v2<=8                                                           // SVO not included
(315 real changes made)

. replace delay_v = 1 if hschv12_v2== 5                                                                                           // brugkla
> s (anders dan beroepsonderwijs)
(78 real changes made)

.         
. labelbook hschv12_v3                    

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschv12_v3 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,11]                   string length:  [4,38]
           N:  14                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   nog niet van toepassing
           2   speciaal vervolgonderwijs
           3   lager beroepsonderwijs
           4   middelbaar beroepsonderwijs
           5   VMBO
           6   brugklas (anders dan beroepsonderwijs)
           7   brugklas MAVO/HAVO
           8   brugklas HAVO/VWO
           9   MAVO
          10   HAVO
          11   VWO-gymnasium

   variables:  hschv12_v3


. replace delay_v = 0 if hschv12_v3>= 3 & hschv12_v3<=11                                                          // SVO not included
(1359 real changes made)

. replace delay_v = 1 if hschv12_v3>= 6 & hschv12_v3<= 8                                                          // brugklas (anders dan be
> roepsonderwijs); MAVO/HAVO; HAVO/VWO
(756 real changes made)

. 
. labelbook hschv12_1n // hschv12_2n is still missing in the data                                                                           
>                                               

--------------------------------------------------------------------------------------------------------------------------------------------
value label hschv12_1n 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-3,9]                    string length:  [3,33]
           N:  12                unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -3   inconsistent
          -2   unclear - double marked
          -1   missing
           1   SVO
           2   PRO
           3   VMBO theretische leerweg
           4   VMBO gemengde leerweg
           5   VMBO kaderberoepsgerichte leerweg
           6   VMBO basisberoepsgerichte leerweg
           7   HAVO
           8   VWO
           9   Gymnasium

   variables:  hschv12_1n


. replace delay_v = 0 if hschv12_1n>= 2 & hschv12_1n<=9                                                           // SVO not included
(355 real changes made)

. *replace delay_v = 1 if hschv12_2n>= 2 & hschv12_2n<=9 & hschv12_1n>= 2                         // See earlier check that hschm12_2n/_3n a
> re missing if _1n missing
.   
. codebook delay_v

--------------------------------------------------------------------------------------------------------------------------------------------
delay_v                                                                                                                          (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  15011/18858

            tabulation:  Freq.  Value
                          2726  0
                          1121  1
                         15011  .

. tab delay_v

    delay_v |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,726       70.86       70.86
          1 |      1,121       29.14      100.00
------------+-----------------------------------
      Total |      3,847      100.00

. 
. gen delay = delay_m
(11201 missing values generated)

. replace delay = delay_v if delay_m==.
(329 real changes made)

. replace delay = .b if edu12==.b
(95 real changes made, 95 to missing)

. replace delay = .c if edu12==.c
(5639 real changes made, 5639 to missing)

. tab delay

      delay |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,248       78.25       78.25
          1 |      1,737       21.75      100.00
------------+-----------------------------------
      Total |      7,985      100.00

. codebook delay

--------------------------------------------------------------------------------------------------------------------------------------------
delay                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  5139/18858
       unique mv codes:  3                       missing .*:  5734/18858

            tabulation:  Freq.  Value
                          6248  0
                          1737  1
                          5139  .
                            95  .b
                          5639  .c

. 
. 
. //      STEP 3 ==========================================================================================================
. //      Achievement level dummies
. 
. * Based on cito-scores (see stcrt-2014-36955.pdf)
. recode cito_final (500/523 = 1 "VMBO Basis")                                            ///
>                                   (524/528 = 2 "VMBO Kader")                                            ///
>                                   (529/536 = 3 "VMBO Theoretisch & Gemengd")            ///
>                                   (537/544 = 4 "HAVO")                                                          ///
>                                   (545/550 = 5 "VWO"), gen(achie5)
(15028 differences between cito_final and achie5)

. tab achie5, gen(achie5_)

      RECODE of cito_final |
        (final citoscore.) |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
                VMBO Basis |      1,027        6.83        6.83
                VMBO Kader |      1,180        7.85       14.69
VMBO Theoretisch & Gemengd |      3,429       22.82       37.50
                      HAVO |      5,535       36.83       74.33
                       VWO |      3,857       25.67      100.00
---------------------------+-----------------------------------
                     Total |     15,028      100.00

. tab achie5_1    

achie5==VMB |
    O Basis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,001       93.17       93.17
          1 |      1,027        6.83      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie5_2    

achie5==VMB |
    O Kader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,848       92.15       92.15
          1 |      1,180        7.85      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie5_3    

achie5==VMB |
          O |
Theoretisch |
  & Gemengd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,599       77.18       77.18
          1 |      3,429       22.82      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie5_4    

achie5==HAV |
          O |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,493       63.17       63.17
          1 |      5,535       36.83      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie5_5

achie5==VWO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,171       74.33       74.33
          1 |      3,857       25.67      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. 
. 
. * Based on cito-scores extended (see, e.g., stcrt-2016-10096.pdf)
. recode cito_final (500/518 = 1 "VMBO Basis")                                            ///
>                                   (519/525 = 2 "VMBO Basis / Kader")                            ///
>                                   (526/528 = 3 "VMBO Kader")                                            ///
>                                   (529/532 = 4 "VMBO Theoretisch & Gemengd")            ///
>                                   (533/536 = 5 "VMBO Theoretisch & Gemengd / HAVO") ///
>                                   (537/539 = 6 "HAVO")                                                          ///
>                                   (540/544 = 7 "HAVO / VWO")                                            ///
>                                   (545/550 = 8 "VWO"), gen(achie8)
(15028 differences between cito_final and achie8)

. tab achie8, gen(achie8_)

      RECODE of cito_final (final |
                      citoscore.) |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                       VMBO Basis |        414        2.75        2.75
               VMBO Basis / Kader |        971        6.46        9.22
                       VMBO Kader |        822        5.47       14.69
       VMBO Theoretisch & Gemengd |      1,411        9.39       24.08
VMBO Theoretisch & Gemengd / HAVO |      2,018       13.43       37.50
                             HAVO |      1,987       13.22       50.73
                       HAVO / VWO |      3,548       23.61       74.33
                              VWO |      3,857       25.67      100.00
----------------------------------+-----------------------------------
                            Total |     15,028      100.00

. tab achie8_1    

achie8==VMB |
    O Basis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,614       97.25       97.25
          1 |        414        2.75      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_2    

achie8==VMB |
  O Basis / |
      Kader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,057       93.54       93.54
          1 |        971        6.46      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_3    

achie8==VMB |
    O Kader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,206       94.53       94.53
          1 |        822        5.47      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_4    

achie8==VMB |
          O |
Theoretisch |
  & Gemengd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,617       90.61       90.61
          1 |      1,411        9.39      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_5

achie8==VMB |
          O |
Theoretisch |
& Gemengd / |
       HAVO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,010       86.57       86.57
          1 |      2,018       13.43      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_6

achie8==HAV |
          O |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,041       86.78       86.78
          1 |      1,987       13.22      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_7

achie8==HAV |
    O / VWO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,480       76.39       76.39
          1 |      3,548       23.61      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie8_8

achie8==VWO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,171       74.33       74.33
          1 |      3,857       25.67      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. 
. *       Based on cito-scores extended (in-between form)
. recode cito_final (500/528 = 1 "VMBO Basis + Kader")                            ///
>                                   (529/532 = 2 "VMBO Theoretisch & Gemengd")            ///
>                                   (533/536 = 3 "VMBO Theoretisch & Gemengd / HAVO") ///
>                                   (537/539 = 4 "HAVO")                                                          ///
>                                   (540/544 = 5 "HAVO / VWO")                                            ///
>                                   (545/550 = 6 "VWO"), gen(achie6)
(15028 differences between cito_final and achie6)

. tab achie6, gen(achie6_)

      RECODE of cito_final (final |
                      citoscore.) |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
               VMBO Basis + Kader |      2,207       14.69       14.69
       VMBO Theoretisch & Gemengd |      1,411        9.39       24.08
VMBO Theoretisch & Gemengd / HAVO |      2,018       13.43       37.50
                             HAVO |      1,987       13.22       50.73
                       HAVO / VWO |      3,548       23.61       74.33
                              VWO |      3,857       25.67      100.00
----------------------------------+-----------------------------------
                            Total |     15,028      100.00

. tab achie6_1    

achie6==VMB |
  O Basis + |
      Kader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,821       85.31       85.31
          1 |      2,207       14.69      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie6_2    

achie6==VMB |
          O |
Theoretisch |
  & Gemengd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,617       90.61       90.61
          1 |      1,411        9.39      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie6_3    

achie6==VMB |
          O |
Theoretisch |
& Gemengd / |
       HAVO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,010       86.57       86.57
          1 |      2,018       13.43      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie6_4    

achie6==HAV |
          O |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,041       86.78       86.78
          1 |      1,987       13.22      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie6_5

achie6==HAV |
    O / VWO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,480       76.39       76.39
          1 |      3,548       23.61      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie6_6

achie6==VWO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,171       74.33       74.33
          1 |      3,857       25.67      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. 
. * Based on cito-scores collapsed
. recode cito_final (500/528 = 1 "VMBO Basis + Kader")                            ///
>                                   (529/536 = 2 "VMBO Theoretisch & Gemengd")            ///
>                                   (537/544 = 3 "HAVO")                                                          ///
>                                   (545/550 = 4 "VWO"), gen(achie4)
(15028 differences between cito_final and achie4)

. tab achie4, gen(achie4_)

      RECODE of cito_final |
        (final citoscore.) |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
        VMBO Basis + Kader |      2,207       14.69       14.69
VMBO Theoretisch & Gemengd |      3,429       22.82       37.50
                      HAVO |      5,535       36.83       74.33
                       VWO |      3,857       25.67      100.00
---------------------------+-----------------------------------
                     Total |     15,028      100.00

. tab achie4_1    

achie4==VMB |
  O Basis + |
      Kader |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,821       85.31       85.31
          1 |      2,207       14.69      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie4_2    

achie4==VMB |
          O |
Theoretisch |
  & Gemengd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,599       77.18       77.18
          1 |      3,429       22.82      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie4_3    

achie4==HAV |
          O |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,493       63.17       63.17
          1 |      5,535       36.83      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. tab achie4_4    

achie4==VWO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,171       74.33       74.33
          1 |      3,857       25.67      100.00
------------+-----------------------------------
      Total |     15,028      100.00

. 
. 
. //      STEP 4 ==========================================================================================================
. //      Educational attainment parents
. 
. **      Age 7 - education mother
. tab oplm7 oplmoe7, mis  // missing oplm also have missing on oplmoe

   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene |                        educational level mother age 7
           opleiding? |        -1  lager ond  lager ber  middelbar  hoger ber  wetenscha          . |     Total
----------------------+-----------------------------------------------------------------------------+----------
                   -1 |       123          0          0          0          0          0          0 |       123 
lagere school, basiss |         0         34          0          0          0          0          0 |        34 
    enkele jaren mulo |         0        211          0          0          0          0          0 |       211 
einddiploma mulo, mav |         0          0      1,522          0          0          0          0 |     1,522 
     enkele jaren lts |         0        285          0          0          0          0          0 |       285 
             eind lts |         0          0      1,497          0          0          0          0 |     1,497 
enkele jaren havo/vwo |         0          0        233          0          0          0          0 |       233 
 einddiploma havo/vwo |         0          0          0      1,168          0          0          0 |     1,168 
     enkele jaren mbo |         0          0        464          0          0          0          0 |       464 
      einddiploma mbo |         0          0          0      3,545          0          0          0 |     3,545 
enkele jaren hbo of u |         0          0          0        430          0          0          0 |       430 
      einddiploma hbo |         0          0          0          0      2,363          0          0 |     2,363 
einddiploma universit |         0          0          0          0          0        717          0 |       717 
       post doctoraal |         0          0          0          0          0        138          0 |       138 
                    . |         0          0          0          0          0          0      6,128 |     6,128 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       123        530      3,716      5,143      2,363        855      6,128 |    18,858 


. fre oplm7 oplmoe7               // use oplm (more categories and slightly more valid cases

oplm7 -- werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        123       0.65       0.97       0.97
        1  lagere school, basisschool       |         34       0.18       0.27       1.23
        2  enkele jaren mulo                |        211       1.12       1.66       2.89
        3  einddiploma mulo, mavo           |       1522       8.07      11.96      14.85
        4  enkele jaren lts                 |        285       1.51       2.24      17.09
        5  eind lts                         |       1497       7.94      11.76      28.85
        6  enkele jaren havo/vwo            |        233       1.24       1.83      30.68
        7  einddiploma havo/vwo             |       1168       6.19       9.18      39.85
        8  enkele jaren mbo                 |        464       2.46       3.64      43.50
        9  einddiploma mbo                  |       3545      18.80      27.85      71.34
        10 enkele jaren hbo of unviersiteit |        430       2.28       3.38      74.72
        11 einddiploma hbo                  |       2363      12.53      18.56      93.28
        12 einddiploma universiteit         |        717       3.80       5.63      98.92
        13 post doctoraal                   |        138       0.73       1.08     100.00
        Total                               |      12730      67.50     100.00           
Missing .                                   |       6128      32.50                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

oplmoe7 -- educational level mother age 7
-----------------------------------------------------------------------------------------------------
                                                        |      Freq.    Percent      Valid       Cum.
--------------------------------------------------------+--------------------------------------------
Valid   -1                                              |        123       0.65       0.97       0.97
        1  lager onderwijs                              |        530       2.81       4.16       5.13
        2  lager beroepsonderwijs, middelbaar algemeen  |       3716      19.71      29.19      34.32
           onderwjs                                     |                                            
        3  middelbar beroepsonderwijs (mbo), voortgezet |       5143      27.27      40.40      74.72
           algemmen onderwijs (HAVO,vwo)                |                                            
        4  hoger beroepsonderwijs (HBO)                 |       2363      12.53      18.56      93.28
        5  wetenschappelijk onderwijs                   |        855       4.53       6.72     100.00
        Total                                           |      12730      67.50     100.00           
Missing .                                               |       6128      32.50                      
Total                                                   |      18858     100.00                      
-----------------------------------------------------------------------------------------------------

. 
. tab invjrm12 if oplm7  <.                       // 2002-2018

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1998 |         22        0.20        0.20
                   1999 |        525        4.79        4.99
                   2000 |        545        4.97        9.96
                   2001 |        609        5.55       15.51
                   2002 |        821        7.49       23.00
                   2003 |        586        5.34       28.34
                   2004 |      1,293       11.79       40.13
                   2005 |      1,021        9.31       49.44
                   2006 |        791        7.21       56.66
                   2007 |        724        6.60       63.26
                   2008 |        973        8.87       72.13
                   2009 |        823        7.51       79.64
                   2010 |        903        8.23       87.87
                   2011 |        734        6.69       94.57
                   2012 |        590        5.38       99.95
                   2013 |          6        0.05      100.00
------------------------+-----------------------------------
                  Total |     10,966      100.00

. tab yob          if oplm7  <.                   // 1991-2006

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |         95        0.75        0.75
       1987 |        535        4.20        4.95
       1988 |        572        4.49        9.44
       1989 |        650        5.11       14.55
       1990 |        947        7.44       21.99
       1991 |      1,232        9.68       31.67
       1992 |      1,281       10.06       41.73
       1993 |      1,275       10.02       51.74
       1994 |      1,090        8.56       60.31
       1995 |      1,050        8.25       68.55
       1996 |      1,062        8.34       76.90
       1997 |        953        7.49       84.38
       1998 |        825        6.48       90.86
       1999 |        836        6.57       97.43
       2000 |        327        2.57      100.00
------------+-----------------------------------
      Total |     12,730      100.00

. fre oplm7                                                       // 13 categories

oplm7 -- werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        123       0.65       0.97       0.97
        1  lagere school, basisschool       |         34       0.18       0.27       1.23
        2  enkele jaren mulo                |        211       1.12       1.66       2.89
        3  einddiploma mulo, mavo           |       1522       8.07      11.96      14.85
        4  enkele jaren lts                 |        285       1.51       2.24      17.09
        5  eind lts                         |       1497       7.94      11.76      28.85
        6  enkele jaren havo/vwo            |        233       1.24       1.83      30.68
        7  einddiploma havo/vwo             |       1168       6.19       9.18      39.85
        8  enkele jaren mbo                 |        464       2.46       3.64      43.50
        9  einddiploma mbo                  |       3545      18.80      27.85      71.34
        10 enkele jaren hbo of unviersiteit |        430       2.28       3.38      74.72
        11 einddiploma hbo                  |       2363      12.53      18.56      93.28
        12 einddiploma universiteit         |        717       3.80       5.63      98.92
        13 post doctoraal                   |        138       0.73       1.08     100.00
        Total                               |      12730      67.50     100.00           
Missing .                                   |       6128      32.50                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

. 
. **      Age 10 - education mother
. tab oplm10 oplmoe10, mis  // missing oplm also have missing on oplmoe

   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene |
   opleiding?, MOEDER |                       educational level mother age 10
              LIJST9- |        -1  lager ond  lager ber  middelbar  hoger ber  wetenscha          . |     Total
----------------------+-----------------------------------------------------------------------------+----------
                   -1 |       141          0          0          0          0          0          0 |       141 
lagere school, basiss |         0         38          0          0          0          0          0 |        38 
    enkele jaren mulo |         0        213          0          0          0          0          0 |       213 
einddiploma mulo, mav |         0          0      1,441          0          0          0          0 |     1,441 
     enkele jaren lts |         0        262          0          0          0          0          0 |       262 
             eind lts |         0          0      1,323          0          0          0          0 |     1,323 
enkele jaren havo/vwo |         0          0        208          0          0          0          0 |       208 
 einddiploma havo/vwo |         0          0          0      1,084          0          0          0 |     1,084 
     enkele jaren mbo |         0          0        383          0          0          0          0 |       383 
      einddiploma mbo |         0          0          0      3,294          0          0          2 |     3,296 
enkele jaren hbo of u |         0          0          0        415          0          0          0 |       415 
      einddiploma hbo |         0          0          0          0      2,198          0          0 |     2,198 
einddiploma universit |         0          0          0          0          0        767          0 |       767 
       post doctoraal |         0          0          0          0          0        140          0 |       140 
                    . |         0          0          0          0          0          0      6,949 |     6,949 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       141        513      3,355      4,793      2,198        907      6,951 |    18,858 


. fre oplm10 oplmoe10               // use oplm (more categories and slightly more valid cases

oplm10 -- werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?, MOEDER LIJST9-
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        141       0.75       1.18       1.18
        1  lagere school, basisschool       |         38       0.20       0.32       1.50
        2  enkele jaren mulo                |        213       1.13       1.79       3.29
        3  einddiploma mulo, mavo           |       1441       7.64      12.10      15.39
        4  enkele jaren lts                 |        262       1.39       2.20      17.59
        5  eind lts                         |       1323       7.02      11.11      28.70
        6  enkele jaren havo/vwo            |        208       1.10       1.75      30.45
        7  einddiploma havo/vwo             |       1084       5.75       9.10      39.55
        8  enkele jaren mbo                 |        383       2.03       3.22      42.77
        9  einddiploma mbo                  |       3296      17.48      27.68      70.44
        10 enkele jaren hbo of unviersiteit |        415       2.20       3.48      73.93
        11 einddiploma hbo                  |       2198      11.66      18.46      92.38
        12 einddiploma universiteit         |        767       4.07       6.44      98.82
        13 post doctoraal                   |        140       0.74       1.18     100.00
        Total                               |      11909      63.15     100.00           
Missing .                                   |       6949      36.85                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

oplmoe10 -- educational level mother age 10
-----------------------------------------------------------------------------------------------------
                                                        |      Freq.    Percent      Valid       Cum.
--------------------------------------------------------+--------------------------------------------
Valid   -1                                              |        141       0.75       1.18       1.18
        1  lager onderwijs                              |        513       2.72       4.31       5.49
        2  lager beroepsonderwijs, middelbaar algemeen  |       3355      17.79      28.18      33.67
           onderwjs                                     |                                            
        3  middelbar beroepsonderwijs (mbo), voortgezet |       4793      25.42      40.25      73.92
           algemmen onderwijs (HAVO,vwo)                |                                            
        4  hoger beroepsonderwijs (HBO)                 |       2198      11.66      18.46      92.38
        5  wetenschappelijk onderwijs                   |        907       4.81       7.62     100.00
        Total                                           |      11907      63.14     100.00           
Missing .                                               |       6951      36.86                      
Total                                                   |      18858     100.00                      
-----------------------------------------------------------------------------------------------------

. 
. tab invjrm12 if oplm10  <.                      // 2002-2018

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1998 |         26        0.25        0.25
                   1999 |        561        5.33        5.58
                   2000 |        560        5.32       10.90
                   2001 |        615        5.84       16.74
                   2002 |        838        7.96       24.70
                   2003 |        596        5.66       30.37
                   2004 |      1,283       12.19       42.56
                   2005 |        991        9.42       51.97
                   2006 |        745        7.08       59.05
                   2007 |        681        6.47       65.52
                   2008 |        747        7.10       72.62
                   2009 |        763        7.25       79.87
                   2010 |        134        1.27       81.14
                   2011 |         12        0.11       81.25
                   2012 |        694        6.59       87.85
                   2013 |        611        5.81       93.65
                   2014 |        594        5.64       99.30
                   2015 |         74        0.70      100.00
------------------------+-----------------------------------
                  Total |     10,525      100.00

. tab yob          if oplm10  <.                  // 1991-2006

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |        111        0.93        0.93
       1987 |        562        4.72        5.65
       1988 |        592        4.97       10.62
       1989 |        639        5.37       15.99
       1990 |        947        7.95       23.94
       1991 |      1,237       10.39       34.33
       1992 |      1,186        9.96       44.29
       1993 |      1,219       10.24       54.52
       1994 |        986        8.28       62.80
       1995 |        865        7.26       70.06
       1996 |        815        6.84       76.91
       1997 |        744        6.25       83.16
       1998 |          2        0.02       83.17
       1999 |        216        1.81       84.99
       2000 |        662        5.56       90.54
       2001 |        628        5.27       95.82
       2002 |        498        4.18      100.00
------------+-----------------------------------
      Total |     11,909      100.00

. fre oplm10

oplm10 -- werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?, MOEDER LIJST9-
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        141       0.75       1.18       1.18
        1  lagere school, basisschool       |         38       0.20       0.32       1.50
        2  enkele jaren mulo                |        213       1.13       1.79       3.29
        3  einddiploma mulo, mavo           |       1441       7.64      12.10      15.39
        4  enkele jaren lts                 |        262       1.39       2.20      17.59
        5  eind lts                         |       1323       7.02      11.11      28.70
        6  enkele jaren havo/vwo            |        208       1.10       1.75      30.45
        7  einddiploma havo/vwo             |       1084       5.75       9.10      39.55
        8  enkele jaren mbo                 |        383       2.03       3.22      42.77
        9  einddiploma mbo                  |       3296      17.48      27.68      70.44
        10 enkele jaren hbo of unviersiteit |        415       2.20       3.48      73.93
        11 einddiploma hbo                  |       2198      11.66      18.46      92.38
        12 einddiploma universiteit         |        767       4.07       6.44      98.82
        13 post doctoraal                   |        140       0.74       1.18     100.00
        Total                               |      11909      63.15     100.00           
Missing .                                   |       6949      36.85                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

. 
. tab oplm7 oplm10, mis

   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene |          werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?, MOEDER LIJST9-
           opleiding? |        -1  lagere sc  enkele ja  einddiplo  enkele ja   eind lts  enkele ja  einddiplo  enkele ja |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                   -1 |         5          0          4          6          2         12          6          4          0 |       123 
lagere school, basiss |         0         11          0          0          8          2          0          0          0 |        34 
    enkele jaren mulo |         6          2        131         18          4          6          2          0          6 |       211 
einddiploma mulo, mav |        10          0         26        965          5         22         27          4         30 |     1,522 
     enkele jaren lts |         5          6         12         12        116         52          0          0          4 |       285 
             eind lts |        18          9         10         34         74        912          2          2         39 |     1,497 
enkele jaren havo/vwo |         2          0          0         30          0          8         89         17          4 |       233 
 einddiploma havo/vwo |         4          0          0          6          0          0         16        744          2 |     1,168 
     enkele jaren mbo |         4          0          4         39          5         34          1         14        139 |       464 
      einddiploma mbo |        32          0          2        116          4         75         10         71         81 |     3,545 
enkele jaren hbo of u |         0          2          0          2          0          0          2         26          2 |       430 
      einddiploma hbo |         4          0          0          0          0          0          2         19          4 |     2,363 
einddiploma universit |         0          0          0          4          0          0          0          1          0 |       717 
       post doctoraal |         0          0          0          0          0          0          0          0          0 |       138 
                    . |        51          8         24        209         44        200         51        182         72 |     6,128 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |       141         38        213      1,441        262      1,323        208      1,084        383 |    18,858 


   werk en opleiding: |
     wat is uw hoogst | werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?,
    gevolgde algemene |                          MOEDER LIJST9-
           opleiding? | einddiplo  enkele ja  einddiplo  einddiplo  post doct          . |     Total
----------------------+------------------------------------------------------------------+----------
                   -1 |        23          2          6          2          0         51 |       123 
lagere school, basiss |         0          2          0          0          0         11 |        34 
    enkele jaren mulo |         4          0          0          0          0         32 |       211 
einddiploma mulo, mav |       122          6          4          0          0        301 |     1,522 
     enkele jaren lts |         7          0          0          0          0         71 |       285 
             eind lts |        95          2          4          0          0        296 |     1,497 
enkele jaren havo/vwo |        14          6          6          0          0         57 |       233 
 einddiploma havo/vwo |        58         28         19          2          0        289 |     1,168 
     enkele jaren mbo |        96          2          0          2          0        124 |       464 
      einddiploma mbo |     2,077         43         51          6          0        977 |     3,545 
enkele jaren hbo of u |        24        195         38          4          0        135 |       430 
      einddiploma hbo |        86         29      1,527         67          0        625 |     2,363 
einddiploma universit |         2          2         53        424         22        209 |       717 
       post doctoraal |         0          0          0         18         70         50 |       138 
                    . |       688         98        490        242         48      3,721 |     6,128 
----------------------+------------------------------------------------------------------+----------
                Total |     3,296        415      2,198        767        140      6,949 |    18,858 


. * 11,523 missings on oplm7  of which 3356 have a valid answer on oplm10
. * 12,799 missings on oplm10 of which 4632 have a valid answer on oplm7
. 
. **      Age 7 - education father        
. tab oplv7 oplvad7, mis  // missing oplv also have missing on oplvad

   werk en opleiding, |
     wat is uw hoogst |
    gevolgde algemene |                        educational level father age 7
           opleiding? |        -1  lager ond  lager ber  middelbar  hoger ber  wetenscha          . |     Total
----------------------+-----------------------------------------------------------------------------+----------
                   -1 |       360          0          0          0          0          0          0 |       360 
lagere school, basiss |         0         98          0          0          0          0          0 |        98 
    enkele jaren mulo |         0        138          0          0          0          0          0 |       138 
einddiploma mulo, mav |         0          0        643          0          0          0          0 |       643 
     enkele jaren lts |         0        462          0          0          0          0          0 |       462 
             eind lts |         0          0      1,967          0          0          0          0 |     1,967 
enkele jaren havo/vwo |         0          0        157          0          0          0          0 |       157 
 einddiploma havo/vwo |         0          0          0        634          0          0          0 |       634 
     enkele jaren mbo |         0          0        568          0          0          0          0 |       568 
      einddiploma mbo |         0          0          0      2,904          0          0          0 |     2,904 
enkele jaren hbo of u |         0          0          0        655          0          0          0 |       655 
      einddiploma hbo |         0          0          0          0      2,384          0          0 |     2,384 
einddiploma universit |         0          0          0          0          0      1,376          0 |     1,376 
       post doctoraal |         0          0          0          0          0        384          0 |       384 
                    . |         0          0          0          0          0          0      6,128 |     6,128 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       360        698      3,335      4,193      2,384      1,760      6,128 |    18,858 


. fre oplv7 oplvad7               // use oplv (more categories and slightly more valid cases

oplv7 -- werk en opleiding, wat is uw hoogst gevolgde algemene opleiding?
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        360       1.91       2.83       2.83
        1  lagere school, basisschool       |         98       0.52       0.77       3.60
        2  enkele jaren mulo                |        138       0.73       1.08       4.68
        3  einddiploma mulo, mavo           |        643       3.41       5.05       9.73
        4  enkele jaren lts                 |        462       2.45       3.63      13.36
        5  eind lts                         |       1967      10.43      15.45      28.81
        6  enkele jaren havo/vwo            |        157       0.83       1.23      30.05
        7  einddiploma havo/vwo             |        634       3.36       4.98      35.03
        8  enkele jaren mbo                 |        568       3.01       4.46      39.49
        9  einddiploma mbo                  |       2904      15.40      22.81      62.30
        10 enkele jaren hbo of unviersiteit |        655       3.47       5.15      67.45
        11 einddiploma hbo                  |       2384      12.64      18.73      86.17
        12 einddiploma universiteit         |       1376       7.30      10.81      96.98
        13 post doctoraal                   |        384       2.04       3.02     100.00
        Total                               |      12730      67.50     100.00           
Missing .                                   |       6128      32.50                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

oplvad7 -- educational level father age 7
-----------------------------------------------------------------------------------------------------
                                                        |      Freq.    Percent      Valid       Cum.
--------------------------------------------------------+--------------------------------------------
Valid   -1                                              |        360       1.91       2.83       2.83
        1  lager onderwijs                              |        698       3.70       5.48       8.31
        2  lager beroepsonderwijs, middelbaar algemeen  |       3335      17.68      26.20      34.51
           onderwjs                                     |                                            
        3  middelbar beroepsonderwijs (mbo), voortgezet |       4193      22.23      32.94      67.45
           algemmen onderwijs (HAVO,vwo)                |                                            
        4  hoger beroepsonderwijs (HBO)                 |       2384      12.64      18.73      86.17
        5  wetenschappelijk onderwijs                   |       1760       9.33      13.83     100.00
        Total                                           |      12730      67.50     100.00           
Missing .                                               |       6128      32.50                      
Total                                                   |      18858     100.00                      
-----------------------------------------------------------------------------------------------------

. 
. tab invjrm12 if oplv7  <.                       // 2002-2018

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1998 |         22        0.20        0.20
                   1999 |        525        4.79        4.99
                   2000 |        545        4.97        9.96
                   2001 |        609        5.55       15.51
                   2002 |        821        7.49       23.00
                   2003 |        586        5.34       28.34
                   2004 |      1,293       11.79       40.13
                   2005 |      1,021        9.31       49.44
                   2006 |        791        7.21       56.66
                   2007 |        724        6.60       63.26
                   2008 |        973        8.87       72.13
                   2009 |        823        7.51       79.64
                   2010 |        903        8.23       87.87
                   2011 |        734        6.69       94.57
                   2012 |        590        5.38       99.95
                   2013 |          6        0.05      100.00
------------------------+-----------------------------------
                  Total |     10,966      100.00

. tab yob          if oplv7  <.                   // 1991-2006

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |         95        0.75        0.75
       1987 |        535        4.20        4.95
       1988 |        572        4.49        9.44
       1989 |        650        5.11       14.55
       1990 |        947        7.44       21.99
       1991 |      1,232        9.68       31.67
       1992 |      1,281       10.06       41.73
       1993 |      1,275       10.02       51.74
       1994 |      1,090        8.56       60.31
       1995 |      1,050        8.25       68.55
       1996 |      1,062        8.34       76.90
       1997 |        953        7.49       84.38
       1998 |        825        6.48       90.86
       1999 |        836        6.57       97.43
       2000 |        327        2.57      100.00
------------+-----------------------------------
      Total |     12,730      100.00

. fre oplv7                                                       // 13 categories

oplv7 -- werk en opleiding, wat is uw hoogst gevolgde algemene opleiding?
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        360       1.91       2.83       2.83
        1  lagere school, basisschool       |         98       0.52       0.77       3.60
        2  enkele jaren mulo                |        138       0.73       1.08       4.68
        3  einddiploma mulo, mavo           |        643       3.41       5.05       9.73
        4  enkele jaren lts                 |        462       2.45       3.63      13.36
        5  eind lts                         |       1967      10.43      15.45      28.81
        6  enkele jaren havo/vwo            |        157       0.83       1.23      30.05
        7  einddiploma havo/vwo             |        634       3.36       4.98      35.03
        8  enkele jaren mbo                 |        568       3.01       4.46      39.49
        9  einddiploma mbo                  |       2904      15.40      22.81      62.30
        10 enkele jaren hbo of unviersiteit |        655       3.47       5.15      67.45
        11 einddiploma hbo                  |       2384      12.64      18.73      86.17
        12 einddiploma universiteit         |       1376       7.30      10.81      96.98
        13 post doctoraal                   |        384       2.04       3.02     100.00
        Total                               |      12730      67.50     100.00           
Missing .                                   |       6128      32.50                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

. 
. **      Age 10 - education father
. tab oplv10 oplvad10, mis  // missing oplv also have missing on oplvad

   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene |
     opleiding? VADER |                       educational level father age 10
            LIJST9-10 |        -1  lager ond  lager ber  middelbar  hoger ber  wetenscha          . |     Total
----------------------+-----------------------------------------------------------------------------+----------
                   -1 |       578          0          0          0          0          0          0 |       578 
lagere school, basiss |         0        105          0          0          0          0          0 |       105 
    enkele jaren mulo |         0        130          0          0          0          0          0 |       130 
einddiploma mulo, mav |         0          0        598          0          0          0          0 |       598 
     enkele jaren lts |         0        401          0          0          0          0          0 |       401 
             eind lts |         0          0      1,851          0          0          0          0 |     1,851 
enkele jaren havo/vwo |         0          0        144          0          0          0          0 |       144 
 einddiploma havo/vwo |         0          0          0        524          0          0          0 |       524 
     enkele jaren mbo |         0          0        539          0          0          0          0 |       539 
      einddiploma mbo |         0          0          0      2,544          0          0          0 |     2,544 
enkele jaren hbo of u |         0          0          0        609          0          0          0 |       609 
      einddiploma hbo |         0          0          0          0      2,222          0          0 |     2,222 
einddiploma universit |         0          0          0          0          0      1,274          0 |     1,274 
       post doctoraal |         0          0          0          0          0        388          0 |       388 
                    . |         0          0          0          0          0          0      6,951 |     6,951 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       578        636      3,132      3,677      2,222      1,662      6,951 |    18,858 


. fre oplv10 oplvad10               // use oplv (more categories and slightly more valid cases

oplv10 -- werk en opleiding: wat is uw hoogst gevolgde algemene opleiding? VADER LIJST9-10
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        578       3.07       4.85       4.85
        1  lagere school, basisschool       |        105       0.56       0.88       5.74
        2  enkele jaren mulo                |        130       0.69       1.09       6.83
        3  einddiploma mulo, mavo           |        598       3.17       5.02      11.85
        4  enkele jaren lts                 |        401       2.13       3.37      15.22
        5  eind lts                         |       1851       9.82      15.55      30.76
        6  enkele jaren havo/vwo            |        144       0.76       1.21      31.97
        7  einddiploma havo/vwo             |        524       2.78       4.40      36.37
        8  enkele jaren mbo                 |        539       2.86       4.53      40.90
        9  einddiploma mbo                  |       2544      13.49      21.37      62.27
        10 enkele jaren hbo of unviersiteit |        609       3.23       5.11      67.38
        11 einddiploma hbo                  |       2222      11.78      18.66      86.04
        12 einddiploma universiteit         |       1274       6.76      10.70      96.74
        13 post doctoraal                   |        388       2.06       3.26     100.00
        Total                               |      11907      63.14     100.00           
Missing .                                   |       6951      36.86                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

oplvad10 -- educational level father age 10
-----------------------------------------------------------------------------------------------------
                                                        |      Freq.    Percent      Valid       Cum.
--------------------------------------------------------+--------------------------------------------
Valid   -1                                              |        578       3.07       4.85       4.85
        1  lager onderwijs                              |        636       3.37       5.34      10.20
        2  lager beroepsonderwijs, middelbaar algemeen  |       3132      16.61      26.30      36.50
           onderwjs                                     |                                            
        3  middelbar beroepsonderwijs (mbo), voortgezet |       3677      19.50      30.88      67.38
           algemmen onderwijs (HAVO,vwo)                |                                            
        4  hoger beroepsonderwijs (HBO)                 |       2222      11.78      18.66      86.04
        5  wetenschappelijk onderwijs                   |       1662       8.81      13.96     100.00
        Total                                           |      11907      63.14     100.00           
Missing .                                               |       6951      36.86                      
Total                                                   |      18858     100.00                      
-----------------------------------------------------------------------------------------------------

. 
. tab invjrm12 if oplv10  <.                      // 2002-2018

   Pers gegevens - Jaar |
           van invullen |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   1998 |         26        0.25        0.25
                   1999 |        561        5.33        5.58
                   2000 |        560        5.32       10.90
                   2001 |        615        5.84       16.74
                   2002 |        838        7.96       24.71
                   2003 |        596        5.66       30.37
                   2004 |      1,283       12.19       42.56
                   2005 |        991        9.42       51.98
                   2006 |        745        7.08       59.06
                   2007 |        681        6.47       65.53
                   2008 |        747        7.10       72.63
                   2009 |        763        7.25       79.88
                   2010 |        134        1.27       81.16
                   2011 |         12        0.11       81.27
                   2012 |        694        6.60       87.86
                   2013 |        611        5.81       93.67
                   2014 |        592        5.63       99.30
                   2015 |         74        0.70      100.00
------------------------+-----------------------------------
                  Total |     10,523      100.00

. tab yob          if oplv10  <.                  // 1991-2006

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |        111        0.93        0.93
       1987 |        562        4.72        5.65
       1988 |        592        4.97       10.62
       1989 |        639        5.37       15.99
       1990 |        947        7.95       23.94
       1991 |      1,237       10.39       34.33
       1992 |      1,186        9.96       44.29
       1993 |      1,219       10.24       54.53
       1994 |        986        8.28       62.81
       1995 |        865        7.26       70.08
       1996 |        815        6.84       76.92
       1997 |        744        6.25       83.17
       1998 |          2        0.02       83.19
       1999 |        216        1.81       85.00
       2000 |        662        5.56       90.56
       2001 |        628        5.27       95.83
       2002 |        496        4.17      100.00
------------+-----------------------------------
      Total |     11,907      100.00

. fre oplv10

oplv10 -- werk en opleiding: wat is uw hoogst gevolgde algemene opleiding? VADER LIJST9-10
-----------------------------------------------------------------------------------------
                                            |      Freq.    Percent      Valid       Cum.
--------------------------------------------+--------------------------------------------
Valid   -1                                  |        578       3.07       4.85       4.85
        1  lagere school, basisschool       |        105       0.56       0.88       5.74
        2  enkele jaren mulo                |        130       0.69       1.09       6.83
        3  einddiploma mulo, mavo           |        598       3.17       5.02      11.85
        4  enkele jaren lts                 |        401       2.13       3.37      15.22
        5  eind lts                         |       1851       9.82      15.55      30.76
        6  enkele jaren havo/vwo            |        144       0.76       1.21      31.97
        7  einddiploma havo/vwo             |        524       2.78       4.40      36.37
        8  enkele jaren mbo                 |        539       2.86       4.53      40.90
        9  einddiploma mbo                  |       2544      13.49      21.37      62.27
        10 enkele jaren hbo of unviersiteit |        609       3.23       5.11      67.38
        11 einddiploma hbo                  |       2222      11.78      18.66      86.04
        12 einddiploma universiteit         |       1274       6.76      10.70      96.74
        13 post doctoraal                   |        388       2.06       3.26     100.00
        Total                               |      11907      63.14     100.00           
Missing .                                   |       6951      36.86                      
Total                                       |      18858     100.00                      
-----------------------------------------------------------------------------------------

. 
. tab oplv7 oplv10, mis

   werk en opleiding, |
     wat is uw hoogst |
    gevolgde algemene |          werk en opleiding: wat is uw hoogst gevolgde algemene opleiding? VADER LIJST9-10
           opleiding? |        -1  lagere sc  enkele ja  einddiplo  enkele ja   eind lts  enkele ja  einddiplo  enkele ja |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                   -1 |        52          4          6         14          7         53          7         12         10 |       360 
lagere school, basiss |         4         49          2          0         16          6          0          0          0 |        98 
    enkele jaren mulo |         6          6         49         19          8         12          0          0          8 |       138 
einddiploma mulo, mav |        18          0         16        320          8         33         16         10         39 |       643 
     enkele jaren lts |         7          8          8          5        209         65          2          0         24 |       462 
             eind lts |        49          4         18         20         78      1,173          4          0         68 |     1,967 
enkele jaren havo/vwo |         8          2          0         20          2          6         44         10          6 |       157 
 einddiploma havo/vwo |        12          0          0          4          2          0         18        321          9 |       634 
     enkele jaren mbo |        19          2          4         31          3         59         14          6        183 |       568 
      einddiploma mbo |        90          2          9         47          9        120          4         22         97 |     2,904 
enkele jaren hbo of u |        14          0          2          2          0          4          6         43          8 |       655 
      einddiploma hbo |        56          2          0          8          0          6          2         20          4 |     2,384 
einddiploma universit |        22          0          0          4          0          2          0          4          0 |     1,376 
       post doctoraal |         2          2          2          0          0          0          0          0          0 |       384 
                    . |       219         24         14        104         59        312         27         76         83 |     6,128 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |       578        105        130        598        401      1,851        144        524        539 |    18,858 


   werk en opleiding, |
     wat is uw hoogst | werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?
    gevolgde algemene |                          VADER LIJST9-10
           opleiding? | einddiplo  enkele ja  einddiplo  einddiplo  post doct          . |     Total
----------------------+------------------------------------------------------------------+----------
                   -1 |        39          4          8          2          4        138 |       360 
lagere school, basiss |         2          0          2          0          0         17 |        98 
    enkele jaren mulo |         4          3          1          0          0         22 |       138 
einddiploma mulo, mav |        45          6          1          0          0        131 |       643 
     enkele jaren lts |        20          0          0          2          0        112 |       462 
             eind lts |        98          4          2          0          0        449 |     1,967 
enkele jaren havo/vwo |         6          2         10          0          0         41 |       157 
 einddiploma havo/vwo |        24         48         22          2          0        172 |       634 
     enkele jaren mbo |       114          9          0          2          0        122 |       568 
      einddiploma mbo |     1,582         64         47         10          0        801 |     2,904 
enkele jaren hbo of u |        59        279         60         17          0        161 |       655 
      einddiploma hbo |        24         45      1,499        115          0        603 |     2,384 
einddiploma universit |         2         16        112        798         53        363 |     1,376 
       post doctoraal |         0          3          0         57        222         96 |       384 
                    . |       525        126        458        269        109      3,723 |     6,128 
----------------------+------------------------------------------------------------------+----------
                Total |     2,544        609      2,222      1,274        388      6,951 |    18,858 


. * 12,360 missings on oplv7  of which 3505 have a valid answer on oplv10
. * 13,488 missings on oplv10 of which 4633 have a valid answer on oplv7
. 
. *       Education father and mother
. tab oplm7  oplv7,  mis                          // 11,308 missing for both, 1052 and 215 only one parent

   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene |                  werk en opleiding, wat is uw hoogst gevolgde algemene opleiding?
           opleiding? |        -1  lagere sc  enkele ja  einddiplo  enkele ja   eind lts  enkele ja  einddiplo  enkele ja |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                   -1 |        30          0          1          6          2          8          4          8          2 |       123 
lagere school, basiss |         0         10          4          0          2          5          0          4          0 |        34 
    enkele jaren mulo |         8          4         16         12         18         42          3         14         13 |       211 
einddiploma mulo, mav |        50         23         17        134         91        373         22        120         81 |     1,522 
     enkele jaren lts |        12          8         11         16         48         83          2         12         19 |       285 
             eind lts |        63         16         29        104        120        510         32         36         76 |     1,497 
enkele jaren havo/vwo |         6          2          4         24         10         54          8          9         12 |       233 
 einddiploma havo/vwo |        28          6         13         95         30        171         20        114         46 |     1,168 
     enkele jaren mbo |         8          4          4         21         20         73          6         28         61 |       464 
      einddiploma mbo |        85         19         22        155         96        495         28        146        188 |     3,545 
enkele jaren hbo of u |        12          0          4         11          1         26          6         26          8 |       430 
      einddiploma hbo |        54          6          8         53         24        117         26         91         57 |     2,363 
einddiploma universit |         2          0          3         10          0          8          0         22          5 |       717 
       post doctoraal |         2          0          2          2          0          2          0          4          0 |       138 
                    . |         0          0          0          0          0          0          0          0          0 |     6,128 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |       360         98        138        643        462      1,967        157        634        568 |    18,858 


   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene | werk en opleiding, wat is uw hoogst gevolgde algemene opleiding?
           opleiding? | einddiplo  enkele ja  einddiplo  einddiplo  post doct          . |     Total
----------------------+------------------------------------------------------------------+----------
                   -1 |        24         15         11         12          0          0 |       123 
lagere school, basiss |         5          2          2          0          0          0 |        34 
    enkele jaren mulo |        42         13         18          6          2          0 |       211 
einddiploma mulo, mav |       311         63        171         60          6          0 |     1,522 
     enkele jaren lts |        47          2         21          4          0          0 |       285 
             eind lts |       327         43        119         18          4          0 |     1,497 
enkele jaren havo/vwo |        47         12         31         12          2          0 |       233 
 einddiploma havo/vwo |       249         50        217        104         25          0 |     1,168 
     enkele jaren mbo |       118         32         65         20          4          0 |       464 
      einddiploma mbo |     1,202        166        654        244         45          0 |     3,545 
enkele jaren hbo of u |        88         57         94         78         19          0 |       430 
      einddiploma hbo |       387        145        822        459        114          0 |     2,363 
einddiploma universit |        51         51        149        321         95          0 |       717 
       post doctoraal |         6          4         10         38         68          0 |       138 
                    . |         0          0          0          0          0      6,128 |     6,128 
----------------------+------------------------------------------------------------------+----------
                Total |     2,904        655      2,384      1,376        384      6,128 |    18,858 


. tab oplm10 oplv10, mis                          // 12,595 missing for both,  893 and 204 only one parent

   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene |
   opleiding?, MOEDER |          werk en opleiding: wat is uw hoogst gevolgde algemene opleiding? VADER LIJST9-10
              LIJST9- |        -1  lagere sc  enkele ja  einddiplo  enkele ja   eind lts  enkele ja  einddiplo  enkele ja |     Total
----------------------+---------------------------------------------------------------------------------------------------+----------
                   -1 |        26          0          6          4          8         22          0          4          8 |       141 
lagere school, basiss |         2          4          4          4          4          8          0          0          4 |        38 
    enkele jaren mulo |        14          6         10         13         18         59         11          8         12 |       213 
einddiploma mulo, mav |        70         11         32        152         85        365         33        113         60 |     1,441 
     enkele jaren lts |        25         17          8          8         30         74          6          4         12 |       262 
             eind lts |        56         15         20        105         95        483         11         52         68 |     1,323 
enkele jaren havo/vwo |        12          2          6         18         15         46         12         14          4 |       208 
 einddiploma havo/vwo |        32          8         12         94         16        161         26         67         44 |     1,084 
     enkele jaren mbo |        25          6          0         16         16         64          4         20         46 |       383 
      einddiploma mbo |       144         14         19        118         90        451         25        129        177 |     3,296 
enkele jaren hbo of u |        20          4          0          8          2          9          2         21         21 |       415 
      einddiploma hbo |       114         18          7         47         22        101         10         66         68 |     2,198 
einddiploma universit |        30          0          2         11          0          8          4         24         11 |       767 
       post doctoraal |         8          0          4          0          0          0          0          2          4 |       140 
                    . |         0          0          0          0          0          0          0          0          0 |     6,949 
----------------------+---------------------------------------------------------------------------------------------------+----------
                Total |       578        105        130        598        401      1,851        144        524        539 |    18,858 


   werk en opleiding: |
     wat is uw hoogst |
    gevolgde algemene | werk en opleiding: wat is uw hoogst gevolgde algemene opleiding?
   opleiding?, MOEDER |                          VADER LIJST9-10
              LIJST9- | einddiplo  enkele ja  einddiplo  einddiplo  post doct          . |     Total
----------------------+------------------------------------------------------------------+----------
                   -1 |        27          6         16         10          4          0 |       141 
lagere school, basiss |         6          0          0          0          2          0 |        38 
    enkele jaren mulo |        34         10         14          2          2          0 |       213 
einddiploma mulo, mav |       270         44        151         45         10          0 |     1,441 
     enkele jaren lts |        54          6         15          3          0          0 |       262 
             eind lts |       252         39        104         20          3          0 |     1,323 
enkele jaren havo/vwo |        34          9         20         14          2          0 |       208 
 einddiploma havo/vwo |       221         71        204         96         32          0 |     1,084 
     enkele jaren mbo |        78         25         61         20          2          0 |       383 
      einddiploma mbo |     1,062        166        628        230         41          2 |     3,296 
enkele jaren hbo of u |        95         38        101         65         29          0 |       415 
      einddiploma hbo |       361        134        743        401        106          0 |     2,198 
einddiploma universit |        46         55        155        332         89          0 |       767 
       post doctoraal |         4          6         10         36         66          0 |       140 
                    . |         0          0          0          0          0      6,949 |     6,949 
----------------------+------------------------------------------------------------------+----------
                Total |     2,544        609      2,222      1,274        388      6,951 |    18,858 


. 
. 
. sum oplm7 oplv7 oplm10 oplv10 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       oplm7 |     12730    7.808798    3.049808         -1         13
       oplv7 |     12730     8.16685    3.311701         -1         13
      oplm10 |     11909    7.828113    3.109646         -1         13
      oplv10 |     11907    7.982195    3.559225         -1         13

. corr oplm7 oplv7 oplm10 oplv10 
(obs=9502)

             |    oplm7    oplv7   oplm10   oplv10
-------------+------------------------------------
       oplm7 |   1.0000
       oplv7 |   0.4009   1.0000
      oplm10 |   0.8230   0.3931   1.0000
      oplv10 |   0.3577   0.7223   0.3908   1.0000


. * use age 10, if missing age 7 (correlate highly over time) 
. 
. gen oplm = oplm10
(6949 missing values generated)

.         replace oplm = oplm7 if oplm10 ==.
(3228 real changes made)

. gen oplv = oplv10
(6951 missing values generated)

.         replace oplv = oplv7 if oplv10 ==.
(3228 real changes made)

. 
. *       Parental education (highest in family)
. gen eduparents = oplv
(3723 missing values generated)

.         replace eduparents = oplm if oplv<oplm & oplm!=.
(4853 real changes made)

. replace eduparents =.a if eduparents == -1
(40 real changes made, 40 to missing)

. 
. recode eduparents (1/5 = 1 "Primary/lower secondary: basis, mulo, mavo, lts") ///
>                                   (6/9 = 2 "Upper secondary: havo, vwo, mbo") ///
>                                   (10/11=3 "Tertiary: hbo, few years hbo/uni") ///
>                                   (12/13=4 "Tertiary: uni, postdoctoral"), gen(edup4c)
(15085 differences between eduparents and edup4c)

. tab edup4c

                   RECODE of eduparents |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
Primary/lower secondary: basis, mulo, m |      2,200       14.57       14.57
        Upper secondary: havo, vwo, mbo |      5,683       37.65       52.22
       Tertiary: hbo, few years hbo/uni |      4,596       30.45       82.67
            Tertiary: uni, postdoctoral |      2,616       17.33      100.00
----------------------------------------+-----------------------------------
                                  Total |     15,095      100.00

. 
. 
. //      STEP 5 ==========================================================================================================
. //      Generate several IDs
. 
. sort FamilyNumber Extension

. 
. *       Generate a dummy indicating whether a twin pair is MZ (1) or DZ (0)
. gen mz = 1 if (twzyg==1 | twzyg==3)
(12449 missing values generated)

. replace mz = 0 if (twzyg==2 | twzyg==4 | twzyg==5 | twzyg==6)
(11237 real changes made)

. tab mz

         mz |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,237       63.68       63.68
          1 |      6,409       36.32      100.00
------------+-----------------------------------
      Total |     17,646      100.00

. 
. *       Give "sex" a more informative name
. tab sex

                           sex |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
known or suspected transgender |          4        0.02        0.02
                          male |      9,142       48.48       48.50
                        female |      9,711       51.50      100.00
-------------------------------+-----------------------------------
                         Total |     18,857      100.00

. labelbook sex                           // males coded as 1; females as 2

--------------------------------------------------------------------------------------------------------------------------------------------
value label sex 
--------------------------------------------------------------------------------------------------------------------------------------------

      values                                    labels
       range:  [-9,2]                    string length:  [4,30]
           N:  5                 unique at full length:  yes
        gaps:  yes                 unique at length 12:  yes
  missing .*:  0                           null string:  no
                               leading/trailing blanks:  no
                                    numeric -> numeric:  no
  definition
          -9   known or suspected transgender
          -2   missing, inconsistent data
          -1   missing, no data
           1   male
           2   female

   variables:  sex


. gen male = .                            // give missing value to 4 people indicated as gender neutral
(18858 missing values generated)

. replace male = 1 if sex==1
(9142 real changes made)

. replace male = 0 if sex==2
(9711 real changes made)

. tab sex male

                      |         male
                  sex |         0          1 |     Total
----------------------+----------------------+----------
                 male |         0      9,142 |     9,142 
               female |     9,711          0 |     9,711 
----------------------+----------------------+----------
                Total |     9,711      9,142 |    18,853 


. 
. *       Give within a family two children that are part of the same twin pair the same number.
. tab Extension if multiple_type==2                               // There are multipe twin pairs in some families

   main role in family, not necessarily |
                             biological |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
               first multiple in family |      8,718       49.60       49.60
                 2nd multiple in family |      8,737       49.70       99.30
                 3rd multiple in family |         59        0.34       99.64
                 4th multiple in family |         61        0.35       99.98
                 5th multiple in family |          2        0.01       99.99
                 6th multiple in family |          1        0.01      100.00
----------------------------------------+-----------------------------------
                                  Total |     17,578      100.00

. gen     same_twin = 0 if multiple_type==2
(1280 missing values generated)

. replace same_twin = 1 if multiple_type==2 & (Extension==1 | Extension ==2)
(17455 real changes made)

. replace same_twin = 2 if multiple_type==2 & (Extension==3 | Extension ==4)
(120 real changes made)

. replace same_twin = 3 if multiple_type==2 & (Extension==5 | Extension ==6)
(3 real changes made)

. tab same_twin

  same_twin |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     17,455       99.30       99.30
          2 |        120        0.68       99.98
          3 |          3        0.02      100.00
------------+-----------------------------------
      Total |     17,578      100.00

. 
. *       Give each twin pair a unique id.
. egen twin_id = group(FamilyNumber same_twin)
(1280 missing values generated)

. codebook twin_id

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9066]                     units:  1
         unique values:  9066                     missing .:  1280/18858

                  mean:   4575.92
              std. dev:   2612.04

           percentiles:        10%       25%       50%       75%       90%
                               950      2321      4581      6849      8179

. 
. *       Calculate the number of a twin pair that is observed 
. by twin_id, sort: egen twinsize1a = count(PID) if twin_id<. 
(1280 missing values generated)

. tab twinsize1a

 twinsize1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        554        3.15        3.15
          2 |     17,024       96.85      100.00
------------+-----------------------------------
      Total |     17,578      100.00

. 
. *       Give within a family three children that are part of the same triplet the same number.
. tab Extension if multiple_type==3                               // In families with a triplet, there is only one triplet

   main role in family, not necessarily |
                             biological |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
               first multiple in family |         50       32.89       32.89
                 2nd multiple in family |         51       33.55       66.45
                 3rd multiple in family |         51       33.55      100.00
----------------------------------------+-----------------------------------
                                  Total |        152      100.00

. gen same_trip  = 1 if multiple_type==3
(18706 missing values generated)

. tab same_trip

  same_trip |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        152      100.00      100.00
------------+-----------------------------------
      Total |        152      100.00

. 
. *       Give each triplet a unique id.
. egen trip_id = group(FamilyNumber same_trip)
(18706 missing values generated)

. codebook trip_id

--------------------------------------------------------------------------------------------------------------------------------------------
trip_id                                                                                                        group(FamilyNumber same_trip)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,63]                       units:  1
         unique values:  63                       missing .:  18706/18858

                  mean:   35.1974
              std. dev:   18.2412

           percentiles:        10%       25%       50%       75%       90%
                                 9      19.5        37        51        58

. 
. *       Calculate the number of a triplet that is observed 
. by trip_id, sort: egen tripsize = count(PID) if trip_id<. 
(18706 missing values generated)

. tab tripsize

   tripsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         11        7.24        7.24
          2 |         30       19.74       26.97
          3 |        111       73.03      100.00
------------+-----------------------------------
      Total |        152      100.00

. gen     twin_trip = 0 if multiple_type==3 
(18706 missing values generated)

. replace twin_trip = 1 if multiple_type==3 & tripsize==2
(30 real changes made)

. replace twin_trip = 1 if multiple_type==3 & tripsize==3 & mult_ext <= 2 // They lack info on twzyg, so not included this way
(74 real changes made)

. tab twin_trip 

  twin_trip |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         48       31.58       31.58
          1 |        104       68.42      100.00
------------+-----------------------------------
      Total |        152      100.00

. 
. *       Identify each complete twin pair and the first complete pair within a triplet
. gen pair_complete = .
(18858 missing values generated)

. replace pair_complete = 1 if twinsize1a==2 | twin_trip==1
(17128 real changes made)

. tab pair_complete

pair_comple |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     17,128      100.00      100.00
------------+-----------------------------------
      Total |     17,128      100.00

. 
. *       Give temporary id to each twin pair and to the first complete pair within a triplet
. gen      twtr_id = twin_id                       if multiple_type==2
(1280 missing values generated)

. replace  twtr_id = trip_id + 1000000 if multiple_type==3
(152 real changes made)

. codebook twtr_id

--------------------------------------------------------------------------------------------------------------------------------------------
twtr_id                                                                                                                          (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,1000063]                  units:  1
         unique values:  9129                     missing .:  1128/18858

                  mean:     13110
              std. dev:   91813.8

           percentiles:        10%       25%       50%       75%       90%
                               960      2340    4620.5      6906      8248

. 
. *       Give id to each complete twin pair and to the first complete pair within a triplet
. egen pair_id = group(twtr_id pair_complete) 
(1730 missing values generated)

. codebook pair_id

--------------------------------------------------------------------------------------------------------------------------------------------
pair_id                                                                                                         group(twtr_id pair_complete)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,8564]                     units:  1
         unique values:  8564                     missing .:  1730/18858

                  mean:    4282.5
              std. dev:   2472.29

           percentiles:        10%       25%       50%       75%       90%
                               857    2141.5    4282.5    6423.5      7708

. 
. *       Fix a wrong year of birth
. sort FamilyNumber Extension

. list FamilyNumber if FamilyNumber==FamilyNumber[_n+1] & twtr_id==twtr_id[_n+1] & yob!=yob[_n+1] & twtr_id<. // One family: 1995 vs 1996

       +----------+
       | Family~r |
       |----------|
12332. |    15140 |
       +----------+

. replace yob=1996 if FamilyNumber==15140  // Based on ages at filling in other surveys, correct yob seems to be 1996  
(1 real change made)

. 
. 
. //      STEP 6 ==========================================================================================================
. //      Select cases to be analyzed
. 
. *       Select only twins (no triplets or higher included nor siblings)
. keep if multiple_type==2                                        
(1280 observations deleted)

. tab twinsize1a

 twinsize1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        554        3.15        3.15
          2 |     17,024       96.85      100.00
------------+-----------------------------------
      Total |     17,578      100.00

. codebook twin_id 

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9066]                     units:  1
         unique values:  9066                     missing .:  0/17578

                  mean:   4575.92
              std. dev:   2612.04

           percentiles:        10%       25%       50%       75%       90%
                               950      2321      4581      6849      8179

. 
. *       Select birth cohorts for which information on cito and edu was collected
. keep if yob>1985 & yob<2000
(2333 observations deleted)

. tab twinsize1a

 twinsize1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        539        3.54        3.54
          2 |     14,706       96.46      100.00
------------+-----------------------------------
      Total |     15,245      100.00

. codebook twin_id 

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  7892                     missing .:  0/15245

                  mean:   3997.16
              std. dev:   2304.05

           percentiles:        10%       25%       50%       75%       90%
                               823      2024      3977      5963      7126

. 
. *       Select only twins that entered high school already at the time of survey
. keep if edu12 != .c
(4761 observations deleted)

. tab twinsize1a

 twinsize1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        465        4.44        4.44
          2 |     10,019       95.56      100.00
------------+-----------------------------------
      Total |     10,484      100.00

. codebook twin_id 

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  5731                     missing .:  0/10484

                  mean:    3523.5
              std. dev:   2183.21

           percentiles:        10%       25%       50%       75%       90%
                               672      1679      3294      5380      6459

. 
. *       Select only twins that are in a regular education (not in special education)
. keep if edu12 != .b
(79 observations deleted)

. tab twinsize1a

 twinsize1a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        462        4.44        4.44
          2 |      9,943       95.56      100.00
------------+-----------------------------------
      Total |     10,405      100.00

. codebook twin_id  

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  5699                     missing .:  0/10405

                  mean:   3520.63
              std. dev:   2182.74

           percentiles:        10%       25%       50%       75%       90%
                               672      1677      3293      5374      6457

. 
. *       Show the number of complete / incomplete pairs after these selections
. by twin_id, sort: egen twinsize1b = count(PID) 

. tab twinsize1b

 twinsize1b |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        993        9.54        9.54
          2 |      9,412       90.46      100.00
------------+-----------------------------------
      Total |     10,405      100.00

. codebook twin_id if twinsize1b==2

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  4706                     missing .:  0/9412

                  mean:   3496.94
              std. dev:   2167.13

           percentiles:        10%       25%       50%       75%       90%
                               679      1685    3235.5      5329      6441

. 
. *       Calculate the number of complete pairs with twzyg and male not missing
. by twin_id, sort: egen twinsize2a = count(PID) if twzyg<. & male<. 
(17 missing values generated)

. tab twinsize2a

 twinsize2a |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        992        9.55        9.55
          2 |      9,396       90.45      100.00
------------+-----------------------------------
      Total |     10,388      100.00

. codebook twin_id if twinsize2a==2

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  4698                     missing .:  0/9396

                  mean:   3493.49
              std. dev:   2165.11

           percentiles:        10%       25%       50%       75%       90%
                               678      1683    3233.5      5319      6437

. 
. *       Create variable that helps identify analytic sample
. *       (=only those pairs where at least one has non-missing for cito and only persons that have non-missing for cito)
. by twin_id, sort: egen cito_nm = count(cito_final) 

. tab cito_nm

    cito_nm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,393       13.39       13.39
          1 |      1,192       11.46       24.84
          2 |      7,820       75.16      100.00
------------+-----------------------------------
      Total |     10,405      100.00

. 
. *       Calculate the number of (in)complete pairs of analytical sample 
. by twin_id, sort: egen twinsize2b = count(PID) if twzyg<. & male<. & cito_final<. & cito_nm>0
(1558 missing values generated)

. tab twinsize2b

 twinsize2b |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,035       11.70       11.70
          2 |      7,812       88.30      100.00
------------+-----------------------------------
      Total |      8,847      100.00

. codebook twinsize2b

--------------------------------------------------------------------------------------------------------------------------------------------
twinsize2b                                                                                                                       (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  1558/10405

            tabulation:  Freq.  Value
                          1035  1
                          7812  2
                          1558  .

. codebook twin_id if twinsize2b<.

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9058]                     units:  1
         unique values:  4941                     missing .:  0/8847

                  mean:   3367.56
              std. dev:   2194.82

           percentiles:        10%       25%       50%       75%       90%
                               574      1447      3111      5238      6350

. codebook twin_id if twinsize2b==2       // number of complete pairs for twzyg, male, cito_final

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9058]                     units:  1
         unique values:  3906                     missing .:  0/7812

                  mean:   3334.29
              std. dev:   2186.77

           percentiles:        10%       25%       50%       75%       90%
                               562      1444    3056.5      5196      6344

. 
. *       Calculate the number of a twin pair that is observed with none of the analyzed variables missing
. by twin_id, sort: egen twinsize3 = count(PID) if twin_id<. & twzyg<. & male<. & cito_final<. ///
>                                                                                                                    & delay<. & edu<.
(6592 missing values generated)

. tab twinsize3

  twinsize3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        667       17.49       17.49
          2 |      3,146       82.51      100.00
------------+-----------------------------------
      Total |      3,813      100.00

. codebook twin_id if twinsize3==2

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9033]                     units:  1
         unique values:  1573                     missing .:  0/3146

                  mean:   2841.49
              std. dev:   1977.42

           percentiles:        10%       25%       50%       75%       90%
                               501      1262      2474      4177      5859

. 
. *       Select only twins for which zygosity is known
. keep if twzyg<.
(15 observations deleted)

. tab yob 

    year of |
      birth |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |        132        1.27        1.27
       1987 |        580        5.58        6.85
       1988 |        532        5.12       11.97
       1989 |        571        5.50       17.47
       1990 |        908        8.74       26.21
       1991 |      1,292       12.44       38.64
       1992 |      1,125       10.83       49.47
       1993 |      1,147       11.04       60.51
       1994 |        706        6.79       67.31
       1995 |        764        7.35       74.66
       1996 |      1,092       10.51       85.17
       1997 |        781        7.52       92.69
       1998 |        340        3.27       95.96
       1999 |        420        4.04      100.00
------------+-----------------------------------
      Total |     10,390      100.00

. codebook twin_id 

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  5690                     missing .:  0/10390

                  mean:   3517.78
              std. dev:    2181.7

           percentiles:        10%       25%       50%       75%       90%
                               671      1675    3287.5      5370      6449

. 
. *keep if pair_id < .                                            // Only complete twin pairs and the first complete pair within a triplet
. tab Extension

   main role in family, not necessarily |
                             biological |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
               first multiple in family |      5,159       49.65       49.65
                 2nd multiple in family |      5,163       49.69       99.35
                 3rd multiple in family |         35        0.34       99.68
                 4th multiple in family |         32        0.31       99.99
                 5th multiple in family |          1        0.01      100.00
----------------------------------------+-----------------------------------
                                  Total |     10,390      100.00

. tab mult_ext

     person |
  extension |
   within a |
     set of |
 multiples, |
   equal to |
birth order |
   if known |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,195       50.00       50.00
          2 |      5,195       50.00      100.00
------------+-----------------------------------
      Total |     10,390      100.00

. 
. 
. //      STEP 7 ==========================================================================================================
. //      Make openmx ready: give pseudo-missings, center variables, etc.
. 
. *       Center variables
. center age                if male<. & cito_final<. & cito_nm>0  

. center cito_final if male<. & cito_final<. & cito_nm>0, gen(c_cito)

. center cito_final if male<. & cito_final<. & cito_nm>0, gen(z_cito) s

. sum yob , detail

                        year of birth
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1986           1986
 5%         1987           1986
10%         1988           1986       Obs               10390
25%         1990           1986       Sum of Wgt.       10390

50%         1993                      Mean           1992.718
                        Largest       Std. Dev.      3.299916
75%         1996           1999
90%         1997           1999       Variance       10.88944
95%         1998           1999       Skewness       .0154628
99%         1999           1999       Kurtosis        2.15402

. gen c_yob = yob - 1992 // subtract the mean / median integer (subtracting exact mean leads to rounding problems)

. 
. /*      Create definition variable for cito and give all definition variables pseudo-missing codes.
>         Openmx is not able to analyze cases with missing info on definition variables. 
>         Sometimes one twin has missing info but the co-twin does not, and it would be a waste to kick
>         both out. A trick to prevent this in openmx is to give a pseudo-missing value (e.g., -999) to 
>         the twin that has missing on the definiton variable but set the dependent variables to actual
>         missing for them to prevent that they end up in the analyses with the weird pseudo-missing value.
>         Cito is in this case both a dependent variable and a definition variable (when it functions as moderator)
> */
. gen     defm   = c_cito
(1543 missing values generated)

. replace defm   = -999 if c_cito==.
(1543 real changes made)

. replace edu    = .    if c_cito==.      // This makes sure those with missings are not actually analyzed
(661 real changes made, 661 to missing)

. replace edu    = .    if   male==.      // This makes sure those with missings are not actually analyzed
(0 real changes made)

. replace c_cito = .    if   male==.      // This makes sure those with missings are not actually analyzed
(0 real changes made)

. replace male   = -999 if   male==.
(2 real changes made)

. 
. *       Generate a new "extension" variable based on order what children respond for variable delay
. sort twin_id delay mult_ext

. bysort twin_id: gen mult_ext2 = _n

. codebook mult_ext2

--------------------------------------------------------------------------------------------------------------------------------------------
mult_ext2                                                                                                                        (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  0/10390

            tabulation:  Freq.  Value
                          5690  1
                          4700  2

. 
. *       Select variables to be kept
. keep PID FamilyNumber pair_id twin_id Extension multiple_type mult_ext mult_ext2 mz twzyg male yob c_yob                ///
>          allochtoon nkids agem12 agev12 lfts14 lfts16 lfts18 age c_age edup4c eduparents oplv oplm                                      //
> /
>          edu12 edu14 edu16 edu18 edu edu_alt delay c_cito z_cito cito_final achie4 achie5 achie6 achie8                 ///
>          achie4_1-achie4_4 achie5_1-achie5_5 achie6_1-achie6_6 achie8_1-achie8_8 twinsize1b twinsize2b defm cito_nm

. 
. 
. //      STEP FINALIZE ===================================================================================================
. //      Metadata
. 
. *       !!Update this info if you make a change!!
. label data "NTR_P2_1_`VersionSF1' 2021-02-02"

. notes: VENI Project 2 VENI_P2_clean`VersionSF1' \ VENI_P2_1_Clean06.do \                ///
> NTR data cleaned for P2, Version `VersionSF1' \ a.knigge@uu.nl \ 2021-02-02

. datasignature set, reset
  10390:67(64961):2514177674:1530988537       (data signature set)

. 
. *       !!If you make a change to the do-file, make a short entry of the change in the log below!!
. /*
>         Date            Author                  Description of change
>         2019-07-31      a.knigge@uu.nl  Based on P1_1_Clean01.do; Added edu16 and edu18; fixed mistakes in edu12; 
>                                                                 changed creation of delay
>         2019-09-26      a.knigge@uu.nl  Did not delete pairs who have sex missing as was the case previously.   
>         2020-01-16      a.knigge@uu.nl  Based order of twin pairs on 0: immediate; 1: delayed; .: missing info,
>                                                                 such that the order of disconcordant twins is always 0-1.
>                                                                 Renamed "ability" dummies into "achievement"
>                                                                 Generated a dummy indicating whether pair is MZ or DZ.
>                                                                 Selected only twins born between 1986 and 1999 with known zygosity.
>                                                                 Renamed "hetero_class" into "delay"
>         2020-09-07      a.knigge@uu.nl  Changed scoring of educational attainment (VMBO-g equal score as VMBO-t);
>                                                                 Changed "achievement"-dummies slightly based on the official staatscourant
>  table;
>                                                                 Calculated centering based on cases actually analyzed;
>                                                                 Kept more variables in for descriptive analyses.
>         2021-01-26      a.knigge@uu.nl  Kept those pairs in where one has missing on cito but the other has not.
>                                                                 Gave "pseudo-missing codes" to missing definition variables data.
> */
. 
. *       Save the data
. save "`path1'NTR_P2_1_`VersionSF1'", replace
file P2/WorkInProgress/Analyses/NTR_P2_1_06.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/DataCleaning/VENI_P2_1_Clean06.log
  log type:  text
 closed on:   2 Feb 2021, 12:08:38
--------------------------------------------------------------------------------------------------------------------------------------------
