-----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/Analyses/VENI_P2_DescriptiveAnalyses05.log
  log type:  text
 opened on:   9 Dec 2021, 15:04:07

. 
. /*
> File:                   VENI_P2_DescriptiveAnalyses05.do
> Author(s):              a.knigge@uu.nl 
> Date:                   2020-01-14
> Purpose:                Clean dataset and create variables.
> Source data:    NTR_P2_1_06.dta
> Contains:               Data from the Netherlands Twin Register prepared for analyses
> Remarks:                Comments starting and ending with !! point out that action may be required if you change anything to this do-fi
> le
> */
. 
. //      STEP 0 ==========================================================================================================
. //      Program Setup
. 
. version 13.1

. clear all

. set linesize 140

. macro drop _all

. set more off

. 
. 
. *       We make locals for the path(s) of the folder(s) in which the data that we use and save can be found. 
. *       The purpose? If there is a change in the directory structure, the paths only need to be updated once, namely here.
. local path1 = "P2/WorkInProgress/Analyses/"

. 
. /*      
>         The dataset(s) that is/are used may change. Then, they get a different version number. 
>         !!Change numbers below to use the newest version of a dataset!! 
> */
. local VersionUF1 = "06"         // UF1 = UsedFile1 

. 
. use "`path1'NTR_P2_1_`VersionUF1'", clear
(NTR_P2_1_06 2021-02-02)

. 
. /*
>         We save in this do-file some graphs  
>         If anything changes in the do-file: 
>         !!Update below the version number of the figures that are saved!!
> */
. local VersionSF1 = "03"         // SF1 = SavedFigure1

. 
. 
. //      STEP 1 ==========================================================================================================
. //      Descriptives
. 
. *       Generate descriptives of the variables for table in paper
. *       (cito_nm>0 indicates that at least one of the twin pair should have non-missing on cito)
. sum edu cito_final delay yob male age 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         edu |      5579    2.757573    1.106499          0          4
  cito_final |      8849    537.9924    8.443786        501        550
       delay |      6784     .239092    .4265605          0          1
         yob |     10390    1992.718    3.299916       1986       1999
        male |     10390    .2754572     13.8751       -999          1
-------------+--------------------------------------------------------
         age |      6240    15.72559    1.495032         13         21

. sum edu cito_final delay yob male age if cito_nm>0 & c_cito<.                   

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         edu |      5579    2.757573    1.106499          0          4
  cito_final |      8847    537.9917    8.444285        501        550
       delay |      5921    .2595845    .4384437          0          1
         yob |      8847    1992.455    3.330155       1986       1999
        male |      8847     .463773    .4987141          0          1
-------------+--------------------------------------------------------
         age |      5579    15.78127    1.493014         13         21

. sum edu cito_final delay yob male age if cito_nm>0 & c_cito<. & mz==1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         edu |      2128    2.789239    1.104064          0          4
  cito_final |      3243    538.1508    8.451868        501        550
       delay |      2187    .2821216    .4501352          0          1
         yob |      3243    1992.253    3.359186       1986       1999
        male |      3243    .4375578    .4961622          0          1
-------------+--------------------------------------------------------
         age |      2128    15.88472    1.470844         13         21

. sum edu cito_final delay yob male age if cito_nm>0 & c_cito<. & mz==0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         edu |      3451    2.738047    1.107706          0          4
  cito_final |      5604    537.8997    8.439279        502        550
       delay |      3734    .2463846    .4309628          0          1
         yob |      5604    1992.571    3.307939       1986       1999
        male |      5604    .4789436     .499601          0          1
-------------+--------------------------------------------------------
         age |      3451    15.71747    1.503189         13         19

. 
. *       Overview of number of pairs in the analyses
. codebook twin_id 

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9060]                     units:  1
         unique values:  5690                     missing .:  0/10390

                  mean:   3517.78
              std. dev:    2181.7

           percentiles:        10%       25%       50%       75%       90%
                               671      1675    3287.5      5370      6449

. codebook twin_id if cito_nm>0 & c_cito<.

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9058]                     units:  1
         unique values:  4941                     missing .:  0/8847

                  mean:   3367.56
              std. dev:   2194.82

           percentiles:        10%       25%       50%       75%       90%
                               574      1447      3111      5238      6350

. codebook twin_id if cito_nm>0 & c_cito<. & mz==1

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [7,9056]                     units:  1
         unique values:  1725                     missing .:  0/3243

                  mean:   3339.91
              std. dev:   2247.65

           percentiles:        10%       25%       50%       75%       90%
                               520      1347      3070      5228      6415

. codebook twin_id if cito_nm>0 & c_cito<. & mz==0

--------------------------------------------------------------------------------------------------------------------------------------------
twin_id                                                                                                        group(FamilyNumber same_twin)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1,9058]                     units:  1
         unique values:  3216                     missing .:  0/5604

                  mean:   3383.57
              std. dev:   2163.69

           percentiles:        10%       25%       50%       75%       90%
                               604      1515    3128.5      5248      6326

. 
. *       Size of timing of tracking groups
. codebook delay if cito_nm>0 & c_cito<.

--------------------------------------------------------------------------------------------------------------------------------------------
delay                                                                                                                            (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  2926/8847

            tabulation:  Freq.  Value
                          4384  0
                          1537  1
                          2926  .

. 
. *       Descriptive information on selectivity for selectivity section paper
. tab oplm       if cito_nm>0 & c_cito<. & oplm>-1

       oplm |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         28        0.36        0.36
          2 |        152        1.98        2.34
          3 |      1,000       13.01       15.35
          4 |        180        2.34       17.69
          5 |        848       11.03       28.72
          6 |        137        1.78       30.50
          7 |        777       10.11       40.60
          8 |        259        3.37       43.97
          9 |      2,099       27.30       71.27
         10 |        255        3.32       74.59
         11 |      1,410       18.34       92.92
         12 |        463        6.02       98.95
         13 |         81        1.05      100.00
------------+-----------------------------------
      Total |      7,689      100.00

. tab oplv           if cito_nm>0 & c_cito<. & oplv>-1

       oplv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         48        0.64        0.64
          2 |         77        1.03        1.66
          3 |        394        5.24        6.91
          4 |        276        3.67       10.58
          5 |      1,139       15.16       25.75
          6 |        115        1.53       27.28
          7 |        371        4.94       32.22
          8 |        337        4.49       36.70
          9 |      1,697       22.59       59.29
         10 |        433        5.76       65.06
         11 |      1,479       19.69       84.74
         12 |        896       11.93       96.67
         13 |        250        3.33      100.00
------------+-----------------------------------
      Total |      7,512      100.00

. tab allochtoon if cito_nm>0 & c_cito<. & allochtoon>-1

  Immigrants, at least |
    one parent is born |
       outside holland |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 dutch |      8,060       93.49       93.49
      antllies + aruba |         28        0.32       93.82
               surinam |         60        0.70       94.51
 remaining not-western |        176        2.04       96.55
                turkey |         33        0.38       96.94
               marocco |         11        0.13       97.07
               western |        253        2.93      100.00
-----------------------+-----------------------------------
                 Total |      8,621      100.00

. 
. 
. //      STEP 2 ==========================================================================================================
. //      Relate choice for homogeneous vs heterogeneous class to parental education and own achievement 
. 
. *       Necessary to take dependence between twins into account
. svyset twin_id

      pweight: <none>
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: twin_id
        FPC 1: <zero>

. 
. *       Relation with parental education
.          tab edup4c     delay if cito_nm>0 & c_cito<., row chi2

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |       634        195 |       829 
                      |     76.48      23.52 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |     1,466        546 |     2,012 
                      |     72.86      27.14 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |     1,160        481 |     1,641 
                      |     70.69      29.31 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |       740        258 |       998 
                      |     74.15      25.85 |    100.00 
----------------------+----------------------+----------
                Total |     4,000      1,480 |     5,480 
                      |     72.99      27.01 |    100.00 

          Pearson chi2(3) =  10.2199   Pr = 0.017

. svy: tab edup4c         delay if cito_nm>0 & c_cito<., row                      // Table 4
(running tabulate on estimation sample)

Number of strata   =         1                  Number of obs      =      5480
Number of PSUs     =      3051                  Population size    =      5480
                                                Design df          =      3050

-------------------------------
RECODE of |
eduparent |        delay       
s         |     0      1  Total
----------+--------------------
 Primary/ | .7648  .2352      1
 Upper se | .7286  .2714      1
 Tertiary | .7069  .2931      1
 Tertiary | .7415  .2585      1
          | 
    Total | .7299  .2701      1
-------------------------------
  Key:  row proportions

  Pearson:
    Uncorrected   chi2(3)         =   10.2199
    Design-based  F(3.00, 9148.92)=    2.0048     P = 0.1110

. ttest eduparents                  if cito_nm>0 & c_cito<., by(delay)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    4000       9.225     .040651    2.570997    9.145301    9.304699
       1 |    1480    9.343919    .0641929     2.46955       9.218    9.469838
---------+--------------------------------------------------------------------
combined |    5480    9.257117    .0343702    2.544322    9.189738    9.324496
---------+--------------------------------------------------------------------
    diff |           -.1189189    .0774012                -.270656    .0328182
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.5364
Ho: diff = 0                                     degrees of freedom =     5478

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0622         Pr(|T| > |t|) = 0.1245          Pr(T > t) = 0.9378

. 
. *       Relation with own achievement
.          tab achie5     delay if cito_nm>0 & c_cito<., row chi2

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

 RECODE of cito_final |         delay
   (final citoscore.) |         0          1 |     Total
----------------------+----------------------+----------
           VMBO Basis |       361         24 |       385 
                      |     93.77       6.23 |    100.00 
----------------------+----------------------+----------
           VMBO Kader |       416         45 |       461 
                      |     90.24       9.76 |    100.00 
----------------------+----------------------+----------
VMBO Theoretisch & Ge |     1,038        310 |     1,348 
                      |     77.00      23.00 |    100.00 
----------------------+----------------------+----------
                 HAVO |     1,382        754 |     2,136 
                      |     64.70      35.30 |    100.00 
----------------------+----------------------+----------
                  VWO |     1,187        404 |     1,591 
                      |     74.61      25.39 |    100.00 
----------------------+----------------------+----------
                Total |     4,384      1,537 |     5,921 
                      |     74.04      25.96 |    100.00 

          Pearson chi2(4) = 244.2468   Pr = 0.000

. svy: tab achie5         delay if cito_nm>0 & c_cito<., row
(running tabulate on estimation sample)

Number of strata   =         1                  Number of obs      =      5921
Number of PSUs     =      3305                  Population size    =      5921
                                                Design df          =      3304

-------------------------------
RECODE of |
cito_fina |
l (final  |
citoscore |        delay       
.)        |     0      1  Total
----------+--------------------
 VMBO Bas | .9377  .0623      1
 VMBO Kad | .9024  .0976      1
 VMBO The |   .77    .23      1
     HAVO |  .647   .353      1
      VWO | .7461  .2539      1
          | 
    Total | .7404  .2596      1
-------------------------------
  Key:  row proportions

  Pearson:
    Uncorrected   chi2(4)         =  244.2468
    Design-based  F(3.91, 12905.72)=   51.9041    P = 0.0000

.          tab achie6     delay if cito_nm>0 & c_cito<., row chi2 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

 RECODE of cito_final |         delay
   (final citoscore.) |         0          1 |     Total
----------------------+----------------------+----------
   VMBO Basis + Kader |       777         69 |       846 
                      |     91.84       8.16 |    100.00 
----------------------+----------------------+----------
VMBO Theoretisch & Ge |       453        107 |       560 
                      |     80.89      19.11 |    100.00 
----------------------+----------------------+----------
VMBO Theoretisch & Ge |       585        203 |       788 
                      |     74.24      25.76 |    100.00 
----------------------+----------------------+----------
                 HAVO |       488        244 |       732 
                      |     66.67      33.33 |    100.00 
----------------------+----------------------+----------
           HAVO / VWO |       894        510 |     1,404 
                      |     63.68      36.32 |    100.00 
----------------------+----------------------+----------
                  VWO |     1,187        404 |     1,591 
                      |     74.61      25.39 |    100.00 
----------------------+----------------------+----------
                Total |     4,384      1,537 |     5,921 
                      |     74.04      25.96 |    100.00 

          Pearson chi2(5) = 252.6704   Pr = 0.000

. svy: tab achie6         delay if cito_nm>0 & c_cito<., row 
(running tabulate on estimation sample)

Number of strata   =         1                  Number of obs      =      5921
Number of PSUs     =      3305                  Population size    =      5921
                                                Design df          =      3304

-------------------------------
RECODE of |
cito_fina |
l (final  |
citoscore |        delay       
.)        |     0      1  Total
----------+--------------------
 VMBO Bas | .9184  .0816      1
 VMBO The | .8089  .1911      1
 VMBO The | .7424  .2576      1
     HAVO | .6667  .3333      1
 HAVO / V | .6368  .3632      1
      VWO | .7461  .2539      1
          | 
    Total | .7404  .2596      1
-------------------------------
  Key:  row proportions

  Pearson:
    Uncorrected   chi2(5)         =  252.6704
    Design-based  F(4.92, 16245.41)=   43.1094    P = 0.0000

.          tab achie8     delay if cito_nm>0 & c_cito<., row chi2

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

 RECODE of cito_final |         delay
   (final citoscore.) |         0          1 |     Total
----------------------+----------------------+----------
           VMBO Basis |       153         10 |       163 
                      |     93.87       6.13 |    100.00 
----------------------+----------------------+----------
   VMBO Basis / Kader |       337         25 |       362 
                      |     93.09       6.91 |    100.00 
----------------------+----------------------+----------
           VMBO Kader |       287         34 |       321 
                      |     89.41      10.59 |    100.00 
----------------------+----------------------+----------
VMBO Theoretisch & Ge |       453        107 |       560 
                      |     80.89      19.11 |    100.00 
----------------------+----------------------+----------
VMBO Theoretisch & Ge |       585        203 |       788 
                      |     74.24      25.76 |    100.00 
----------------------+----------------------+----------
                 HAVO |       488        244 |       732 
                      |     66.67      33.33 |    100.00 
----------------------+----------------------+----------
           HAVO / VWO |       894        510 |     1,404 
                      |     63.68      36.32 |    100.00 
----------------------+----------------------+----------
                  VWO |     1,187        404 |     1,591 
                      |     74.61      25.39 |    100.00 
----------------------+----------------------+----------
                Total |     4,384      1,537 |     5,921 
                      |     74.04      25.96 |    100.00 

          Pearson chi2(7) = 254.3021   Pr = 0.000

. svy: tab achie8         delay if cito_nm>0 & c_cito<., row                      // Table 5
(running tabulate on estimation sample)

Number of strata   =         1                  Number of obs      =      5921
Number of PSUs     =      3305                  Population size    =      5921
                                                Design df          =      3304

-------------------------------
RECODE of |
cito_fina |
l (final  |
citoscore |        delay       
.)        |     0      1  Total
----------+--------------------
 VMBO Bas | .9387  .0613      1
 VMBO Bas | .9309  .0691      1
 VMBO Kad | .8941  .1059      1
 VMBO The | .8089  .1911      1
 VMBO The | .7424  .2576      1
     HAVO | .6667  .3333      1
 HAVO / V | .6368  .3632      1
      VWO | .7461  .2539      1
          | 
    Total | .7404  .2596      1
-------------------------------
  Key:  row proportions

  Pearson:
    Uncorrected   chi2(7)         =  254.3021
    Design-based  F(6.89, 22762.75)=   31.6705    P = 0.0000

.          tab cito_final delay if cito_nm>0 & c_cito<., row chi2

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     final |         delay
citoscore. |         0          1 |     Total
-----------+----------------------+----------
       501 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       502 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       504 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       506 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       507 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
       509 |         5          0 |         5 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       510 |         7          0 |         7 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       511 |         8          0 |         8 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       512 |         7          0 |         7 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       513 |         5          1 |         6 
           |     83.33      16.67 |    100.00 
-----------+----------------------+----------
       514 |        12          1 |        13 
           |     92.31       7.69 |    100.00 
-----------+----------------------+----------
       515 |        21          1 |        22 
           |     95.45       4.55 |    100.00 
-----------+----------------------+----------
       516 |        21          2 |        23 
           |     91.30       8.70 |    100.00 
-----------+----------------------+----------
       517 |        32          2 |        34 
           |     94.12       5.88 |    100.00 
-----------+----------------------+----------
       518 |        29          2 |        31 
           |     93.55       6.45 |    100.00 
-----------+----------------------+----------
       519 |        26          1 |        27 
           |     96.30       3.70 |    100.00 
-----------+----------------------+----------
       520 |        40          3 |        43 
           |     93.02       6.98 |    100.00 
-----------+----------------------+----------
       521 |        31          1 |        32 
           |     96.88       3.12 |    100.00 
-----------+----------------------+----------
       522 |        46          2 |        48 
           |     95.83       4.17 |    100.00 
-----------+----------------------+----------
       523 |        65          7 |        72 
           |     90.28       9.72 |    100.00 
-----------+----------------------+----------
       524 |        63          6 |        69 
           |     91.30       8.70 |    100.00 
-----------+----------------------+----------
       525 |        66          5 |        71 
           |     92.96       7.04 |    100.00 
-----------+----------------------+----------
       526 |        96         10 |       106 
           |     90.57       9.43 |    100.00 
-----------+----------------------+----------
       527 |        90          8 |        98 
           |     91.84       8.16 |    100.00 
-----------+----------------------+----------
       528 |       101         16 |       117 
           |     86.32      13.68 |    100.00 
-----------+----------------------+----------
       529 |       132         21 |       153 
           |     86.27      13.73 |    100.00 
-----------+----------------------+----------
       530 |        93         25 |       118 
           |     78.81      21.19 |    100.00 
-----------+----------------------+----------
       531 |       104         29 |       133 
           |     78.20      21.80 |    100.00 
-----------+----------------------+----------
       532 |       124         32 |       156 
           |     79.49      20.51 |    100.00 
-----------+----------------------+----------
       533 |       131         32 |       163 
           |     80.37      19.63 |    100.00 
-----------+----------------------+----------
       534 |       129         53 |       182 
           |     70.88      29.12 |    100.00 
-----------+----------------------+----------
       535 |       166         51 |       217 
           |     76.50      23.50 |    100.00 
-----------+----------------------+----------
       536 |       159         67 |       226 
           |     70.35      29.65 |    100.00 
-----------+----------------------+----------
       537 |       147         77 |       224 
           |     65.62      34.38 |    100.00 
-----------+----------------------+----------
       538 |       173         81 |       254 
           |     68.11      31.89 |    100.00 
-----------+----------------------+----------
       539 |       168         86 |       254 
           |     66.14      33.86 |    100.00 
-----------+----------------------+----------
       540 |       209         97 |       306 
           |     68.30      31.70 |    100.00 
-----------+----------------------+----------
       541 |       175         96 |       271 
           |     64.58      35.42 |    100.00 
-----------+----------------------+----------
       542 |       176         96 |       272 
           |     64.71      35.29 |    100.00 
-----------+----------------------+----------
       543 |       154        103 |       257 
           |     59.92      40.08 |    100.00 
-----------+----------------------+----------
       544 |       180        118 |       298 
           |     60.40      39.60 |    100.00 
-----------+----------------------+----------
       545 |       177         91 |       268 
           |     66.04      33.96 |    100.00 
-----------+----------------------+----------
       546 |       153         99 |       252 
           |     60.71      39.29 |    100.00 
-----------+----------------------+----------
       547 |       203         78 |       281 
           |     72.24      27.76 |    100.00 
-----------+----------------------+----------
       548 |       187         52 |       239 
           |     78.24      21.76 |    100.00 
-----------+----------------------+----------
       549 |       176         34 |       210 
           |     83.81      16.19 |    100.00 
-----------+----------------------+----------
       550 |       291         50 |       341 
           |     85.34      14.66 |    100.00 
-----------+----------------------+----------
     Total |     4,384      1,537 |     5,921 
           |     74.04      25.96 |    100.00 

         Pearson chi2(46) = 347.1046   Pr = 0.000

. svy: tab cito_final delay if cito_nm>0 & c_cito<., row
(running tabulate on estimation sample)

Number of strata   =         1                  Number of obs      =      5921
Number of PSUs     =      3305                  Population size    =      5921
                                                Design df          =      3304

-------------------------------
final     |
citoscore |        delay       
.         |     0      1  Total
----------+--------------------
      501 |     1      0      1
      502 |     1      0      1
      504 |     1      0      1
      506 |     1      0      1
      507 |     0      1      1
      509 |     1      0      1
      510 |     1      0      1
      511 |     1      0      1
      512 |     1      0      1
      513 | .8333  .1667      1
      514 | .9231  .0769      1
      515 | .9545  .0455      1
      516 |  .913   .087      1
      517 | .9412  .0588      1
      518 | .9355  .0645      1
      519 |  .963   .037      1
      520 | .9302  .0698      1
      521 | .9688  .0313      1
      522 | .9583  .0417      1
      523 | .9028  .0972      1
      524 |  .913   .087      1
      525 | .9296  .0704      1
      526 | .9057  .0943      1
      527 | .9184  .0816      1
      528 | .8632  .1368      1
      529 | .8627  .1373      1
      530 | .7881  .2119      1
      531 |  .782   .218      1
      532 | .7949  .2051      1
      533 | .8037  .1963      1
      534 | .7088  .2912      1
      535 |  .765   .235      1
      536 | .7035  .2965      1
      537 | .6563  .3437      1
      538 | .6811  .3189      1
      539 | .6614  .3386      1
      540 |  .683   .317      1
      541 | .6458  .3542      1
      542 | .6471  .3529      1
      543 | .5992  .4008      1
      544 |  .604   .396      1
      545 | .6604  .3396      1
      546 | .6071  .3929      1
      547 | .7224  .2776      1
      548 | .7824  .2176      1
      549 | .8381  .1619      1
      550 | .8534  .1466      1
          | 
    Total | .7404  .2596      1
-------------------------------
  Key:  row proportions

  Pearson:
    Uncorrected   chi2(46)        =  347.1046
    Design-based  F(42.64,  1.4e+05)=    7.3013   P = 0.0000

. ttest cito_final          if cito_nm>0 & c_cito<., by(delay)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    4384    537.5021    .1379359    9.132982    537.2316    537.7725
       1 |    1537    540.1516     .158906    6.229847    539.8399    540.4633
---------+--------------------------------------------------------------------
combined |    5921    538.1898    .1111689    8.554225    537.9719    538.4078
---------+--------------------------------------------------------------------
    diff |           -2.649541    .2512469               -3.142077   -2.157006
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -10.5456
Ho: diff = 0                                     degrees of freedom =     5919

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
. corr edu cito_final achie8 achie6 achie5 if cito_nm>0 & c_cito<.
(obs=5579)

             |      edu cito_f~l   achie8   achie6   achie5
-------------+---------------------------------------------
         edu |   1.0000
  cito_final |   0.7020   1.0000
      achie8 |   0.6933   0.9797   1.0000
      achie6 |   0.7026   0.9615   0.9865   1.0000
      achie5 |   0.6760   0.9622   0.9719   0.9556   1.0000


. 
. *       Relation with parental education given own achievement (not in paper)
. bysort achie8: tab edup4c delay if cito_nm>0 & c_cito<., chi2 row 

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = VMBO Basis

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        54          1 |        55 
                      |     98.18       1.82 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |        65          5 |        70 
                      |     92.86       7.14 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |        19          2 |        21 
                      |     90.48       9.52 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |         5          1 |         6 
                      |     83.33      16.67 |    100.00 
----------------------+----------------------+----------
                Total |       143          9 |       152 
                      |     94.08       5.92 |    100.00 

          Pearson chi2(3) =   3.5827   Pr = 0.310

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = VMBO Basis / Kader

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |       101          3 |       104 
                      |     97.12       2.88 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       133         11 |       144 
                      |     92.36       7.64 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |        54          7 |        61 
                      |     88.52      11.48 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |         8          1 |         9 
                      |     88.89      11.11 |    100.00 
----------------------+----------------------+----------
                Total |       296         22 |       318 
                      |     93.08       6.92 |    100.00 

          Pearson chi2(3) =   4.9567   Pr = 0.175

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = VMBO Kader

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        76          8 |        84 
                      |     90.48       9.52 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       116         16 |       132 
                      |     87.88      12.12 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |        53          5 |        58 
                      |     91.38       8.62 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |        14          1 |        15 
                      |     93.33       6.67 |    100.00 
----------------------+----------------------+----------
                Total |       259         30 |       289 
                      |     89.62      10.38 |    100.00 

          Pearson chi2(3) =   0.9117   Pr = 0.823

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = VMBO Theoretisch & Gemengd

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        91         21 |       112 
                      |     81.25      18.75 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       197         36 |       233 
                      |     84.55      15.45 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |        97         32 |       129 
                      |     75.19      24.81 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |        37         14 |        51 
                      |     72.55      27.45 |    100.00 
----------------------+----------------------+----------
                Total |       422        103 |       525 
                      |     80.38      19.62 |    100.00 

          Pearson chi2(3) =   6.8056   Pr = 0.078

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = VMBO Theoretisch & Gemengd / HAVO

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        84         27 |       111 
                      |     75.68      24.32 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       246         78 |       324 
                      |     75.93      24.07 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |       137         64 |       201 
                      |     68.16      31.84 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |        60         25 |        85 
                      |     70.59      29.41 |    100.00 
----------------------+----------------------+----------
                Total |       527        194 |       721 
                      |     73.09      26.91 |    100.00 

          Pearson chi2(3) =   4.4575   Pr = 0.216

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = HAVO

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        66         48 |       114 
                      |     57.89      42.11 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       202         91 |       293 
                      |     68.94      31.06 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |       116         69 |       185 
                      |     62.70      37.30 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |        54         31 |        85 
                      |     63.53      36.47 |    100.00 
----------------------+----------------------+----------
                Total |       438        239 |       677 
                      |     64.70      35.30 |    100.00 

          Pearson chi2(3) =   4.9940   Pr = 0.172

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = HAVO / VWO

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        99         60 |       159 
                      |     62.26      37.74 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       272        173 |       445 
                      |     61.12      38.88 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |       293        160 |       453 
                      |     64.68      35.32 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |       159         99 |       258 
                      |     61.63      38.37 |    100.00 
----------------------+----------------------+----------
                Total |       823        492 |     1,315 
                      |     62.59      37.41 |    100.00 

          Pearson chi2(3) =   1.3628   Pr = 0.714

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = VWO

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |         delay
 RECODE of eduparents |         0          1 |     Total
----------------------+----------------------+----------
Primary/lower seconda |        63         27 |        90 
                      |     70.00      30.00 |    100.00 
----------------------+----------------------+----------
Upper secondary: havo |       235        136 |       371 
                      |     63.34      36.66 |    100.00 
----------------------+----------------------+----------
Tertiary: hbo, few ye |       391        142 |       533 
                      |     73.36      26.64 |    100.00 
----------------------+----------------------+----------
Tertiary: uni, postdo |       403         86 |       489 
                      |     82.41      17.59 |    100.00 
----------------------+----------------------+----------
                Total |     1,092        391 |     1,483 
                      |     73.63      26.37 |    100.00 

          Pearson chi2(3) =  40.2869   Pr = 0.000

--------------------------------------------------------------------------------------------------------------------------------------------
-> achie8 = .
no observations


. table achie8 edup4c             if cito_nm>0 & c_cito<., contents(mean delay)

--------------------------------------------------------------------------------------------------------------------------------------------
RECODE of cito_final (final       |                                           RECODE of eduparents                                          
citoscore.)                       | Primary/lower second Upper secondary: hav Tertiary: hbo, few y Tertiary: uni, postd                   .a
----------------------------------+---------------------------------------------------------------------------------------------------------
                       VMBO Basis |             .0181818             .0714286             .0952381             .1666667                     
               VMBO Basis / Kader |             .0288462             .0763889             .1147541             .1111111                    0
                       VMBO Kader |             .0952381             .1212121             .0862069             .0666667                     
       VMBO Theoretisch & Gemengd |                .1875             .1545064              .248062             .2745098                     
VMBO Theoretisch & Gemengd / HAVO |             .2432432             .2407407              .318408             .2941177                    0
                             HAVO |             .4210526             .3105802              .372973             .3647059                    0
                       HAVO / VWO |             .3773585             .3887641             .3532009             .3837209                    0
                              VWO |                   .3             .3665768             .2664165             .1758691                     
--------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
. //      STEP 3 ==========================================================================================================
. //      Get an idea how cito score relates to educational attainment (not in paper)
. 
. lowess edu12    cito_final if cito_nm>0 & c_cito<. & mult_ext==1,  jitter(3) 

. graph export "`path1'TablesFigures/VENI_P2_LowessEdu12_`VersionSF1'.pdf", replace 
(file /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/Analyses/TablesFigures/VENI_P2_LowessEdu12_03.pdf written in PDF format)

. lowess edu      cito_final if cito_nm>0 & c_cito<. & mult_ext==1,  jitter(3)

. graph export "`path1'TablesFigures/VENI_P2_LowessEdu_`VersionSF1'.pdf", replace 
(file /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/Analyses/TablesFigures/VENI_P2_LowessEdu_03.pdf written in PDF format)

. lowess edu_alt  cito_final if cito_nm>0 & c_cito<. & mult_ext==1,  jitter(3)

. graph export "`path1'TablesFigures/VENI_P2_LowessEdu_alt_`VersionSF1'.pdf", replace 
(file /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/Analyses/TablesFigures/VENI_P2_LowessEdu_alt_03.pdf written in PDF format)

. 
. 
. //      STEP FINALIZE ===================================================================================================
. //      Metadata
. 
. *       !!If you make a change to the do-file, make a short entry of the change in the log below!!
. /*
>         Date            Author                  Description of change
>         2020-09-09      a.knigge@uu.nl  Used the new scoring of edu; used achie8 instead of achie6 in the tables;
>                                                                 Added input for descriptive table of paper; Added input for selectivity nu
> mbers paper;
>                                                                 Based all results on analytic sample as much as possible;
>                                                                 Fixed path of log.
>         2020-12-21      a.knigge@uu.nl  Fixed Chi2 test for dependence of observations  
>         2021-02-02      a.knigge@uu.nl  Used dataset version 6: which includes those pairs where one twin has info on CITO.
>         2021-12-09      a.knigge@uu.nl  Added info on size of immediate/delayed groups.
> */
. 
. log close
      name:  <unnamed>
       log:  /Users/Antonie/surfdrive/Onderzoek/VENI/P2/WorkInProgress/Analyses/VENI_P2_DescriptiveAnalyses05.log
  log type:  text
 closed on:   9 Dec 2021, 15:04:25
--------------------------------------------------------------------------------------------------------------------------------------------
